{"id":"824059814042167296","name":"Lazy Export","lastUpdateDate":"2020-04-12T22:53:24.283Z","publisherHandle":"kocheck","publisherImage":"https://s3-alpha.figma.com/profile/345db7ca-760f-456d-8b92-a9acda030d94","publisherId":"147627","publisherName":"Kyle Kochanek","description":"⏰ Version 1.1.4 \n\nLazy export is inspired by a feature that was apart of my workflow in Sketch. I became tired of manually applying export settings across assets and projects. So this was born March 21st, locked up in my apartment.\n\nLazy export is inspired by a feature that was apart of my workflow in sketch. I became tired of manually applying export settings across assets and projects. So this was born March 21st, locked up in my apartment.\n\n⚡️ Lazy Export allows the user to apply default export settings to selected objects in Figma.\n\n🧠 How does it work?\nThere are two ways to trigger your export settings to be applied. The first is a window giving you UI access to run the plugin commands. (Set Platform, Apply Settings, Clear Settings)\nThe second is via the plugin menu; this makes the actions searchable in Figma with the `⌘+/` command.\n\n🔧  Currently supported:\n• IOS \n• IOS Adv.\n• Android\n• Android Adv.\n• Web\n\n📦 Export Options\n\n✨ Export Settings\nWith Lazy export, you have two mobile options on how you can apply export settings.\n\n• Default Export\n• Advanced Export\n\nWith the default export, this follows the trends for exporting assets for mobile at the different screen densities. Advanced is still being worked on for a smooth workflow.\n\nℹ️ The end goal for Advanced Export Options, would be for a developer to hit apply, and Figma exports a folder of assets the developer can drop into Android Studio or Xcode.\n\nAndroid Suffix\n`drawable-mdpi`\n\nIOS Suffix\n`/default-asset@1x`\n\nAndroid Advance Suffix\n`/drawable-mdpi/default-asset`\n\nIOS Advance Suffix\n`/default-asset.imageset/default-asset@1x`\n\n✍️ Custom Asset Naming\n\nRight now, if you do not apply a custom name to each asset, a default one will be used. \n    📆 I have plans on the roadmap to adjust this.\n\nDefault Name String = `default-asset`\n\n🐛 Have a feature request or bug? Please feel free to add an issue!\nDevelopment, issues, and feature requests https://github.com/kocheck/Lazy-Export","url":"https://www.figma.com/community/plugin/824059814042167296","iconUrl":"https://www.figma.com/community/plugin/824059814042167296/icon","thumbnailUrl":"https://www.figma.com/community/plugin/824059814042167296/thumbnail"}
