{"id":"995046860249565394","name":"Tunas Sawa Erma Group CAPTCHA UI Kit (Community)","lastUpdateDate":"2021-07-08T19:20:58.683Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968377577/768fbb8a-1224-4eb2-83e5-043e6aa7cf09-cover.png","description":"<p><strong>Tunas Sawa Erma Group</strong> merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang usaha perkebunan dan pengolahan minyak kelapa sawit bersama dengan bersama dengan kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang sepenuhnya bergerak di dalam bidang budidaya kelapa sawit dan memproses minyak sawit mentah (Crude Palm Oil/CPO) dan juga berlokasi di Papua. Sejak th. 1995, Tunas Sawa Erma Group memulai usaha kelapa sawit di Papua atas permintaan Pemerintah Daerah. Kondisi infrastruktur kala itu senantiasa minim, namun Tunas Sawa Erma Group dapat berkembang baik dan juga menjadi pihak pertama yang berkontribusi di dalam pembangunan jalan Trans-Papua.</p><p><br></p><p>Sesuai bersama dengan bersama dengan visi dan misi untuk menjadi perusahaan global, Tunas Sawa Erma Group punya komitmen pada kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang telah berlangsung dan tertuang secara mengerti di website resmi perusahaan. Areal konsesi kita tidak berlokasi di lahan gambut. Selain itu, TSE Group juga menciptakan sistem dan lingkungan kerja yang menunjang pengembangan sumber energi manusia lewat program seleksi dan pelatihan dan juga pembangunan berkelanjutan. Saat ini perusahaan juga telah punya tim Sustainability.</p><p><br></p><p>Kami juga mengapresiasi kontribusi para karyawan yang senantiasa berkembang bersama dengan bersama dengan perusahaan. Atas dedikasinya, Tunas Sawa Erma Group telah mempromosikan 70% berasal dari karyawan menjadi karyawan tetap. Kemajuan wanita juga menjadi anggota berasal dari perhatian kami. Sebanyak 20% berasal dari total karyawan adalah perempuan dan kita senantiasa menunjang untuk meraih potensi paling baik mereka.​</p><p><br></p><p>Tak cuma itu, Tunas Sawa Erma Group Sebagai perusahaan juga senantiasa pelihara pertalian yang seirama dan saling membangun bersama dengan bersama dengan Pemerintah Daerah maupun masyarakat setempat, dan juga senantiasa aktif di dalam kegiatan pengembangan ekonomi dan kesejahteraan masyarakat Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang telah beroperasi yaitu punya PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.&nbsp;</p>","url":"https://www.figma.com/community/file/995046860249565394"}
