{"id":"863488139273720724","name":"Brainstorming UX templates","lastUpdateDate":"2020-11-22T18:08:12.430Z","publisherHandle":"ideaisall","publisherImage":"https://s3-alpha.figma.com/profile/c3f5a532-19fd-4f2c-8c02-12b2fa5c2bcb","publisherId":"1707","publisherName":"Rusmir Arnautovic","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/555725847/3a4be836-badc-4f04-a6c7-f5f23f8d69ed-cover.png","description":"<h2><strong>How to Build Digital Products People LOVE!</strong></h2><p><br></p><p>Saturized - Digital Agency made great templates in PDF format. So I have decided to transfer it to Figma format.</p><p>Feel free to download.</p><p><br></p><p><a href=\"https://www.saturized.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://www.saturized.com/</a></p><p><br></p><p><strong>User Persona</strong></p><ul><li>This template is your guide through the persona design process.</li><li>It should help you structure your research findings into actionable information.</li><li>To use it simply click on the marked fields and fill out the necessary information.</li><li>You can also print it out and work on paper, if you prefer analogue.</li><li>You can add, edit or remove sections of it so it best represents portion of your future customers.</li></ul><p><br></p><p><strong>User journey</strong></p><ul><li>This template is your guide through the user journey design process.</li><li>It should help you structure your research findings into actionable information.</li><li>To use it simply click on the marked fields and fill out the necessary information.</li><li>You can also print it out and work on paper, if you prefer analogue.</li><li>You can add, edit or remove sections of it so it best represents your future user journey.</li></ul><p><br></p><p><strong>User survey</strong></p><ul><li>A greeting text for your survey</li><li>A list of general questions for digital products</li><li>Specific questions focused on a contemporary traveler persona</li></ul><p><br></p><p>In order to use the survey template simply customise it by changing the light grey text with information on your company, product and research. You can add, edit or remove questions to best suit your customer personas, their journey and your research goals.</p><p><br></p><p><strong>User interview</strong></p><ul><li>An introductory text that will help you present yourself to your interviewees</li><li>List of common user research questions, divided into the stages of your user journey.</li></ul><p><br></p><p>To use it just customise the light grey text with specific information regarding your company, product and research, and go ahead with your interviews. List of questions can be edited depending on your particular needs.</p>","url":"https://www.figma.com/community/file/863488139273720724"}
