{"id":"748971588750337968","name":"Semantic Color Sync","lastUpdateDate":"2020-02-27T18:44:48.679Z","publisherHandle":"YNAB","publisherImage":"https://s3-alpha.figma.com/profile/d088c036-6a1a-4585-a564-3c79d24d5317","publisherId":"1890","publisherName":"Product","description":"It’s easy for developers and designers to know exactly what color to use when your colors have semantic names. Primary600? That name doesn't mean much. PrimaryButtonLabel? That's clear as can be.\n\nThis plugin makes it simple to maintain a collection of semantically named colors that derive their color from your base palette. Not only does this allow you to increase clarity of usage, it also lays the foundation necessary for theming within your apps. \n\nFor more details on why you should implement your colors this way, read this blog post:\nhttps://dev.to/ynab/a-semantic-color-system-the-theory-hk7\n\nUsing Semantic Color Sync is simple. First, create your base palette. For each base palette color, add a consistent prefix, such as “.palette/”\n\nNext, create a series of semantically named colors. In the description for each semantically named color, add the base palette color it derives from (including the prefix). For example: “.palette/primary600”\n\nNext, when you decide to change your primary hue from blue to bright pink (good choice, btw), the Semantic Color Sync plugin will automatically search through every semantically named color and update their color to match the updates made in your base palette. \n\nNo need to update things by hand... Ugh. Just tweak your base palette and run this plugin to propagate the changes throughout all of your semantically named colors!\n\nAnd again, if you’re curious why this is useful, this blog post has it all laid out: \nhttps://dev.to/ynab/a-semantic-color-system-the-theory-hk7","url":"https://www.figma.com/community/plugin/748971588750337968","iconUrl":"https://www.figma.com/community/plugin/748971588750337968/icon","thumbnailUrl":"https://www.figma.com/community/plugin/748971588750337968/thumbnail"}
