{"id":"1060213973572396708","name":"Figit - Auto Layout UI Components","lastUpdateDate":"2022-02-23T09:30:42.858Z","publisherHandle":"b5d58fa5_3dc5_4","publisherImage":"https://s3-alpha.figma.com/profile/74884629-a5ac-42a5-9a21-d7deb52cfe93","publisherId":"1060222515156818333","publisherName":"AlphaSquad","description":"<p>Yeah, we mispronounce it all the time, so it’s okay. Don’t beat yourself about it.&nbsp;</p><p><br></p><p>Figit is a Figma plugin (now <em>that </em>was a tongue twister) that revolves around the world of auto-layout and makes it easier to create production-ready designs in record time. Don’t believe us? Yeah, a lot of people didn’t either. Until they actually tried it. Probably why you might see us walking around all smug and puffed-up.&nbsp;</p><p><br></p><p>The plugin has a library of over<strong> 1000 UI elements</strong> from three categories of Web Application, Ecommerce, and Marketing UI Kits. Yeah, sorry we couldn’t incorporate a ‘Thank You, Grandma’ category for all the things she does for us. Although we should because grandmas deserve it. Let us put that in our ‘To-Do’.&nbsp;</p><p><br></p><p>The two things that this plugin offers are Blueprints and Hi-Fidelity UI Elements. It all depends on where you are with your project.&nbsp;</p><p><br></p><p><strong>Blueprints:</strong></p><p>The Low Fidelity blueprints can be used as a base to achieve the end results faster. Forget about sitting for hours wondering about where to start from and what the layout should look like (we spend a lot of those hour playing foosball here). With blueprints, you don’t need to invent the wheel from scratch—just select a layout that gets your brain juices flowing and start from there; you can modify everything later according to your requirements.&nbsp;</p><p><br></p><p><strong>High Fidelity UI Elements:</strong></p><p>Hi-Fi UI Elements follow a standard design system that you can use to build landing pages, dashboards, and other quick concepts. If you don’t want to start from scratch and want something ready-made that you can modify, Hi-Fi elements will be your BFF.<strong> </strong>All these production-ready elements can be dropped into your design with a single click (kind of like we say “it’s not you, it’s me”, hit send, and relax back into the arms of our mistresses.)</p><p><br></p><p><strong>How to Use:</strong></p><ol><li>Open the Plugin</li><li>You can start with a Blueprint or just go directly for the High Fidelity UI Kit Designs</li><li>Search for your desired section such as ‘Hero’</li><li>Search for the Design that matches your vision</li><li>Drag and Drop the element to add it to your File</li><li>Tweak it according to your preferences</li><li>Take a sip of your protein shake</li><li>Unalive the population in GTA using BangBangBang</li><li>Done</li></ol><p><br></p><p>PS: There's always a <a href=\"https://getfigit.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Website</a></p>","url":"https://www.figma.com/community/plugin/1060213973572396708","iconUrl":"https://www.figma.com/community/plugin/1060213973572396708/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1060213973572396708/thumbnail"}
