{"id":"961270034818256057","name":"Jitter · Fast & simple animation tool (motion design)","lastUpdateDate":"2022-05-02T13:27:38.051Z","publisherHandle":"jittervideo","publisherImage":"https://s3-alpha.figma.com/profile/eb6f63a9-d098-4872-9f51-462fa7d1c49b","publisherId":"959755238084347779","publisherName":"Jitter","description":"<p>Jitter lets you animate your Figma designs fast: import your artboards (pixel-perfect), add animations in a few clicks, and export the animation as a video, GIF or Lottie. You can also create your motion design system and let developers inspect animation parameters.</p><p><br></p><h2><strong>What is Jitter?</strong></h2><p><a href=\"https://jitter.video?utm_source=figma&amp;utm_medium=referral&amp;utm_id=figma-plugin\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Jitter</a> is an easy-to-use animation tool on the web. It's like Figma, but for motion design: we enable creators to design stunning animated content and interfaces, with their teams. Jitter is a modern alternative to After Effects, with no learning curve: it's fast, easy, collaborative, and you can export your animations as HD video (60 fps), GIF or Lottie.</p><p><br></p><h2>How to use the plugin</h2><ol><li>Open the plugin</li><li>Select a frame, and click the “Export” button</li><li>Open the project in Jitter and create some magic! ✨</li></ol><h2><br></h2><h2>FAQ</h2><p><strong>How are you different from other plugins?</strong></p><p>We use a unique way to make animations: After Effects and most animations plugins (Motion, Figmotion, Aninix, SVG Motion, Bannerify and the other Figmatic plugins…) use the traditional keyframe system. Instead, we use an animation model where we give <strong><em>instructions</em></strong> to the layers (like “Slide in”, “Fade out”…): building an animation is more intuitive, and the timeline is more legible. Building an animation with Jitter is as easy as building an animation in PowerPoint or Keynote, but you have total control over the parameters.</p><p><br></p><p><strong>What kind of animations can I do with Jitter?</strong></p><p>Whether you are designing an app, a website, an illustration, a presentation video, a social media post, an Instagram Story, a YouTube intro, or anything else, you can import your design into Jitter in 1 click and animate right away.</p><p><br></p><p><strong>Can I export my Figma design to Lottie?</strong></p><p>Yes, Jitter actually the best workflow to do that today: you can import your Figma designs in 1 click with this plugin, add your animations in Jitter, and export to Lottie format. You can include your Lottie animations to your apps, websites, Webflow projects, LottieFiles workspace…</p><p><br></p><p><strong>Can I animate text?</strong></p><p>Yes, text animation is actually our specialty: you can put a text in motion with an animation preset, and then customize several parameters like speed, duration, easing – and more importantly, you can choose if you want to animate letter by letter, word by word, or line by line.</p><p><br></p><p><strong>Can I design micro-interactions?</strong></p><p>Yes, you can animate all the basic properties of your layers and masks (position, size, rotation, scale, opacity, corner radius, shadow…).</p><h2><br></h2><p><strong>How do I handoff the animation to the developers?</strong></p><p>You can share the project URL, so that your developers can inspect the animation parameters. We know this is a common use case, so we plan to develop the animation inspector further for easy handoff, and to build your own motion design system.</p><p><br></p><p><strong>What format can I export to?</strong></p><p>You can export your animated designs as HD videos (1080p, 60 fps), GIF, and Lottie.</p><p><br></p><p><strong>Does it support all features from Figma?</strong></p><p>Our priority is to make a pixel-perfect import. We support most Figma properties natively. For layers that are too complex to be supported in Jitter, we convert the layer to a PNG or SVG. That way, you always get a pixel-perfect import.</p><p>Here are the known limitations:</p><ul><li>Rich texts (multiple colors or font weight in the same text layer) are exported as images</li><li>Elements with gradient fills, multiple fills, strokes, multiple shadows or effects are exported as images</li><li>Only simple masks are supported in Jitter (when the masking layer is the last layer of the group) – in all other cases, mask groups are exported as images</li><li>Blend modes are not supported in Jitter</li></ul><p><br></p><p><strong>Can I import multiple artboards?</strong></p><p>At the moment, you can only import one artboard at a time. We will add support for multiple artboards in the future.</p><p><br></p><p><strong>I found a bug, what should I do?</strong></p><p>If you encounter any bugs, please reach out to us and we'll be able to fix it rapidly :) You can contact us at <a href=\"mailto:figma.plugin@jitter.video\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">figma.plugin@jitter.video</a>, or on our website <a href=\"https://jitter.video\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://jitter.video</a>.</p>","url":"https://www.figma.com/community/plugin/961270034818256057","iconUrl":"https://www.figma.com/community/plugin/961270034818256057/icon","thumbnailUrl":"https://www.figma.com/community/plugin/961270034818256057/thumbnail"}
