{"id":"864431140615310499","name":"Transifex Figma Plugin","lastUpdateDate":"2021-09-27T10:53:17.253Z","publisherHandle":"dee1aa7d_5881_4","publisherImage":"https://s3-alpha.figma.com/profile/8a64708a-1ac1-44f1-8548-699745bf9a38","publisherId":"862631177148591923","publisherName":"Transifex","description":"<p>Transifex and Figma</p><p>Accelerate your localization workflow and go to market faster by bringing your Product, Design and Localization teams closer using the Figma plugin for Transifex. Easily send your design texts from Figma to Transifex’s powerful translation management system (TMS) to get them translated. Pull the translated texts back to Figma to validate internationalization (i18n) and resolve any translation issues before coding begins.</p><p><br></p><p>Let your designers preview the localized designs and make all necessary adjustments right away, to avoid costly delays in refactoring localization bugs and give your localization users a great UX. Give your translators rich context with screenshots to let them understand where and how the translation will appear so that they deliver higher quality translations.</p><p><br></p><p>Boost collaboration between your designers and translators. Deliver new digital experiences faster.</p><p><br></p><p>Using with Transifex</p><p>Connecting Figma with Transifex</p><p><br></p><p>1. Make sure that you have access to at least one organization and one project in Transifex.</p><p>2. Install the “Transifex Figma Plugin” in your Figma app.</p><p>3. Open your Figma file.</p><p>4. Go to plugins and select “Transifex Figma Plugin”.</p><p>6. Add your Transifex credentials in the “Settings” tab: First you need to connect with Transifex using an API token. Generate this token from your Transifex account under User Settings =&gt; API token. After generating the token, copy and paste it in the related input box in the Figma plugin and click “Connect”.</p><p><br></p><p>You should complete the following plugin settings after connecting with Transifex:</p><p>Organization: the desired organization to work with.</p><p>Project: the desired project that these Figma strings will be associated with.</p><p>Resource: the desired resource of the selected project to push strings to. If you don’t have any resources you can try to create one using the action “Create a new resource” (note that you should have the adequate permissions in order to perform this action).</p><p><br></p><p>After setting the options, click “Save”.</p><p><br></p><p>Using the plugin</p><p><br></p><p>1. Start selecting the Figma layers that you want to send, or “push”, to your Transifex resource for translation.</p><p>2. Your selection will collect your text layers as strings in the main window of the plugin, under both the “Push strings to Transifex” and “Pull strings from Transifex” tabs.</p><p>3. To remove any unwanted strings from the selection in the “Push” or “Pull” tabs, click the X to the right of the string. That string will be removed from the current selection list.</p><p>4. Click the “Push” button to send the selected strings to Transifex and add them to the connected resource. After pushing the strings you can check to see that they were successfully sent using the “View resource in Transifex” link. Also you have the option to upload screenshots if you have selected “Upload Screenshots”. The strings will be translated according to the workflow set up in the Transifex project.</p><p>5. By default the plugin will automatically generate screenshots of your Figma frames and include them with the pushed strings in Transifex. The strings for translation will be automatically mapped to the screenshots in Transifex to provide visual context of your Figma designs to your translators and ensure the quality of the translation. Optionally you can disable screenshot generation for any string push by deselecting the “Upload Screenshots” checkbox in the “Push Strings to Transifex” tab.</p><p>6. You can use the “Replace Resource Strings” feature to clean extra or outdated strings out of your Transifex resources. if this option is checked when you click the “Push” button to send strings to Transifex, then all of the strings currently in the connected resource will be purged and replaced with the current selection only. This option should be used carefully, especially with resources shared by other users. If you are sure you want to replace all the strings in the resource with the current selection, click “OK” in the confirmation dialog. The resource strings will be replaced, and the “Replace” option will be reset to deactivated. All of your previous translations remain in the translation memory (TM) so you and your team can reuse them, unless they are also deleted from the TM in Transifex.</p><p>7. To pull translations back from Transifex to Figma, first select the Figma layers you want to get translations for and then click the “Pull” button in the “Pull Strings from Transifex” tab. You have the option to pull them in all languages or in a specific one by selecting it in the “Language” dropdown. The pull operation will create a new page in your Figma file for every language with the same name of the selected page and the language code as prefix, and automatically insert translations for the selected strings.</p><p><br></p><p>About Transifex</p><p>Founded in Greece and now headquartered in Silicon Valley, Transifex helps companies - from Startups to the Enterprise - go global. With our top-rated SaaS-based Translation and Localization Platform, organizations can easily translate digital content such as websites, mobile apps, games, video, help centers, subtitles, and more on a continuous basis. Leading companies including Eventbrite, Salesforce, HubSpot, Waze, and Microsoft rely on Transifex to achieve a truly multilingual, international presence. For more information, visit <a href=\"http://www.transifex.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">www.transifex.com</a>, and follow Transifex on Twitter, Facebook, and LinkedIn.</p><p><br></p><p>Learn More</p><p>Read our documentation about the Transifex Figma plugin: <a href=\"https://docs.transifex.com/integrations/figma\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://docs.transifex.com/integrations/figma</a></p><p><br></p><p>Contact us at <a href=\"mailto:support@transifex.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">support@transifex.com</a> with any questions or feature requests.</p>","url":"https://www.figma.com/community/plugin/864431140615310499","iconUrl":"https://www.figma.com/community/plugin/864431140615310499/icon","thumbnailUrl":"https://www.figma.com/community/plugin/864431140615310499/thumbnail"}
