{"id":"803669834214399971","name":"Phrase","lastUpdateDate":"2021-09-09T12:26:58.265Z","publisherHandle":"memsourcedesign","publisherImage":"https://s3-alpha.figma.com/profile/c83c43df-1694-4617-ab0a-692b2bcdd3dc","publisherId":"984548720169797887","publisherName":"Memsource","description":"<p><strong>What is Phrase?</strong></p><p><strong>﻿</strong></p><p>For digital products offered in global markets, translation has become an integral part of the user experience, but teams involved often struggle to be on the same page. UX copy shouldn’t be left for last, and neither should translating it into multiple languages.</p><p>&nbsp;</p><p>Phrase is a Translation Management System with the whole team in mind. It’s a cloud-based platform that enables Designers, Copywriters, Product Managers, Developers and Translators to come together to create the best local user experience for global digital products.</p><p>&nbsp;</p><p>For more information please visit:<a href=\"https://phrase.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> https://phrase.com/</a></p><p>&nbsp;</p><p><strong>Why connect Phrase and Figma?</strong></p><p>&nbsp;</p><p>Finally, you can build a bridge between Product Design and Translation Teams by syncing texts between Figma and Phrase. Send design content from within Figma to Phrase in seconds so that your Translators can then start their work right away.</p><p>&nbsp;</p><p>Let our plugin inform you when translations are ready so you can pull translated copy into Figma. Preview your designs in all your languages before handoff to Developers.</p><p>&nbsp;</p><p>Give Translators proper context with automatically attached screenshots. Our plugin highlights exactly where each text element belongs. Increase your overall translation quality and reduce feedback loops.</p><p>&nbsp;</p><p><strong>Once Figma is connected to Phrase you can:</strong></p><p>- Increase productivity with machine translation and post-editing</p><p>- Order professional translations from integrated language service providers</p><p>- Organize your entire localization team</p><p>- Boost translation quality and ensure the correct terminology is used across all content with linguistic tools such as Glossaries, Translation Memories, and Term Bases.</p><p>&nbsp;</p><p>&nbsp;</p><p><strong>How to set up</strong></p><p>For more information and to learn how to install the plugin visit <a href=\"https://help.phrase.com/help/phrase-figma-plugin\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://help.phrase.com/help/phrase-figma-plugin</a></p><p>Don’t have a Phrase account? Try it for free! <a href=\"https://app.phrase.com/signup\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://app.phrase.com/signup</a></p>","url":"https://www.figma.com/community/plugin/803669834214399971","iconUrl":"https://www.figma.com/community/plugin/803669834214399971/icon","thumbnailUrl":"https://www.figma.com/community/plugin/803669834214399971/thumbnail"}
