{"id":"963890855798739008","name":"Pygma - Publish websites from Figma","lastUpdateDate":"2021-06-15T15:47:04.480Z","publisherHandle":"pygma","publisherImage":"https://s3-alpha.figma.com/profile/28fec52c-0b39-4a3b-91b3-8b86246025ab","publisherId":"954695657282969674","publisherName":"Pygma","description":"<p><strong>Turn Figma designs into real websites in a few clicks</strong></p><p><br></p><p>(Note that Pygma is still in beta and you might run into bugs. If you do we are on hand to fix them ASAP for you. Just send an email to emile@pygma.app if you need help)</p><p><br></p><h2><strong>Features</strong></h2><ul><li>Create multiple projects/websites</li><li>Create unlimited pages for each website</li><li>Responsive breakpoints - group breakpoint frames under one page and the deployed site will be automatically responsive.</li><li>One-click deployment of updates</li><li>Connect a custom domain</li></ul><p><br></p><h2><strong>How to use</strong></h2><p><br></p><p><strong>Create an account</strong></p><ul><li>Log in / sign up using Figma OAuth - Pygma only has access to the files you specify.</li></ul><p><br></p><p><strong>Create a project</strong></p><ul><li>Make sure you are in the same Figma file as the design you want to turn into a website.</li><li>Add the Figma file key which is needed to publish your site. You can find this from the Share link for your file.</li><li>Choose the Figma page that contains the frames for your site.</li><li>Give your project a name.</li><li>A random subdomain on pygma.app will be generated for your site, but you can change this later.</li></ul><p><br></p><p><strong>Create a page</strong></p><ul><li>Add the path for your page. For example, for the homepage you might use '/' or '/pricing' for the pricing page.</li><li>Add the title for the page (this is the title that will appear in the browser).</li><li>Add the frames for the page. If you have multiple frames for different breakpoints, check all of them and they will become responsive breakpoints in the final website.</li></ul><p><br></p><p><strong>Connect a domain (temporarily free, will be paid in the near future)</strong></p><ul><li>You can change a project's domain on the project config page. Once you use a custom domain, you will see DNS settings for the A record and CNAME record appear underneath the domain. Add these to the DNS registrar where you purchased or manage your domain. Here's some links to a few guides:</li></ul><p><br></p><p><strong>Deploy a site</strong></p><ul><li>Once your pages have been added, just click the deploy button - this process is usually complete within 2 minutes and you will be able to go to your domain/subdomain to see your site (if it's a custom domain you will need to connect it first as above).</li></ul><p><br></p><p><strong>Add links between pages</strong></p><ul><li>Just connect frames using the prototype tool in Figma and Pygma will interpret these as links in the final site.</li></ul><p><br></p><p><strong>Add external links</strong></p><ul><li>In the name of the layer/node that you want to add an external link to, add a '#' followed by the full link including the scheme. E.g. to add a link to Pygma on a button with name 'button / primary' in Figma, it would become 'button / primary #<a href=\"https://pygma.app'.\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://pygma.app'.</a></li></ul><p><br></p><p><strong>Manage subscription</strong></p><ul><li>Open the menu and go to \"Billing\". From there you can manage your subscription using Stripe Portal.</li></ul><p><br></p><p><strong>Unsynced account/config changes.</strong></p><ul><li>In rare events, some data might be out of sync (e.g. your subscription status). Try logging out and logging in again to fix this.</li></ul>","url":"https://www.figma.com/community/plugin/963890855798739008","iconUrl":"https://www.figma.com/community/plugin/963890855798739008/icon","thumbnailUrl":"https://www.figma.com/community/plugin/963890855798739008/thumbnail"}
