{"id":"1045578614217951186","name":"Quick Material Icons","lastUpdateDate":"2021-12-08T05:30:34.483Z","publisherHandle":"bernatfortet","publisherImage":"https://s3-alpha.figma.com/profile/8fc9fbbf-efc0-4dc5-beef-d58e1e29f7a1","publisherId":"428814","publisherName":"Bernat Fortet","description":"<p>The fastest way to insert font based material design icons.</p><p><br></p><p>Quick Material Icons is optimized for speed of use. The gist: run the plugin, search for an icon and add it to your file. But the details make this experience feel great.</p><p><br></p><pre class=\"ql-syntax\" spellcheck=\"false\">I highly recommend adding a shortcut to the plugin. (see below for instructions)\n</pre><p><br></p><h2>Usage</h2><ul><li>Run the plugin to see a list of icons. After choosing your first, you'll see a list of recent icons</li><li>Type to filter the icons list</li><li>Click or press Enter to select the icon. (you can also use arrow keys).</li></ul><p><br></p><h2>Features</h2><ul><li>Recent icons show by default.</li><li>Select with your keyboard.</li><li>After searching, results are sorted by recency.</li><li>When a text object is selected, and it has the same name as an icon, the plugin will automatically replace the text for that icon. Eg. a text object using Helvetica has <code>close</code> as characters. Running the plugin will use the Material Icons font and show an icon instead.</li><li>Running the plugin without a selection will add an icon in the center of the viewport.</li><li>If multiple text elements are selected, the plugin will run for each element.</li><li>If a frame or group is selected, the icon will be added to the center of the object.</li></ul><p><br></p><h2>How to set a shortcut to run the plugin (mac)</h2><ul><li>Go to <code>System Preferences &gt; Keyboard &gt; Shortcuts</code></li><li>Select <code>App Shortcuts</code> from the left sidebar</li><li>Click the <code>[+]</code> button</li><li>Choose <code>Figma</code> from the Applications dropdown</li><li>In <code>Menu Title</code> type <code>Quick Material icons</code></li><li>In <code>Keyboard Shortcut</code>, type whatever works best for you. I recommend <code>ctrl + l</code></li></ul>","url":"https://www.figma.com/community/plugin/1045578614217951186","iconUrl":"https://www.figma.com/community/plugin/1045578614217951186/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1045578614217951186/thumbnail"}
