{"id":"1095639605803636403","name":"Beta Experiment Design System UI Kit","lastUpdateDate":"2022-04-27T19:28:06.561Z","publisherHandle":"johnjohnworks","publisherImage":"https://s3-alpha.figma.com/profile/f4fe5e20-1756-4928-bdda-d3aea04d1b8f","publisherId":"848051782785027348","publisherName":"John John","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1811683696/a38ceb44-3066-47ad-be73-ee9a4b02c46b-cover.png","description":"<h2>Beta Experiment <a href=\"http://betaexperiment.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">http://betaexperiment.com/</a> by @johnjohnworks</h2><p><strong>A Design System, UI Kit, Component Library, &amp; HTML CSS Framework for Web 3.0/AR/VR</strong></p><p><br></p><p>Save Humanity by Accelerating Positive Communication. Beta Experiment is a Design System, HTML &amp; CSS code framework, and Figma component library to accelerate positive communication. Humanity is a system. Humans are nodes within the system. Humans have senses, inputs and outputs. Energy is transferred in waves through senses. We want to be efficient in the transfer of energy waves. Our shared wavelength is, “Save Humanity”. That idea positively vibrates the system, and when we are vibrating in unison, we are stronger. We choose to accelerate positive communication within our system. Here's how we will do it! Add people to the internet, Teach people how the internet works, Teach people how to help others think positively, Create and consume ideas that help others, Build systems to accelerate positive communication. Walk a mile in someone else's shoes while holding hands with them. Do this with as many different people as possible. Listen to their truths, then tell them your truths. Validate each other's truths together. Debate ideas for improvements. Give each other a hug and tell each other it's going to be okay. Act on those ideas. You can start with one thing to help one person other than yourself. Iterate again and again. Infinite thought. We built the Internet for all. Help us make experiences positive and we will all be rewarded. Join us in the future, where you are free to think, explore and grow! There are no border walls, only the ones we carry in our minds, let go of negative systems. We need your help to create positive systems and answer hard questions of how we all live positively. The system of helping each other includes you, it needs you! We need to help each other. Let us share how we survive positively and do it really fast. Enjoy your blip! <a href=\"https://github.com/johnjohnworks/betaexperiment\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://github.com/johnjohnworks/betaexperiment</a></p>","url":"https://www.figma.com/community/file/1095639605803636403"}
