{"id":"997445759556457261","name":"Ecology kit v.2.5","lastUpdateDate":"2021-10-23T11:06:16.901Z","publisherHandle":"archiboom","publisherImage":"https://s3-alpha.figma.com/profile/f97001ed-8a8d-4895-a780-7a09f52d6781","publisherId":"558655","publisherName":"Archi","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1232005068/8af835e3-c0b1-4cd5-ace7-8d5dd0211658-cover.png","description":"<h2><strong>MY WIKI in Notion</strong></h2><p><a href=\"https://archi.aqulas.me\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://archi.aqulas.me</a></p><p><br></p><h2><strong>History</strong></h2><p><strong>v.2.5 - added 6 new foods</strong></p><p>v.2.4 - added 36 new icons about recycle</p><p>v.2.2 - added over 30 new icons about packaging and working with it</p><p>v.2.1 - All possible combinations of the recycling icon are implemented (available in the format of variants)</p><p>v.2.0 - BIG UPDATE added more new icons, fully redesign interface. Its all for you)</p><p>v.1.6.2 - organized only and update thumbnail)</p><p>v.1.6 - added 19 new icons.</p><p>v.1.5.4 - сosmetic edits.</p><p>v.1.5.3 - after watching many hours of tutorials on logo packaging, I came to update some details for your convenience.</p><p>v.1.5.2 - we urgently need a person who knows how to pack a vector correctly, because the author does not understand groups and frames(</p><p>v.1.5 - added 18 new symbols.</p><p><br></p><p><br></p><h2><strong>EN</strong></h2><p>A constantly updated publication. Let me know if something is missing!)</p><p>Meet a selection of high-quality icons related to ecology. Collect a poster or instructions for your home, office or other place. Taking care of the environment has never been easier before, because you no longer need to look for materials, they are all collected in this publication.</p><h2><strong>RU</strong></h2><p>Постоянно обновляемая публикация. Дайте знать, если чего-то не хватает!)</p><p>Встречайте подборку качественных иконок, связанных с экологией. Соберите плакат или инструкцию для своего дома, офиса или другого места. Забота об экологии никогда не была прежде проще, ведь больше не надо искать материалов, они все собраны в этой публикации.</p>","url":"https://www.figma.com/community/file/997445759556457261"}
