{"id":"1017430250998311413","name":"Figterate | Time Saver Playground","lastUpdateDate":"2021-10-12T10:10:06.570Z","publisherHandle":"figterate","publisherImage":"https://s3-alpha.figma.com/profile/08b25122-a349-4340-9530-cb9c146d2c26","publisherId":"1005464423133383269","publisherName":"Figterate","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1199988752/837dc805-90f1-4a17-9289-d3bc9d612bec-cover.png","description":"<p><strong>1. </strong>Auto variant creation <strong>2. </strong>Clone components <strong>3.</strong> Copy and paste prototype 👉 Save ton of time in your design workflows like variant making, design system, prototype, animations etc.</p><p>Welcome to Time Saving Experience in Figma.</p><h2><a href=\"http://www.figma.com/community/plugin/1006929924118773289/Time-Saver?fuid=1005464423070931253\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">↓ Install the plugin</a></h2><p>——————————</p><h2>Features brief</h2><p><strong>1.Variations</strong></p><ul><li>Automatically create many variations with layer on &amp; off functionality</li><li>Layer names will be updated automatically to show them as property in variant, so no more manual work now. (Optional)</li><li>These features support multiple component operations at same time.</li></ul><p><br></p><p>1.1 Unique Combination</p><p>This feature will create variations for all possible unique combinations from all selected layers of components.</p><p><br></p><p>1.2 Hide one by one &amp; show others</p><p>This feature will create variations by hiding one by one layer &amp; showing other layers from all selected layers of components.</p><p><br></p><p>1.3 Show one by one &amp; hide others</p><p>This feature will create variations by showing one by one layer &amp; hiding other layers from all selected layers of components.</p><p><br></p><p><em>Use Cases</em></p><ul><li>When you want to create many variations for many UX components like buttons, chips, cards, text fields, tooltip, navigation drawer, app bar etc.</li><li>When you want to make variant out of all these created variations of components within no time.</li></ul><p><br></p><p><em>Prerequisites</em></p><ul><li>This feature can be used with components only.</li><li>Selected layer name must be unique per component if you turn on switch \"Update layer name for variant property\"</li></ul><p><br></p><p><strong>2.Clone</strong></p><ul><li>Automatically create components with incremental changes in any property for selected layers in components.</li><li>This feature can make variations from any component with your desired changes in properties like X Position, Y Position, Width, Height, Rotation, Radius, Stroke, Opacity etc.</li><li>Layer names will be updated automatically to show them as property, so no more manual work now. (Optional)</li><li>You can ignore current value of property for selected layers and start with 0(Zero) to create components. (Optional)</li><li>These features support multiple component operations at same time.</li></ul><p><br></p><p><em>Use Cases</em></p><ul><li>When you want to turn hand of any character at different angles.</li><li>When you want to move any object with specific distances in incremental manner.</li><li>Similarly, when you want to change different properties in incremental way for any selected layer.</li></ul><p><br></p><p><em>Prerequisites</em></p><ul><li>This feature can be used with components only.</li><li>Selected layer name should be unique per component if you turn on switch \"Update layer name for variant property\"</li></ul><p><br></p><p><em>Example</em></p><p>Step 1:</p><p>Draw a rectangle of 100 width &amp; 100 height &amp; make it a component.</p><p>Step 2:</p><p>Now in \"Time Saver\" plugin set following values in clone section.</p><ul><li>Iteration:&nbsp;05, X = 5+, Y = 5+, Width = 5+, Height = 5+</li><li>Turn off 'Ignore current value &amp; start with 0'</li><li>Turn off \"Update layers name for clone property\" (Optional)</li></ul><p>Now press create button and it will create 5 components with updated properties, you can verify now.</p><p><br></p><p><em>Supported input values &amp; its results</em></p><p>Following values are for example only, you can enter any desired value in any property in clone.</p><p>For iteration value = 5</p><ul><li>2+&nbsp;will clone objects with updated value like&nbsp;2, 4, 6, 8, 10</li><li>2-&nbsp;will clone objects with updated value like&nbsp;2, 0, -2, -4, -6</li><li>2*&nbsp;will clone objects with updated value like&nbsp;2, 4, 8, 16, 32</li><li>2&nbsp;will clone objects with same value as&nbsp;2, 2, 2, 2, 2</li></ul><p><br></p><p><em>Notes</em></p><ul><li>(minus) value supported only in X &amp; Y Positions.</li><li>Figma supports opacity between 0 to 100 %. So, if selected object has 100 &amp; opacity then + (plus) &amp; * (multiply) operation will throw error.</li></ul><p><br></p><p><strong>3.Prototype</strong></p><ul><li>Copy and paste prototype for one or many objects like Frames, Components, Instances, Variants in short wherever Figma supports prototype interactions.</li><li>These features support copy &amp; pasting prototype for one OR many interactions.</li></ul><p><br></p><p>3.1 Copy</p><p>Copy prototype from any object whether it is</p><ul><li>Single object with single interaction or multiple interaction</li><li>Multiple objects with single interaction or multiple interactions.</li></ul><p><br></p><p>3.2 Paste</p><p>3.2.1 Paste as copied on one or many</p><ul><li>You can paste copied prototype on one or many objects.</li><li><em>Example</em>: When you have copied prototype from 3 object then you can paste it on same number of object or on multiply number of objects like 3 or 6 or 9.</li><li>This will behave as multi paste feature but in multiply manner.</li></ul><p>3.2.2 Paste &amp; connect all layers</p><ul><li>When you have copied interaction from one object then it can be pasted on one or many objects.</li><li>And you can connect selected objects with each other in selected direction.</li><li>You can also connect last object with first object. (Optional)</li></ul><p><br></p><p><em>Use Cases</em></p><ul><li>When you want to animate anything with repetitive interaction for multiple objects whether it is in variant or not.</li><li>Let's say you have added state interaction between 5 different buttons and now you want to apply this to all variations of buttons in design system.</li></ul><p><br></p><p><em>Prerequisites</em></p><ul><li>Minimum one prototype or interaction should be added on selected object to copy it.</li></ul><p><br></p><p>——————————</p><h2><strong>Trial</strong></h2><p>For trial, you will get 15 attempts per feature to try all plugin features.</p><p>——————————</p><h2><strong>Pricing</strong></h2><p>🎉 No Subscriptions</p><p>Pay once and get lifetime access with free updates.</p><p>We have introduced separate pricing for each feature so now you can buy features as per your workflow requirement.</p><p><strong>Feature pricing</strong></p><p>01 Variation $20</p><p>02 Clone $20</p><p>03 Prototype $20</p><p>——————————</p><h2><strong>Offer</strong></h2><p>When you buy all 3 features in one go from plugin then it will offer $10 instant discount.</p><p>This offer is for first 1000 customers only.</p><p><strong>Bulk License Purchase</strong></p><p>25% Discount for 10 or more licenses</p><p>50% Discount for 25 or more licenses</p><p>Please email us at <a href=\"mailto:figterate@gmail.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">figterate@gmail.com</a> for bulk license purchase.</p><p>——————————</p><h2><strong>License</strong></h2><p>You need to buy plugin features after login into \"Time Saver\" plugin.</p><p>After buying features you can use it for term associated with its plan.</p><p>——————————</p><h2>About us</h2><p>We build products to iterate faster in Figma &amp; Figjam.</p><p>As passionate team at <strong>Figterate</strong> we are committed to bring new innovations for design &amp; UX workflow to save time.</p><p>Happy designing.</p><p>——————————</p><h2><strong>Support</strong></h2><p>Please contact us anytime on following channels for support, feedback, feature request or if something is broken and you want to share with us.</p><p>Email - <a href=\"mailto:figterate@gmail.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">figterate@gmail.com</a></p><p>Twitter - <a href=\"https://twitter.com/figterate\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">@figterate</a></p><p>#figmatimesaver</p>","url":"https://www.figma.com/community/file/1017430250998311413"}
