{"id":"1049839808166473920","name":"Tableau UI Kit","lastUpdateDate":"2021-12-07T00:08:35.592Z","publisherHandle":"robertjanezic","publisherImage":"https://s3-alpha.figma.com/profile/14e0e23a-f078-485e-a134-c6b29e30f9fb","publisherId":"3567352","publisherName":"Robert Janezic","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1357842280/ccbc08fb-f1ac-425f-a036-371eb34ddbbe-cover.png","description":"<h2>The ultimate Tableau prototyping tool</h2><p>The Tableau UI Kit is the easiest and most flexible way to prototype Tableau dashboards using Figma. Take your analytics workflow to the next level, implement brand guidelines and save thousands of hours.</p><p><br></p><p>✨&nbsp;Learn more at<strong>&nbsp;</strong><a href=\"https://www.tableauuikit.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">tableauuikit.com</a></p><p>🔥 &nbsp;Preview unlocked <a href=\"https://www.figma.com/file/0Nqmu2sbDqCGNFTrDP5k9a/Tableau-UI-Kit?node-id=442%3A35316\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">full version</a> </p><p><br></p><p><br></p><p>---</p><p><br></p><h2>Next level analytics workflow</h2><p>Prototyping is an essential step in the analytics process. But don’t just take my word for it. Check out some of the below articles to learn more:</p><p><br></p><ul><li><a href=\"https://uxdesign.cc/importance-of-prototyping-in-designing-7287c7035a0d\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Importance of prototyping in designing</a></li><li><a href=\"https://www.interaction-design.org/literature/article/design-thinking-get-started-with-prototyping\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Design thinking: Get started with prototyping</a></li><li><a href=\"https://wp.nyu.edu/dispatch/2019/08/30/the-importance-of-prototypes-in-product-design/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">The importance of prototypes in product design</a></li></ul><p><br></p><p>All of the tedious work has been done on the front end (by me) and lets you focus on what’s important; the design. The required skills are more about “How do I use the Tableau UI Kit?” and not “How do I use Figma?”.</p><p><br></p><h2>Save thousands of hours</h2><p>Starting from scratch on every new project is tiring and a waste of your precious time (I know you're busy). The Tableau UI Kit comes with everything you need to design beautiful Tableau dashboards.</p><p><br></p><p>1,000+ styles</p><ul><li>Feel at ease knowing developers will design consistently for all dashboards.</li><li>Don’t have any brand guidelines? No problem, just use the meticulously crafted styles already put into place.</li></ul><p><br></p><p>1,000+ components and variants</p><ul><li>Easily pull in the design components you want with simple drag and drop functionality.</li><li>Feel confident your prototypes will actually look like Tableau. All assets match as closely as possible.</li><li>All components and variants are built with Auto Layout 3.0, which enables complete responsiveness.</li><li>Default component not what you want? That’s alright, use the variants for more fine tuning.</li></ul><p><br></p><p>2,200+ unique dashboard layouts</p><ul><li>With so many possibilities you’ll be able to get any dashboard built in no time!</li><li>Want to create a more custom dashboard layout? The Tableau UI Kit has features for this exact situation. Just watch the “How do I build dashboards” video in the How-To videos section to learn more.</li></ul><p><br></p><h2>Implement brand guidelines</h2><p>The Tableau UI Kit is much more than a set of premade components. It’s a single source of truth for your team’s brand guidelines (Color &amp; Typography). No longer do developers have to wonder about filter and parameter formatting. Just to name two examples…</p><p><br></p><p>Simply document your color and typography preferences for every component in the styles cheat sheet and change the specific styles to match. Then watch the changes be made throughout the entire library.</p><p><br></p><p><br></p><p>---</p><p><br></p><h2>Who is this UI Kit for?</h2><ul><li><strong>Tableau COEs</strong>&nbsp;— Get everyone on the same page with a single library. Design faster in a more consistent fashion.</li><li><strong>Startups</strong>&nbsp;— Short on time or budget? Design and prototype faster, with an entire library of ready-to-go components. Save hundreds of hours on that MVP.</li><li><strong>Freelancers</strong>&nbsp;—&nbsp;Deliver high-quality projects faster, take on more clients and increase your income.</li><li><strong>Individuals, teams and companies</strong>&nbsp;—&nbsp;Really no matter what environment you're in the Tableau UI Kit will positively impact your workflow and save a ton of work hours.</li></ul><p><br></p><p><br></p><p>---</p><p><br></p><h2>FAQ</h2><ul><li><strong>Do I need Figma for this Kit?</strong>&nbsp;— Yes, this is a UI Kit built in Figma. You can check out the figma plans<a href=\"https://www.figma.com/pricing/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> here</a> (there's a free version).</li><li><strong>Do I need to know how to use Figma?</strong>&nbsp;— Although deep understanding of Figma is not needed, a basic understanding would be beneficial. This kit has more to do with \"How do I use the Tableau UI Kit\" and not \"How do I use Figma\". <a href=\"https://help.figma.com/hc/en-us\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Learn More</a></li><li><strong>How do I import the design file?</strong>&nbsp;—&nbsp;After purchasing, you'll be able to download and unzip the Figma file. Drag and drop the file into your Figma “Project” page or your “Drafts” page.</li><li><strong>What does \"lifetime access\" actually mean?</strong>&nbsp;—&nbsp;Once you have purchased the kit, you will have access to all of the future updates, free of charge. I'll let you know when updates and improvements are made. You can download new updates from your Gumroad account.</li><li><strong>Is payment secure?</strong>&nbsp;—&nbsp;Gumroad handles the tricky payment process. They use secure 128-bit SSL encrypted payments, so you're safe!</li><li><strong>Is it a one-time payment?</strong>&nbsp;—&nbsp;Yes, pay once and that's it! No recurring charges or surprises.</li><li><strong>How do I download a new update?</strong>&nbsp;—&nbsp;In your Gumroad Library, select the “Tableau UI Kit” product card, then select “download”.</li><li><strong>Can I get an invoice?</strong>&nbsp;—&nbsp;Yes! Click the \"Generate\" button on your receipt from Gumroad after you purchase and you can generate a detailed invoice with any additional information you need</li></ul><p><br></p><p><br></p><p>By <a href=\"https://www.robertjanezic.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">RobertJanezic</a><strong> (Website) / </strong><a href=\"https://twitter.com/RobertJanezic\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">@RobertJanezic</a><strong> (Twitter)</strong></p><p>Have questions? Send an email to&nbsp;<strong>rjanezic2@gmail.com</strong></p><p><a href=\"https://www.tableauuikit.com/licensing\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Licensing agreement</a></p>","url":"https://www.figma.com/community/file/1049839808166473920"}
