{"id":"830178746103135228","name":"Components Flyout Menu","lastUpdateDate":"2021-07-16T14:44:02.899Z","publisherHandle":"317005","publisherImage":"https://s3-alpha.figma.com/profile/d67eeaa7-f9ce-4154-8a93-04424a308b61","publisherId":"317005","publisherName":"Kurt Emch","description":"<p>Browse and insert local and team components via a flyout menu. Familiar workflow to Sketch users.</p><p><br></p><p>👉 Features</p><p><br></p><p>•&nbsp;Browse local and team components in a flyout menu.</p><p>•&nbsp;Less clicking: Hover over each menu group to expand submenus.</p><p>• Clicking on a menu item group will automatically fetch the first sorted component at the deepest nest level.</p><p>• Control the size of the plugin modal with a resize handle in the bottom right. Although the plugin modal will scroll horizontally and vertically you may wish to size the window to a more convenient size based on how many levels your menu has.</p><p><br></p><p>👉 Team Libraries</p><p>Team libraries are supported with a small workaround.</p><p><br></p><p>To add a team library:</p><p>1. Open the source library document and launch this plugin.</p><p>2. Click \"Add Team Library\". The library should then appear in the \"Saved Team Libraries\" section.</p><p>Note: This does not \"copy\" the team library, it stores a reference to it so all component connections maintain their connection.</p><p><br></p><p>To update a team library:</p><p>1. Open the source library document and launch this plugin.</p><p>2. Click \"Update Team Library\".</p><p><br></p><p>To remove a team library:</p><p>1. Click the minus sign next to any saved team library to remove it. To re-add, follow the steps to add the library.</p><p><br></p><p>To use components from saved team libraries:</p><p>1. Assuming the team library has been added, enable the team library via Figma's assets panel as normal.</p><p><br></p><p>👉 Known Issues</p><p><br></p><p>1. Documents with many local components may take a few moments to populate at first. You may experience this as a frozen plugin when first launching it, however give it some time before shutting it down. This is because the plugin has to search all of the nodes in the current document for components.</p><p>2. Team libraries are stored by name, so if you have 2 team libraries called \"Design System\", saving one will overwrite the other in this plugin.</p><p>3. Saved team libraries do not persist if browser cache has been cleared. This is because the reference is stored in figma.clientStorage.</p>","url":"https://www.figma.com/community/plugin/830178746103135228","iconUrl":"https://www.figma.com/community/plugin/830178746103135228/icon","thumbnailUrl":"https://www.figma.com/community/plugin/830178746103135228/thumbnail"}
