{"id":"961662168712449344","name":"Figmaster","lastUpdateDate":"2021-04-07T16:32:58.433Z","publisherHandle":"mateusz","publisherImage":"https://s3-alpha.figma.com/profile/22feac75-bc64-4106-9b68-9b559055e207","publisherId":"267018","publisherName":"Matt Wierzbicki","description":"<p>The world's first design systems workbook for Figma</p><p><br></p><p>Learn how to build your design system from scratch by doing exercises in Figma</p><p><br></p><p><a href=\"https://www.figmaster.co\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Visit the official website to learn more</a></p><p><br></p><h2><strong>What is Figmaster?</strong></h2><p>In short, the Figmaster plugin is a workbook for Figma that contains a large set of&nbsp;<strong>exercises on how to build your modern design system</strong>&nbsp;from scratch.</p><p><br></p><h2><strong>How does it work?</strong></h2><p>By doing exercises in Figma, you learn and create your guide style and component library simultaneously. It is a format that will help you get the most out of each lesson.&nbsp;<strong>By learning - you create</strong>, and by the way, you get to know keyboard shortcuts, plugins, and techniques of working in Figma that will speed up your workflow. <strong>Everything happens in Figma</strong>&nbsp;- no distractions.</p><p><br></p><h2><strong>Course description</strong></h2><p>Design Systems are becoming so popular because they make products more consistent, accessible, improve their usability, and reduce design decision-making.</p><p>Nowadays, companies and individuals need to learn how to design advanced components, style guides, and documentation in Figma. Improving the workflow and onboarding the new designers to the team is also a challenge.</p><p>In Figmaster, you will learn how to create a design system from scratch in Figma. The Figmaster is purely and simply about practice, so you can start using acquired knowledge right away.</p><p>In this course, you will learn how to set up all the needed&nbsp;<strong>design tokens</strong>, such as defining proper&nbsp;<strong>grids, layouts,</strong>&nbsp;<strong>spacing</strong>, managing icons, choosing and creating&nbsp;<strong>color</strong>&nbsp;and&nbsp;<strong>typographic scales</strong>. You will also learn how to make the&nbsp;<strong>components</strong>&nbsp;like buttons, inputs, modals, text areas, checkboxes, notifications, radio buttons… You will learn how to name components correctly using naming conventions and translate your components into&nbsp;<strong>variants</strong>. You will also learn how to&nbsp;<strong>improve your workflow</strong>&nbsp;by using handy&nbsp;<strong>keyboard shortcuts</strong>,&nbsp;<strong>plugins</strong>, and&nbsp;<strong>tricks</strong>. At the end of this course, you will create your own complete Design System and apply it anywhere&nbsp;<strong>with confidence</strong>.</p><p>In the team version, you will learn how to&nbsp;<strong>work on a design system in a team</strong>&nbsp;and how to&nbsp;<strong>onboard new designers</strong>&nbsp;with the Figmaster. I will also share resources so you can learn more about&nbsp;<strong>design systems theory</strong>&nbsp;and get inspiration from the existing systems.</p><p>We will use the full potential of Figma, making our Design System with&nbsp;<strong>variants</strong>,&nbsp;<strong>auto layout,</strong>&nbsp;and the latest Figma feature:&nbsp;<strong>interactive components</strong>. 🎉</p><p>So if you want to learn how to create a Design System from scratch in Figma,&nbsp;<strong>this is for you.</strong></p><p><br></p><h2>Module 1. Style Guide - available April 2021</h2><p>In the first module, we'll create design tokens and convert them into Figma Styles. We'll prepare the icon library for the entire system. We'll also set up some spacing rules that we'll follow in the next modules.</p><p><br></p><h2><strong>Module 2. Components - available May 2021</strong></h2><p>In the second module, we'll use the Styles, icons, and rules from the previous module to create the components.</p><p><br></p><h2><strong>Module 3. Documentation - available June 2021</strong></h2><p>In the third module, we'll create documentation components and frames. Then, we'll document our components and styles. In this module, you'll also learn how to make your components interactive.</p><p><br></p><h2><strong>Module 4. Use it - available June 2021</strong></h2><p>In the fourth module, we'll build a simple UI with our design system. I'll also show you how to customize it for your needs. That is, change the colors, typography, or component properties to match your product or brand requirements.</p><p><br></p><h2><strong>Module 5. Team license bonus - available June 2021</strong></h2><p>In the last module, I'll show you how to work with a design system we created in a team. You'll also learn how to onboard new designers to the library. As a bonus, you'll also get access to additional resources on design systems, such as links, articles, book recommendations, etc.</p>","url":"https://www.figma.com/community/plugin/961662168712449344","iconUrl":"https://www.figma.com/community/plugin/961662168712449344/icon","thumbnailUrl":"https://www.figma.com/community/plugin/961662168712449344/thumbnail"}
