{"id":"1070272061673120511","name":"Borneo logo animation reveal - Testing Figma's capabilities","lastUpdateDate":"2022-02-09T04:31:36.114Z","publisherHandle":"Alborz","publisherImage":"https://s3-alpha.figma.com/profile/fe6fe9f0-6b5e-4a83-9736-3f3c71864507","publisherId":"923478277059881504","publisherName":"Alborz Heydaryan","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1536151735/388e6fdc-f4f1-4ff2-b012-6f602ad25408-cover.png","description":"<p>Feb 8 update: I added a gif of what I made in SVGator at the end of prototype for comparison. </p><p><br></p><p>It's definitely possible to get acceptable results at best in Figma for such reveals, but there are a few very simple things that are missing in Figma that make this really difficult to achieve.</p><p><br></p><p>I have to make a few extra frames to work around Figma's limitations. Here are the improvements I suggest Figma to make to make these animations a lot more achievable inside Figma natively</p><p><br></p><ul><li>For rotation properties, instead of changing 270º to -90º let users keep -270º. Right now it is not possible to rotate an object from 0º to -270º. it only goes from 0 to -90º the other way. The only work around is adding another step in the middle to force Figma to take the long way around when using smart animate.</li><li>Dashed strokes are a very common tool used in other tools to show a growth animation of a line. Figma has a very clever dashing method that ensures no point in the shape is left an orphan without a dash. But having a dumbed down version of the dash would be very useful. If you look at how I'm animating the letter 'e' in the logo you'll see the length I had to go to make it work. And the end result does not match the 'e' designed because I had to break it down to primary shapes and use many tricks to make it look like it's growing. Ideally I would have a complex path, and set the dash length to be 1-2,000 and animate it to 700-2,000 and it would look like it's growing.</li><li>Which brings me to the next feature that's missing in Figma: Dashes line changes are not animated with smart animate feature. This combined with the previous point would be the most impactful change Figma can make for these type of animations.</li><li>Supporting more properties for smart animate would also be very appreciated. things like the arc, sweep, and ratio of ovals to be animated. These are also common things that users would want to animate.</li><li>Last change which did not impact me in this project but I would love to see in the future is the ability to smart animate vector changes between different frames. Right now the closest I can get to vector animation is using a rectangle and rotating it and changing the corner radius. But having the ability to have a vector network, and then changing the position and orientation of some points in the next frame and have them smart animate would be fantastic.</li></ul><p><br></p><p>I created this exact animation in Svgator and it took me about an hour. The results in Svgator were exactly what I was looking for. Although there are some tricks that have to be used there as well and it's not without hiccups.</p><p><br></p><p>This project took me about 5 hours to finish in Figma and it is not producing the results that I want. The many extra frames in the middle to trick Figma to animate the right away and resorting to masks to make it look like a growth makes the entire animation very jerky. The extra steps also make it impossible to use ease and I had to use linear animation only. Since one movement is broken to 4 different smart animates using any ease is not possible.</p><p><br></p><p>The biggest downgrade for using Figma was having to recreate the letter 'e' with primary objects to make any animation possible at all. It was lucky that this is a very geometric logo and not many organic shapes are there. otherwise this project would not have been possible in Figma.</p><p><br></p><p>Overall I'm very impressed with Figma's capabilities and I'm looking forwards to future updates!</p>","url":"https://www.figma.com/community/file/1070272061673120511"}
