{"id":"1106147872387454569","name":"Journey Mapping","lastUpdateDate":"2022-05-11T09:16:44.191Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856365630/bc789f3e-40c1-488e-80b9-61614a863fe6-cover.png","description":"<p>Get an overview of a certain process and its steps in relation to time.</p><p><br></p><h2><strong>Summary</strong></h2><p>By letting the users visually map down a sequence or process or workflow, that already has been specified, this exercise allows you get a deep understanding of all sub-steps, possible issues, workarounds, and time connected to all efforts.</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>Prepare a large piece of paper and icon print outs for the quick visualization of sub-steps that can be used during the exercise. Participants can glue or pin down these icons at the respective positions on the time line.</li><li>Clearly communicate the start, end, and point-of-view of the sequence. Try to reduce distractions by leaving out other processes that the users might think about but are not relevant to your research.</li><li>Let the users write down the sequence in a very detailed way using the large piece of paper. All events that are being written down need to be at the correct position on the time line.</li><li>Leave space for supplements or additions. Let your users draw arrows to connect different steps and describe how they relate to each other. Promote to use different colors to mark different levels of events or interactions.</li><li>Ideally, you will end up with a very detailed visualization of the process you were looking at. It is important to read between the lines and to discover pain points that can potentially solved or lead to a problem statement.</li></ol>","url":"https://www.figma.com/community/file/1106147872387454569"}
