{"id":"819673289521421871","name":"[WIP] Open Source Style Guide Generator Plugin","lastUpdateDate":"2020-03-11T20:51:24.148Z","publisherHandle":"rogie","publisherImage":"https://s3-alpha.figma.com/profile/200fdd53-64e8-466e-b1fd-e12c64bff16c","publisherId":"1105","publisherName":"Rogie King","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/269746567/6e9cb632-2245-4b9e-9fdf-263a59347ada-cover","description":"Intro:\nThomas Lowry (@tom) and I have been partnering up to expose our design process to conceptualize a plugin. We took to Twitter to give the community an opportunity to vote on what we should create that would useful to you all. There were many great ideas, but a plugin to generate a style guide was the winner by far.\n\nCheck out the poll and complete thread here → https://twitter.com/rogie/status/1235319855332679680\n\nGoals:\nDesign a style guide generator plugin that we will build and share with the community. As the design of the plugin progresses, we will be publishing updates to this file on an almost daily basis.\n\nDesign milestones:\n→ Design the output of the plugin (what the plugin creates on the canvas when you run it)\n→ Design the user-interface of the plugin (what you interact with when you run the plugin)\n\nProgress report:\n[✓]  Crowd-source a useful idea for a plugin\n[✓]  Collect style-guide inspiration\n[✓]  Start rough wireframes to explore plugin output\n[   ]  Refine wireframes of plugin output\n[   ]  High fidelity design of plugin output\n[   ]  Start wireframe of plugin UI\n[   ]  High fidelity design of plugin UI\n[   ]  Build first draft of actual plugin\n[   ]  Beta test plugin with the community\n[   ]  Release v1.0 to the community\n\nHow you can help:\nWe would love for ANYONE to submit ideas to help drive this forward. If you have some ideas at any point in the process, feel free to get involved and make a contribution (more below).\n\nHow to make a contribution:\n1. Duplicate this file \n2. Add any design ideas you have to the “Your ideas here” page (this helps us keep track of your contributions).\n3. Make sure your page with your work appears as the project thumbnail\n4. Publish the file back to the community (if you’re not part of the beta email rking (at) figma.com)\n\nWhat happen’s next:\nWe’ll incorporate your ideas into the next version of the file that we publish. We’ll be posting regular progress here and on Twitter. Follow @rogie and @negativespaceca to stay updated.","url":"https://www.figma.com/community/file/819673289521421871"}
