{"id":"874515048823651494","name":"Connect","lastUpdateDate":"2021-01-12T00:22:40.740Z","publisherHandle":"santiagomoreno","publisherImage":"https://s3-alpha.figma.com/profile/736d3579-c3ea-4314-9f52-ac263dde8eb5","publisherId":"570857","publisherName":"Santiago Moreno","description":"<p>Mirror any screen to any file and create global userflows without duplicating your content. Update them whenever you want.</p><p><br></p><h1>Use cases</h1><p><br></p><p>1. Put together multiple screens from different files into a single one without duplicating your content. Screens get imported as images so they are not directly editable. This allows you to keep your source files organized and create global flows to present to PMs, POs, Stakeholders, etc. Screens keep connected by their Artboard name so you can update them whenever you need if there are any changes to the source files.</p><p><br></p><p>2. If creating device mockups you can mirror your screens to import images from your screens quickly without manually copy pasting them.</p><p><br></p><h1>How to use</h1><p><br></p><p>1. Create a new file where you want to import all of your files.</p><p>2. Generate an access token from your Settings page under your profile name.</p><p>3. Copy the generated token.</p><p>4. Open the Connect plugin and paste your token.</p><p>5. You can now paste any file link you want to import.</p><p>6. Select the screens you want to import. You can search through them, or filter by pages.</p><p>7. Hit 'Connect Selected' and that's it!</p><p><br></p><p>You can now use arrow plugins to connect your screens if you need to create a flow. If you make any changes to the original screens just import your file again and select the screens you want to overwrite. Keep in mind you need to name your artboards accordingly.</p><p><br></p><p><a href=\"https://www.youtube.com/watch?v=TrNj5ll0lj0\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Creating Connect</a></p><p><a href=\"https://twitter.com/sntiagomoreno\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Follow updates</a></p>","url":"https://www.figma.com/community/plugin/874515048823651494","iconUrl":"https://www.figma.com/community/plugin/874515048823651494/icon","thumbnailUrl":"https://www.figma.com/community/plugin/874515048823651494/thumbnail"}
