{"id":"754026612866636376","name":"SPELLL - Spell Checking for Figma & FigJam","lastUpdateDate":"2021-10-14T20:35:55.641Z","publisherHandle":"tkmadeit","publisherImage":"https://s3-alpha.figma.com/profile/bcd559d3-c65b-494b-8ad4-774bb83e15b7","publisherId":"156890","publisherName":"Tekeste Kidanu","description":"<p>This plugin gives Figma &amp; FigJam a spell-checking super power similar to that of Google Docs. ⚡✨</p><p>It constantly checks your Figma or FigJam document for any spelling errors and lets you fix them with a single click.</p><p>You have worked really hard to create that perfect UI. Don’t let a silly typo ruin it.</p><p>Use SPELLL and avoid those embarrassing mistaks. 😉</p><p><br></p><p>Usage:</p><p><br></p><p>1. Open SPELLL - Spell check for Figma plugin.</p><p>2. If it finds any spelling mistakes you will be able to fix them by either clicking on the Accept button or ignore the suggestion by clicking on the Ignore button. Click the three dots next to the Accept button for more options.</p><p>3. That is it, if you keep SPELLL open it will monitor your document and give you real time spelling suggestions.</p><p><br></p><p>New Features:</p><p><br></p><p>▶ Ability to fix or ignore multiple instances of a typo with a single click.</p><p><br></p><p>▶ Ability to add words such as your brand name to your dictionary to stop them from being reported as spelling mistakes.</p><p><br></p><p>▶ Detects new text layers being added and spell check them in real time.</p><p><br></p><p>▶ Ability to pick from multiple suggestions.</p><p><br></p><p>▶ Zooms into and selects the current text layer with a typo to provide you with more context.</p><p><br></p><p>▶ Massive performance improvement while working on large Figma files.</p><p><br></p><p>▶ Remembers your preferred language.</p><p><br></p><p>Supported languages:</p><p><br></p><p>SPELLL supports 43 languages from around the world.</p><p>These are the supported languages</p><p>Asturian, Belarusian, Breton, Catalan, Catalan (Valencian), Chinese, Danish, Dutch, English, English (Australian), English (Canadian), English (GB), English (New Zealand), English (South African), English (US), Esperanto, French, Galician, German, German (Austria), German (Germany), German (Swiss), Greek, Italian, Japanese, Khmer, Persian, Polish, Portuguese, Portuguese (Angola preAO), Portuguese (Brazil), Portuguese (Moçambique preAO), Portuguese (Portugal), Romanian, Russian, Simple German, Slovak, Slovenian, Spanish, Swedish, Tagalog, Tamil &amp; Ukrainian.</p><p><br></p><p>It is impossible for me to test all these languages so please do let me know if your preferred language is not working as expected through Twitter <a href=\"https://twitter.com/tkmadeit\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://twitter.com/tkmadeit</a> or email <a href=\"mailto:support@spelll.design\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">support@spelll.design</a></p><p><br></p><p><strong>Why do I need a license key?</strong></p><p><br></p><p>I pay a monthly subscription to run and maintain the spell checking software and server, protecting my own API by making you request for a license key helps me reduce abuse on the API and hefty monthly subscription fees.</p><p><br></p><p>Your email address will ONLY be used for sending you information regarding SPELLL, such as your license key and feature updates.</p><p><br></p><p>You will be able to use SPELLL for free if your Figma or FigJam document is small enough, otherwise after 7 days of trial you will be asked to upgrade to a paid version.</p><p>You can read more about it on the landing page for the <a href=\"https://spelll.design/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">spell checker for Fgima</a></p><p><br></p><p><strong>Privacy &amp; Security</strong></p><p>SPELLL does NOT upload your Figma or FigJam file to our server but rather only send a tokenized text to be spellchecked. All of this happens in memory and is ephemeral which means NOTHING gets stored from your files, except for the words you manually add to your dictionary. This way when you use SPELLL on a new device those words will not be spell checked again.</p>","url":"https://www.figma.com/community/plugin/754026612866636376","iconUrl":"https://www.figma.com/community/plugin/754026612866636376/icon","thumbnailUrl":"https://www.figma.com/community/plugin/754026612866636376/thumbnail"}
