{"id":"754415266574382747","name":"Color Compass","lastUpdateDate":"2021-03-16T15:13:53.265Z","publisherHandle":"jaclyntan","publisherImage":"https://s3-alpha.figma.com/profile/cb21db5e-8660-49f0-83c2-f0408b682b09","publisherId":"654690","publisherName":"Jaclyn Tan","description":"<h2>Quickly navigate the color spectrum with designer-focused accuracy.</h2><p><br></p><p><strong> Groups are now supported! </strong></p><p><br></p><p>Instead of eyeballing and colour picking randomly from the entire spectrum, simply feed a base colour to this plugin to generate tints, shades, tones, and complementary colours.</p><p><br></p><p>Increase or decrease the step value to hone in on the exact shade you want.</p><p><br></p><p>Experiment with different swatches and update elements on the fly directly from the plugin.</p><h2><br></h2><h2>⭐️&nbsp;To Use</h2><ul><li>Run the plugin from Figma</li><li>Select an element containing a fill, background, or stroke (note groups are not supported)</li><li>Click on the Update button to update the base colour</li><li>Click on a plugin swatch while an element is selected to update a pre-existing fill, background, or stroke.</li></ul><h2><br></h2><h2>⭐️&nbsp;Notes</h2><ul><li>You can now type in a custom hex code if no element is currently selected. Note that if an element <em>is </em>selected on the canvas and the hex code is updated manually thereafter, the plugin will default to selecting the colour from the selected element first meaning any manual input will be ignored.</li><li>Copy the hex code from the plugin by clicking on the clipboard icon</li><li>You can keep clicking on <em>Update</em> to generate random colour palettes based on your previous colour selection.</li><li>Click on the plus button next to a palette label to add the swatches to your document.</li><li>This plugin will work on any element that is able to display a solid fill, stroke, or background</li></ul><p><br></p><p>♡ If you run into any bugs or have any feature requests please submit an issue on Github.</p>","url":"https://www.figma.com/community/plugin/754415266574382747","iconUrl":"https://www.figma.com/community/plugin/754415266574382747/icon","thumbnailUrl":"https://www.figma.com/community/plugin/754415266574382747/thumbnail"}
