{"id":"1017615468313501249","name":"Shopify's Dawn Theme - Online Store 2.0","lastUpdateDate":"2021-10-21T01:45:36.464Z","publisherHandle":"dayton","publisherImage":"https://s3-alpha.figma.com/profile/2c7d1e0e-f887-49bc-8665-7ba1125c7f89","publisherId":"31007","publisherName":"Dayton Pereira","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1224935088/69f6ffbe-b823-4f4e-a484-570052b59479-cover.png","description":"<p>If you're designing themes for the new Shopify online store 2.0 and you wished you had the Dawn theme as a nicely put together Figma file.</p><p><br></p><p>Ta da, wish granted.</p><p><br></p><p><strong>Change log</strong></p><p><br></p><p>Wednesday October 20, 2021</p><ul><li>Started the incorporation of the Shopify's Theme Editor Components, another community file I made, to show how each section can be customized in the settings panel.</li><li>Added the settings for the Header image section and will progressively add all the section and block settings for all sections over the coming weeks.</li></ul><p><br></p><p>Tuesday September 21, 2021</p><ul><li>Added all the placeholder svgs found when installing a theme for the first time.</li></ul><p><br></p><p>Tuesday September 14, 2021</p><ul><li>Imported all the SVG icons from the source Dawn theme</li><li>Set all icons in a bounding box of 20x20</li></ul><p><br></p><p>Monday September 13, 2021</p><ul><li>Update the color system to more closely match that of the Dawn theme colors using Accent 1 Background 1 etc.</li><li>Text color is now distinct from background and accent colors making for easier customization</li><li>Added a new cover thumbnail to describe all the stuff you get</li></ul><p><br></p><p>Friday September 10, 2021</p><ul><li>Added the complete mobile version for Dawn</li><li>Added the <strong>Featured Collection</strong> section for Desktop and Mobile,</li><li>Added the <strong>Collage</strong> section for Desktop and Mobile</li><li>Added the <strong>Image with text</strong> section for mobile</li><li>Splitting up Components from Snippets to manage assets better</li><li>Added prototype pages for each mobile page, the homepage demonstrates the navigation, the collection page demonstrates filtering, the search page demonstrates search</li></ul>","url":"https://www.figma.com/community/file/1017615468313501249"}
