{"id":"1084033342624298924","name":"6-3-5 Brainwriting","lastUpdateDate":"2022-03-11T08:57:50.891Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1641018700/f0f43969-6880-46b1-a35a-4a3deac8b74b-cover.png","description":"<p>Develop innovative ideas by writing.</p><p><br></p><h2>Summary</h2><p>Similar to&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/brainstorming\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Brainstorming</strong></a>, the 6-3-5 Brainwriting method, helps to generate ideas quickly. However, instead of exchanging these verbally in the group, the ideas are written down. This also gives the quieter team members a chance to contribute their ideas.</p><p><br></p><h2>Step-by-step</h2><ol><li>Set up a meeting in a quiet environment. Each participant should have their own writing material, such as pens and paper or the 6-3-5 Brainwriting worksheet.</li><li>A theme can be determined before the brainwriting begins, as in the form of a How Might We question. For example: “How might we plan lunch breaks so that the canteen is not overcrowded?”.</li><li>Working individually, each participant writes down three ideas, each in its own vertical column on a paper or the worksheet, if provided. In total, this should take no longer than five minutes.</li><li>Next, the ideas written down are passed on to the person sitting next to them. This person reads through the ideas carefully and completes each of them by writing down an evolved version of the same idea under the previous one.</li><li>Repeat the process until the ideas return to their original authors, or rather five times.</li><li>After the creative brainstorming process, the moderator takes the floor again and starts to analyze and evaluate the participants' ideas with them. This can breathe new life into the ideation process and dissolve blockages in thinking.</li></ol>","url":"https://www.figma.com/community/file/1084033342624298924"}
