{"id":"1103413670540303077","name":"Slider (carousel) template 3D (Community)","lastUpdateDate":"2022-05-03T20:11:59.617Z","publisherHandle":"youna38","publisherImage":"https://www.gravatar.com/avatar/2446b88a0667a550696b0527fd1ac7cd?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_y_v2.png","publisherId":"1071534790223294284","publisherName":"yes,","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1824091970/bf809b1c-5bae-465c-857d-a890daae4098-cover.png","description":"<pre class=\"ql-syntax\" spellcheck=\"false\">Notion for Startup Terms\n\nYour organization (“you,” or “your”) may be eligible to receive a Notion for Startups promotional coupon code (“Coupon Code”). Notion Labs, Inc. (“Notion”) may collect information from you to verify whether you meet the program eligibility criteria. By submitting your information you agree that Notion may use the information to verify your eligibility, which may include sharing this information with a third party provider.\n\nYou acknowledge and agree that Notion may issue or not issue the Coupon Code in its sole discretion and Notion may change the program eligibility criteria at any time in its sole discretion. Current program eligibility criteria include: (1) you have a valid Notion domain; (2) you have a public company website and a unique company email domain (generic email domains and stealth websites will not be accepted); and (3) you have not undergone a change of control or initial public offering. If Notion denies your request and you believe you should be eligible, you should email startups@makenotion.com.\n\nCoupon Codes may only be applied once and may not be used not in combination with any other offers or codes. Coupon Codes may only be applied towards current Subscription Fees (as defined in Notion’s Master Subscription Agreement) and may not be applied to prior payments. General credits may not be applied to existing Team or Enterprise subscriptions (Partner credits may still be applied to existing Team but not Enterprise subscriptions). ****Your company must be less than 100 employees to use the credit. Coupon Codes are not redeemable for cash and expire one (1) year after the date the Coupon Code is issued. Notion may discontinue its Notion for Startups promotional coupon code program at any time, for any reason, and in its sole discretion.\n</pre>","url":"https://www.figma.com/community/file/1103413670540303077"}
