{"id":"920101630987096609","name":"Lowdi - Wireframe Kit","lastUpdateDate":"2021-03-05T11:20:34.752Z","publisherHandle":"wodziczka","publisherImage":"https://s3-alpha.figma.com/profile/983ccd6a-12c6-4450-9f0f-5a536957a587","publisherId":"852955035141615265","publisherName":"Daniel","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/712903223/df590742-0f60-4bef-9749-7b2d66b18c24-cover.png","description":"<p>Set of prototype-ready components to help you create wireframes in a flash. Created with the greatest accuracy and attention to details by component freak and wireframe lover.</p><p><br></p><p><s>------------</s></p><p><br></p><h2><strong>Update - 29 December</strong></h2><ul><li>Every component now has a description inside project with detailed information about them. It will help in searching them in the assets panel too.</li></ul><p><br></p><h2>Update - 17 December</h2><ul><li>Fixed couple of bugs in flow arrows</li><li>Added page called \"playground\" to try components and study ready wireframes, now everything is prepared and ready to make some fun</li></ul><p><br></p><p><br></p><h1><strong>💙 What you can find inside Lowdi</strong></h1><ul><li>Tons of components in many sizes with countless number of variants and customizable options (supports new figma auto-layout and variants).</li><li>4 fully responsive and customizable device mockups (laptop, tablet, phone, smartwatch)</li><li>Predefined typography system and color palette with fully customizable primary color.</li><li>Essential flow assets such as arrows or sticky notes for making user flows or visualizing user stories.</li><li>Extensive and clear documentation that allows beginners to enter the world of wireframes in figma.</li><li>Many examples of already created wireframes with Lowdi components to learn about Lowdi's possibilities even more easily.</li></ul><p><br></p><h1><strong>❓ What are wireframes &amp; why use them</strong></h1><p>Wireframes are used mainly in the UX design phase to define in a schematic way basic elements and functions of the project. During wireframing high priority is put on working on the user experience, time for detailed interface or animations will come later.</p><p><br></p><p>This time you don't have to switch software and work on several ones and synchronize. Now you have everything you need to wireframe inside figma and fluently switch from the UX/wireframe phase to designing actual interfaces.</p><p><br></p><p><s>------------</s></p><p><br></p><h2><strong>Your feedback and ideas</strong></h2><p>In case of any ideas about future updates of Lowdi or anoying bugs to fix, feel free to contact me on <a href=\"https://www.linkedin.com/in/wodziczka/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">my linkedin profile</a>.</p><p><br></p><p>Check also the <a href=\"https://www.producthunt.com/posts/lowdi-figma-wireframe-kit\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Product Hunt page</a> and upvote Lowdi if u like it, to help others discover that kit</p>","url":"https://www.figma.com/community/file/920101630987096609"}
