{"id":"1041628302986185007","name":"LIVEASY Trucks Rental project","lastUpdateDate":"2021-11-14T08:19:00.124Z","publisherHandle":"vijayuiuxdesgin","publisherImage":"https://www.gravatar.com/avatar/5d0fd4a620fc27ed9bd9ff7322baecaf?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_v_v2.png","publisherId":"947805967806207403","publisherName":"vijay","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1291726731/03647876-e3ea-4968-b3e6-a438cfe9e0d0-cover.png","description":"<p>an amazing platform to cater to your all kind of problems when it comes to booking a truck on rent. We understand that when you are relocating your home or office, you might be busy with other important tasks and feel stressed about hiring a reliable and affordable truck. So here, we share your stress by offering you the best services to&nbsp;<a href=\"https://truckguru.co.in/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>rent truck in India</strong></a><strong>.&nbsp;</strong></p><p>&nbsp;</p><p>Whether you want to move household goods or office furniture, our truck booking services help to move you from one place to another in the same city or different without any hassle. We work on complete transparency to maintain a level of trust with our clients. We are the trusted partner for many businesses as we are managing all types of logistics moves and helping them to make their logistics operations easy and smooth.</p><p>&nbsp;</p><p>If you are searching for a reliable, economical and experienced truck rental company in India, your search ends here. We can help you to have hassle-free goods transportation to any part of the country. With our easy-to-access and user-friendly digital platform, you can make the booking for your suitable truck very easily in just a few clicks. You just need to enter your requirements like load, size, place where you want to shift your moving goods, the budget and the truck hire type. This information helps us to offer you the best truck for your needs.</p>","url":"https://www.figma.com/community/file/1041628302986185007"}
