{"id":"995042400603194573","name":"Tunas Sawa Erma Group PT","lastUpdateDate":"2021-07-08T19:03:15.417Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968343147/da44fe0c-3b02-4749-8be6-5425b9b24758-cover.png","description":"<p><strong>Tunas Sawa Erma Group </strong>merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang bisnis perkebunan dan pengolahan minyak kelapa sawit bersama bersama kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang semuanya bergerak didalam bidang budidaya kelapa sawit dan memproses minyak sawit mentah (Crude Palm Oil/CPO) serta berlokasi di Papua. Sejak tahun 1995, Tunas Sawa Erma Group mengawali bisnis kelapa sawit di Papua atas permohonan Pemerintah Daerah. Kondisi infrastruktur pas itu senantiasa minim, tetapi Tunas Sawa Erma Group mampu berkembang baik dan juga jadi pihak pertama yang berkontribusi didalam pembangunan jalan Trans-Papua.</p><p><br></p><p>Sesuai bersama bersama visi dan misi untuk jadi perusahaan global, Tunas Sawa Erma Group memiliki prinsip terhadap kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang telah terjadi dan tertuang secara mengerti di web formal perusahaan. Areal konsesi kami tidak berlokasi di lahan gambut. Selain itu, TSE Group juga menciptakan proses dan lingkungan kerja yang mendukung pengembangan sumber daya manusia melalui program seleksi dan pelatihan serta pembangunan berkelanjutan. Saat ini perusahaan juga telah memiliki tim Sustainability.</p><p><br></p><p>Kami juga mengapresiasi kontribusi para karyawan yang senantiasa berkembang bersama bersama perusahaan. Atas dedikasinya, Tunas Sawa Erma Group telah mempromosikan 70% berasal dari karyawan jadi karyawan tetap. Kemajuan wanita juga jadi bagian berasal dari perhatian kami. Sebanyak 20% berasal dari keseluruhan karyawan adalah perempuan dan kami senantiasa mendukung untuk mencapai potensi paling baik mereka.​</p><p><br></p><p>Tak cuma itu, Tunas Sawa Erma Group Sebagai perusahaan juga senantiasa memelihara pertalian yang selaras dan saling membangun bersama bersama Pemerintah Daerah maupun masyarakat setempat, serta senantiasa aktif didalam aktivitas pengembangan ekonomi dan kesejahteraan masyarakat Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang telah beroperasi yaitu milik PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.&nbsp;</p>","url":"https://www.figma.com/community/file/995042400603194573"}
