{"id":"1023805574372075411","name":"(easy)Grid","lastUpdateDate":"2021-12-30T15:22:05.529Z","publisherHandle":"elirazatia","publisherImage":"https://www.gravatar.com/avatar/1042f75f5eab403a30e5bf6ee8ad78d0?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_e_v2.png","publisherId":"692","publisherName":"Eliraz Atia","description":"<p>(Easy)grid lets you place pixel perfect grids onto any layer in seconds, grids that can be made without having to manually work out the sizing or positioning, and that can be rapidly modified until perfect.</p><p><br></p><p>How many times have you had to create a grid or layout, and found yourself spending too much time finding the correct sizes for each section, messing around with spacing to ensure it looks perfect, or having to perfectly align it? well now that's going to be quicker then ever.</p><p><br></p><p><br></p><p><strong>FEATURES</strong></p><p><br></p><p>🎨 Create layout patterns ranging from a couple of rows or columns to creating the layout for whole tools and software</p><p><br></p><p>👨‍💻 Reduce mistakes and time needed by not needing to worry about sizing or positioning your layout</p><p><br></p><p>📲 Move the layout from the plugin directly over your selected Figma layout</p><p><br></p><p>⏳ Your layout options are remembered after you move them into Figma, and after you change your selection, letting you test a layout over different sized screens, or quickly prototyping variations</p><p><br></p><p><br></p><p><strong>CAN BE USED FOR</strong>&nbsp;</p><p><br></p><ul><li>simple repetitive layouts</li><li>website and app layout</li><li>guides for digital graphics</li><li>testing out variations of a layout</li><li>quickly populate wireframe elements</li></ul><p><br></p><p><br></p><p><strong>TO USE</strong></p><p><br></p><ol><li>Select a layer to create the grid over, can be a rectangle or a frame.</li><li>Enter the amount of cells you want in the Grid column / Grid row fields. You can also enter the size of each cell by writing it manually (separated by spaces) either by using exact values (in points) or by using a total fraction of the grid.</li><li>Adjust the Column gap / Row gap to your liking</li><li>If you want to merge cells to create a more complicated pattern, using the preview menu, drag and drop on the cells you want to create them as a single shape.&nbsp;</li><li>Press the “Apply To Selected” button to insert the grid into Figma.</li><li>Undo (CTRL / CMD + Z) and change values if not happy with the results.</li></ol><p><br></p><p><br></p><p><strong>MORE INFORMATION</strong></p><p><br></p><p>Visit our website at <a href=\"https://easygrid-app.web.app/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://easygrid-app.web.app/</a>. We also respond to all questions and feedback posted in the comments area.&nbsp;</p>","url":"https://www.figma.com/community/plugin/1023805574372075411","iconUrl":"https://www.figma.com/community/plugin/1023805574372075411/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1023805574372075411/thumbnail"}
