{"id":"1023805574372075411","name":"(Easy)Grid","lastUpdateDate":"2022-03-04T18:50:56.001Z","publisherHandle":"elirazatia","publisherImage":"https://www.gravatar.com/avatar/1042f75f5eab403a30e5bf6ee8ad78d0?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_e_v2.png","publisherId":"692","publisherName":"Eliraz Atia","description":"<p>(Easy)grid lets you create a grid layout in seconds and place it into Figma without the math. It can also let you quickly align and scale pre-existing elements as layout-items/cells for a quicker design flow. By using the four flexible options (columns, rows, column gap, and row gap) you can write out a layout that is the exact fit and rapidly modify until perfect.</p><p><br></p><p>How many times have you had to create a grid or layout, and found yourself spending too much time finding the correct sizes for each element, messing around with spacing to ensure it looks perfect, or having to perfectly align it? This is where the (Easy)grid plugin comes into play.</p><p><br></p><p>See <a href=\"https://easygrid-app.web.app/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://easygrid-app.web.app/</a> or continue reading to learn more about the plugin and about how to use it.</p><p><br></p><p>You can also support me and the project by visiting <a href=\"https://www.paypal.me/elirxxatia\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://www.Paypal.me/elirxxatia</a></p><p><br></p><p><br></p><p><strong>FEATURES</strong></p><p><br></p><p>🎨 Create layouts in seconds — Create layout patterns in seconds ranging from a couple of rows or columns to creating the layout for whole tools and software.</p><p><br></p><p>🎛 <strong>[NEW FEATURE]</strong> Populate cells with components — When applying your layout to the selected layer, you may select more than one layer to populate the layouts' with its cells as the additional layers selected.</p><p><br></p><p>💾 <strong>[NEW FEATURE]</strong> Saving created layouts — Save your layout and reuse them in other Figma projects to quickly insert your most common layouts.</p><p><br></p><p>🗂 <strong>[NEW FEATURE] </strong>Pre-made Layouts — Select from 5 pre-made grids to make your design come to life even faster, these grids include: Golden Ratio, 12 Column Grid, iPad App With Sidebar, Notched iPhone Layout, and a Rule Of Thirds grid.</p><p><br></p><p>👨‍💻 Work faster, not harder — Reduce mistakes and time taken by not needing to worry about sizing or positioning your layout and letting (easy)grid handle the mathematical side of things.</p><p><br></p><p>📲 Insert to Figma In A Click — Insert the layout from the plugin directly over your selected Figma layer in a single click.</p><p><br></p><p>⏳ Remembers what you wrote — Your layout options are remembered after you move them into Figma, even after you change your selection, letting you test a layout over different sized screens, or quickly prototyping variations.</p><p><br></p><p><br></p><p><strong>CAN BE USED FOR&nbsp;</strong></p><p><br></p><ul><li>Simple Repetitive Layouts</li><li>Web / App Layouts</li><li>Creating Lists / Grids</li><li>Creating Patterns</li><li>Guides For Digital Design</li><li>Rapidly Testing Out Various Layouts</li><li>Quickly Populating Elements Without CMD+C and CMD+V And Dragging</li></ul><p><br></p><p><br></p><p><strong>TO USE</strong></p><p><br></p><ol><li>Select a layer to create the grid over, can be a rectangle or a frame.</li><li>Enter the amount of cells you want in the Grid column / Grid row fields. You can also enter the size of each cell by writing it manually (separated by spaces) either by using exact values (in points) or by using a total fraction of the grid.</li><li>Adjust the Column gap / Row gap to your liking</li><li>Optionally, you can merge cells to create a more complicated pattern, using the preview menu, drag and drop on the cells you want to create them as a single shape.&nbsp;</li><li>Press the “Apply To Selected” button to insert the grid into Figma.</li><li>(Optional) Undo (CTRL / CMD + Z) and change values if not happy with the results.</li></ol><p><br></p><p><br></p><p><strong>MORE INFORMATION</strong></p><p><br></p><p>Visit our website at <a href=\"https://easygrid-app.web.app/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://easygrid-app.web.app/</a>. We also respond to all questions and feedback posted in the comments area.&nbsp;</p>","url":"https://www.figma.com/community/plugin/1023805574372075411","iconUrl":"https://www.figma.com/community/plugin/1023805574372075411/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1023805574372075411/thumbnail"}
