{"id":"1001905153154363411","name":"Design Group 8 App","lastUpdateDate":"2021-07-27T17:33:23.485Z","publisherHandle":"GreyH2O","publisherImage":null,"publisherId":"1001905152986597764","publisherName":"SHAD Design Group 8","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1008576298/d8ab30ff-c03d-4a03-9309-cd04abc19071-cover.png","description":"<h3><strong>The Problem:</strong></h3><p>Water is the most valuable natural resource for life on Earth, and Canada contains much of the Earth’s freshwater. The average Canadian water footprint is much higher than the world's average, hence, we must ask: <strong>How might we help Canadians treat our freshwater with more respect?</strong> Every day Canadian homeowners use clean drinking water for appliances such as dishwashers, laundry machines, and showers. A method has been developed to help Canadians save drinking water for one purpose and reuse water for powering day-to-day appliances. The water reused is called grey water, it is clean waste water from showers, dishwashers, etc, excluding toilets. The lack of water literacy among homeowners and the assumption that grey water contains pathogens that cannot be removed leaves many wary about the long-term benefits of this solution. With this in mind, how might we help Canadian homeowners take advantage of grey water?</p><p><br></p><h3><strong>Our Solution:&nbsp;</strong></h3><p>Our solution is an app called GreyH2O that incorporates technological advancements in AI, Data Visualization, and automatic data extraction from a home. By utilizing the power of AI, our system will be able to classify incoming data into the utility categories, such as toilets, showers, and sinks. By doing so, homeowners will easily be able to track important data about the water in their homes and manage their water usage accordingly. Daily visualizations will be provided to the consumer that helps them understand their water usage in designated partitions of their home. This includes the home’s overall efficiency score, water usage score, etc. </p>","url":"https://www.figma.com/community/file/1001905153154363411"}
