{"id":"995042862638308558","name":"Alamat Email Pt.tunas Sawa Erma Group","lastUpdateDate":"2021-07-08T19:05:05.622Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968348981/a82726c8-d0d4-4f5f-b04c-805fd43b769e-cover.png","description":"<p><strong>Tunas Sawa Erma Group </strong>merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang bisnis perkebunan dan pengolahan minyak kelapa sawit bersama bersama kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang semuanya bergerak dalam bidang budidaya kelapa sawit dan memproduksi minyak sawit mentah (Crude Palm Oil/CPO) dan juga berlokasi di Papua. Sejak th. 1995, Tunas Sawa Erma Group mengawali bisnis kelapa sawit di Papua atas keinginan Pemerintah Daerah. Kondisi infrastruktur selagi itu tetap minim, namun Tunas Sawa Erma Group bisa berkembang baik dan juga menjadi pihak pertama yang berkontribusi dalam pembangunan jalur Trans-Papua.</p><p><br></p><p>Sesuai bersama bersama visi dan misi untuk menjadi perusahaan global, Tunas Sawa Erma Group miliki prinsip terhadap kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang telah berjalan dan tertuang secara memahami di web site formal perusahaan. Areal konsesi kita tidak berlokasi di lahan gambut. Selain itu, TSE Group juga menciptakan proses dan lingkungan kerja yang menunjang pengembangan sumber kekuatan manusia melalui program seleksi dan pelatihan dan juga pembangunan berkelanjutan. Saat ini perusahaan juga telah miliki tim Sustainability.</p><p><br></p><p>Kami juga mengapresiasi kontribusi para karyawan yang tetap berkembang bersama bersama perusahaan. Atas dedikasinya, Tunas Sawa Erma Group telah mempromosikan 70% berasal berasal dari karyawan menjadi karyawan tetap. Kemajuan wanita juga menjadi bagian berasal berasal dari perhatian kami. Sebanyak 20% berasal berasal dari keseluruhan karyawan adalah perempuan dan kita tetap menunjang untuk meraih potensi paling baik mereka.​</p><p><br></p><p>Tak cuma itu, Tunas Sawa Erma Group Sebagai perusahaan juga tetap memelihara pertalian yang cocok dan saling membangun bersama bersama Pemerintah Daerah maupun masyarakat setempat, dan juga tetap aktif dalam kesibukan pengembangan ekonomi dan kesejahteraan masyarakat Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang telah beroperasi yaitu punya PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.&nbsp;</p>","url":"https://www.figma.com/community/file/995042862638308558"}
