{"id":"844697202715835091","name":"Maximum Override","lastUpdateDate":"2021-09-14T20:05:11.979Z","publisherHandle":"madaross","publisherImage":"https://s3-alpha.figma.com/profile/fbbdbfad-6edc-493f-8946-fe44fedcf9ef","publisherId":"856719838436382828","publisherName":"Michael Daross","description":"<p>Compare objects to see what's different, then copy and paste the changes. Compare instances to their default main component and copy and paste the overrides.</p><p><br></p><p>Features</p><p>1. Copy and paste overrides between symbols</p><p><br></p><p>Two of Figma's greatest strengths are:</p><p><br></p><p>a. Overriding colors, text, and other properties on component instances, and</p><p>b. Swapping out instances of components, such as a icons or states.</p><p><br></p><p>But when you swap an instance, you lose all the overrides you've made, including changes to nested instances within a parent component.</p><p><br></p><p>Maximum Override allows you to copy your overrides, swap out an instance, and then paste the overrides back onto the new instance, to retain all of your changes. This includes nested instances that you've swapped with a different component.</p><p><br></p><p>2. Compare properties between objects</p><p><br></p><p>Maximum Override also allows you to select any two nodes on the stage and compare them against each other to see what's different. (In software, this is known as a \"diff\".) You can then copy the changes from object A to object B, or vice-versa. If you select a single instance, Maximum Override will compare it against its own main component.</p><p><br></p><p>------------</p><p><br></p><p>Bugs? Suggestions? Contributions? See the open-source project at <a href=\"https://github.com/CrookedGrin/maximum-override.\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://github.com/CrookedGrin/maximum-override.</a></p>","url":"https://www.figma.com/community/plugin/844697202715835091","iconUrl":"https://www.figma.com/community/plugin/844697202715835091/icon","thumbnailUrl":"https://www.figma.com/community/plugin/844697202715835091/thumbnail"}
