{"id":"814117528089546244","name":"Project Notes","lastUpdateDate":"2022-01-19T11:46:21.417Z","publisherHandle":"93842","publisherImage":"https://s3-alpha.figma.com/profile/7196e82a-e30e-4d7d-ad64-79cf99cebe2f","publisherId":"93842","publisherName":"Stu Greenham","description":"<h2>About</h2><p>Project Notes helps you keep your project organised with easy to access titles, footnotes and stickies for all your artboards.</p><p><br></p><h2>Using the Plugin</h2><p>Select one of the options from the plugin UI and it will automatically be added to your projects canvas.</p><p><br></p><p>For the <strong>Title </strong>and<strong> Footnote</strong> tools, you can either add them normally to the center of the canvas, or you can attach them to one or multiple frames. To do this, simple select the frames you wish to attach a title and/or footnote too and then click on the relevant option in the plugin UI and the new objects will appear above (title) or below (footnote) each or your selected frames. This is a great way to title and add notes to each of your frames.</p><p><br></p><p>For the <strong>Annotation</strong> and <strong>Sticky Note</strong> tools, you can just add them anywhere you want on your canvas and add as many as you want. They both use autolayout, so you can just type as much content as you need and the objects will resize vertically. If you need too, you can extend the width of them manually.</p><p><br></p><h2>New in version 10-12:</h2><ol><li>Reworked UI to accommodate different sized titles and footnotes.</li><li>The plugin no longer requires you to have pre selected elements on the canvas to add titles and footnotes.</li><li>I removed the title+footnote objects based on low usage numbers in favour of two individual tools.</li><li>Added autolayout to both the annotation and sticky tools.</li><li>The sticky notes now include your name in the bottom right.</li><li>Added a feedback link and some better logging to help me develop the plugin further.</li></ol><p><br></p><h2>Feedback</h2><p>If anyone has feedback on this plugin, please send to hello[at]stugreenham[dot]com 🤙🏼 or use the link in the plugin footer.</p>","url":"https://www.figma.com/community/plugin/814117528089546244","iconUrl":"https://www.figma.com/community/plugin/814117528089546244/icon","thumbnailUrl":"https://www.figma.com/community/plugin/814117528089546244/thumbnail"}
