{"id":"1106149925344406131","name":"Social Media Monitoring","lastUpdateDate":"2022-05-11T09:24:53.626Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856356975/2c01f729-f218-4128-9180-82576ce15714-cover.png","description":"<p>Compute the value of a brand or company.</p><p><br></p><h2><strong>Summary</strong></h2><p>By analyzing the social channels of a company or brand, it is possible to infer its popularity and success. Social channels include not only Instagram, Facebook, Twitter, YouTube, etc., but also information about this brand or company on websites, wikis, blogs, and other forums as well as messaging platforms. What are the metrics of the volume of channels? What is the overall sentiment, influence, engagement, or reach?</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>For analysis,&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/kpi-tracking\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>a specific goal should always be defined</strong></a>. The understanding of this goal should be communicated within a team. What does the team want to achieve for the company or brand through the use of social media? Draw attention to their service or something else?</li><li>Monitor your company's or brand channels to find out how it is perceived by the public. Find out which channels are performing particularly well, or particularly poorly. Which channel would you like to use to reach more people? How many brand mentions can be found, e.g. hashtags, name of company or brand? It can help to compare the results of monitoring with other companies or brands from time to time.</li><li>By regularly checking social media monitoring, successful and less successful platforms can be identified and subsequent action can be taken. A few tools are helping to track and analyze your socials, e.g.&nbsp;<a href=\"https://brand24.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Brand24</strong></a>.</li><li>Make decisions about what to do with the data you collect. What recommendations for action can you formulate that might improve future monitoring results? Are there irrelevant results that can be filtered to avoid time-consuming evaluation (e.g. by excluding keywords, muting authors, or blocking domains)? In contrast, are there any particularly interesting or important findings? Mark them to find them again later in the process.</li></ol>","url":"https://www.figma.com/community/file/1106149925344406131"}
