{"id":"1120647909994228894","name":"Planning Template","lastUpdateDate":"2022-06-20T09:34:42.476Z","publisherHandle":"jcky","publisherImage":"https://s3-alpha.figma.com/profile/9c96f5a7-99a0-44f9-89c3-04ec94f315a5","publisherId":"861926824447159000","publisherName":"Jacky Chung","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/2004833027/ab4e63e9-e374-4e35-a7b6-74fa2acdfbd8-cover.png","description":"<p>This is a template for a planning document used by the product team at Bird Eats Bug for quickly communicating what's important alongside our issue trackers (e.g. Jira, Linear etc.)</p><p><br></p><p><strong>This planning doc serves 2 main purposes:</strong></p><p><br></p><p><em>For the team:</em> very quickly see a high level overview of what the team is working on, what’s been done recently, what’s been prioritised/deprioritised, what’s new. By making all this information super digestible, the team is more aligned and also more equipped to give feedback on a plan.</p><p><em>For the managers:</em> quickly see where we’re deploying our resources, are the pieces we’re working on lining up with higher level goals? Are certain items taking too long? Is our team spread too thinly on too many big items?</p><p><br></p><p><strong>Why have a doc like this? Don’t we have all this info in our issue trackers?</strong></p><p><br></p><p>Yes and no...issue trackers are too granular (as they should be...) so while it’s fine for the PMs, since it’s our job to review these, it’s not great for everyone else. Which means, in reality, most people don’t bother unless you force them to sit through a long sprint planning meeting to go through all of it - but you can’t do this with everyone in the organisation!</p><p><br></p><p>So we designed this planning doc to be a higher level, more digestible part of planning. It’s not just for communicating with your team though, it’s also useful for PMs to plan at a strategic level, and then translate this plan into more granular tickets.</p><p><br></p><p><strong>Remarks</strong></p><p><br></p><p>We’re also iterating on our processes, we know this is far from perfect, but we’ve already found it invaluable on quickly communicating with our remote team the status of things, and what matters, and we hope you'll find it useful too. If you have any feedback/suggestions on the process, feel free to message me on jacky@birdeatsbug.com, <a href=\"https://birdeatsbug.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">birdeatsbug.com</a></p>","url":"https://www.figma.com/community/file/1120647909994228894"}
