{"id":"1020079203222518115","name":"Untitled UI – FREE version","lastUpdateDate":"2021-10-19T21:07:02.458Z","publisherHandle":"designer","publisherImage":"https://s3-alpha.figma.com/profile/910a809b-359c-4c9f-9a82-febd85377bbe","publisherId":"1339065","publisherName":"Jordan Hughes","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1221082716/9831a0b6-c75a-4354-9f24-ecd426433077-cover.png","description":"<p>Untitled UI is the largest Figma UI kit and design system in the world. Kickstart any project, save thousands of hours, and level up as a designer.</p><p><br></p><p>✨ Learn more and preview the full version at <a href=\"https://www.untitledui.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">untitledui.com</a> ✨</p><p><br></p><h2>Save thousands of design hours</h2><p><br></p><p>Tired of wasting thousands of hours starting from scratch on every project and rebuilding the same components? Untitled UI comes packed full with everything you need to design modern and beautiful UI and websites.</p><p><br></p><p><strong>350+ global styles</strong></p><ul><li>Smart, scalable typography system for any project</li><li>HUGE practical and accessible color system</li></ul><p><br></p><p><strong>10,000+ components and variants</strong></p><ul><li>Meticulously crafted with 100% Auto Layout 3.0 and smart variants</li><li>We’ve thought of everything you need so you don’t have to – the largest and best Figma UI kit in the world today</li></ul><p><br></p><p><strong>420+ ready-to-go desktop and mobile page examples</strong></p><ul><li>Key focus on examples you'll&nbsp;<strong>actually use in real projects</strong>&nbsp;- landing pages, common pages, dashboard, and settings pages</li><li>Mix-and-match sections and variants to design websites and dashboards in minutes</li></ul><p><br></p><h2>Become a better designer</h2><p><br></p><p>Are you ready to level up your design workflow? We want to help you complete projects 10x faster, take on more clients, and free up your time to work on more important things. Untitled UI has everything you need.</p><p><br></p><p>Every component is meticulously crafted with 100% Auto Layout 3.0, super-smart variants, and with accessibility in mind. Swap out variants in seconds, like magic.&nbsp;We’ve thought of everything so you can start designing right away.</p><p><br></p><h2>Why we created Untitled UI</h2><p><br></p><p>This project started out of necessity. We tried a bunch of Figma UI kits, but found they lacked in size, flexibility, or quality — usually all three — and we ended up having to remake all the poor-quality components.</p><p><br></p><p>We needed an “ultimate starter” kit for new freelance projects and design systems, rather than having to start from scratch each time. We were sick of rebuilding the same common components over and over again... which is not only a waste of time, but the most boring part of the design process.</p><p><br></p><p>Untitled UI was built to solve this. We’ve thought of everything you need to design modern and beautiful UI and websites and have wrapped it into one neatly organized package.</p><p><br></p><p>You can use this UI kit in unlimited projects. In fact, we designed it this way — to be as neutral, flexible, and scalable as possible to use as a kick-starter for any project.</p>","url":"https://www.figma.com/community/file/1020079203222518115"}
