{"id":"1061521584203314912","name":"Technosters (Week - 01 , Day - 02)","lastUpdateDate":"2022-01-08T05:47:47.903Z","publisherHandle":"abhisheksingh","publisherImage":"https://s3-alpha.figma.com/profile/b78d0fec-69e8-4207-aad0-be2955fe7eca","publisherId":"2573518","publisherName":"Abhishek singh","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1438704105/b9a7b0f7-8563-414c-bea7-7a10f6471ba5-cover.png","description":"<h2>Technosters&nbsp;<strong>About us:</strong></h2><p><br></p><p>Welcome to the Technosters (OPC) Pvt. Ltd. Technosters is one of the fastest growing companies in the field of IT Training, Software &amp; Web Development. It is developed by professionals in the IT industry and the faculty is multi-domain expertise.</p><p>The management and teaching staff of TECHNOSTERS' comprises either IT experts or IT sector experience holders. All of them in their respective fields are highly experienced in designing / developing software solutions. Our team of highly expert professionals are dedicated to aware the trainee with latest technology and hence fill the gap between academic curriculum and Real IT Industry demands. We provide training in Digital Marketing, AWDP (Advance Web Development Program), PHP, Angular, Java Script, Wordpress, Bootstrap, MYSQL, Android, C/C++ and other latest Technologies. Training sessions are presented by (RTIE) Real Time Industry Experts. All the concepts will be taught with realtime examples and in an easily understandable way.</p><p>'TECHNOSTERS' preparation is not just like regular sessions in the classroom. The preparation is primarily industry-oriented and focused towards interviews. Trainees will have the confidence during the initial days of training themselves that they can get through any tough interview or any difficult project. We're going to walk you through live projects instead of picking books in order to provide you with a better understanding of the concepts of digital marketing. Digital Marketing Training Course Designed by us is for all be it Entrepreneurs, Job Seekers or Professionals. All our trainers will be certified by Google and Facebook. After the course completion, you can start working as a freelancer or work in a Digital marketing agency. We make sure marketers know the digital tools and use them in the best possible way to achieve the right target market with lower acquisition costs.</p><p><br></p><h2><strong>Our Mission&nbsp;</strong>&amp;&nbsp;<strong>Vision</strong></h2><p><br></p><h2>Mission</h2><p>To deliver Digital Marketing Solutions with the help of pure innovation which will hence result in revenue generation that keeps on increasing month after month. Our passion combined with our ethics help us in achieving that goal and lets us remain ahead of our competitors. Respecting our clients and their requirements is one of our key aspects and therefore with this changing era we make sure that no client returns empty handed.</p><h2>Vision</h2><ul><li>Assist customers with making significant associations with their audience and assemble better brands through associated digital connections.</li><li>Be known for our trained methodology towards giving the most elevated satisfaction and return on investment to both our customers and clients.</li><li>Create a tailored-fit solution for customers based on our deep expertise and profound understanding of client’s business domain areas and requirements.</li><li>Provide quality solutions to our clients with the help of innovation.</li><li>Help simplify the relationship between website and search engine.</li></ul>","url":"https://www.figma.com/community/file/1061521584203314912"}
