{"id":"1032187230732819318","name":"UXfolio Case Study Template","lastUpdateDate":"2021-12-10T01:46:29.382Z","publisherHandle":"randy_hembrador","publisherImage":"https://www.gravatar.com/avatar/5abfc42a0cc796449fd9df8425cd0f5e?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_r_v2.png","publisherId":"273688","publisherName":"Randy Hembrador","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1370079184/ee567a83-018f-4558-84d9-87e380f8087a-cover.png","description":"<p>Design your case studies with both the specialized structure of UXfolio and the fluidity of Figma at your disposal.</p><p><br></p><p>This template recreates UXfolio’s layouts &amp; customization options so you can experiment with them rapidly in Figma, then easily recreate final designs on <a href=\"https://uxfol.io/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">uxfol.io</a> for full publication.</p><p><br></p><p>By first drafting in Figma, you specifically gain access to the following functionality currently not available on the UXfolio site:</p><ul><li>Using zoom to get a bird’s eye view of your full case study</li><li>Placing screencaps of other case studies next to yours for reference</li><li>An extensive undo history and version control</li><li>Dragging content sections up and down in real-time to reorganize your document</li><li>Toggling the visibility of content sections without deleting them</li><li>Adjusting image fill &amp; cropping within the context of your document</li></ul><p><br></p><p>In addition to these Figma features, this template also provides:</p><ul><li>Text-based placeholders for jotting down image ideas</li><li>A “Draft” effect to help distinguish draft vs final sections</li><li>The ability to export adjusted images as final assets for UXfolio</li><li>A component that lets you cycle through multiple reference case studies next to your draft</li><li>Tips and walkthroughs to help with Auto Layout and Variant reliant features</li></ul><p><br></p><p>Hope you're able to get some use and enjoyment from this template!</p>","url":"https://www.figma.com/community/file/1032187230732819318"}
