{"id":"1032187230732819318","name":"UXfolio Case Study Template","lastUpdateDate":"2021-12-16T02:29:28.699Z","publisherHandle":"randy_hembrador","publisherImage":"https://www.gravatar.com/avatar/5abfc42a0cc796449fd9df8425cd0f5e?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_r_v2.png","publisherId":"273688","publisherName":"Randy Hembrador","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1387851523/72471d19-3cb0-4bd6-bb0e-9e8ed317523d-cover.png","description":"<p>Design your case studies with both the specialized structure of UXfolio and the fluidity of Figma at your disposal.</p><p><br></p><p>This template emulates UXfolio’s WYSIWYG editor within Figma via Auto layouts &amp; Variants so you can experiment with your document structure more flexibly, then recreate your final design on <a href=\"https://uxfol.io/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">uxfol.io</a> for full publication.</p><p><br></p><p>By first drafting in Figma, you gain access to certain functionality currently not available on the UXfolio site, including:</p><ul><li>Access to zoom for a bird’s eye view of your full document</li><li>Including screencaps of other case studies next to yours as references on length and structure</li><li>An extensive undo history and version control</li><li>Reorganizing content sections by directly dragging them up and down in the document</li><li>Creating multiple versions of a section, then toggling their visibility without deleting them</li><li>Adjusting the fill &amp; cropping of your images within the context of your document (+the ability to convert adjusted images into assets for UXfolio via Figma's Export panel)</li></ul><p><br></p><p>In addition to these Figma features, this template also provides:</p><ul><li>Text-based placeholders for jotting down image ideas</li><li>A “Draft” effect to help distinguish draft vs final sections</li><li>A component that lets you cycle through multiple reference case studies next to your draft</li><li>Tips and walkthroughs to help with Auto Layout and Variant reliant features</li></ul><p><br></p><p>Hope you're able to get some use and enjoyment from this template!</p><p><br></p><p>December 16 updates:</p><ul><li>Overhauled variants structure so that options now directly mirror UXfolio's</li><li>Overhauled nesting to reduce clicking and extraneous layers</li><li>Fixes to Auto layout bugs</li><li>Simpler custom templates for images and reference case studies</li><li>Improvements to the template instructions</li></ul>","url":"https://www.figma.com/community/file/1032187230732819318"}
