{"id":"1032187230732819318","name":"UXFolio Case Study Template (Beta)","lastUpdateDate":"2021-10-25T18:36:34.127Z","publisherHandle":"randy_hembrador","publisherImage":"https://www.gravatar.com/avatar/5abfc42a0cc796449fd9df8425cd0f5e?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_r_v2.png","publisherId":"273688","publisherName":"Randy Hembrador","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1236770183/5fad171d-8293-4916-9733-7cfafce8f9a2-cover.png","description":"<p>Draft, organize, and experiment with your document’s structure more rapidly in Figma before pubslihing final work to UXFolio.</p><p><br></p><p>This template allows you to leverage certain Figma functionality that currently isn’t available directly on UXFolio, including the ability to:</p><ul><li>Zoom out to see your entire document</li><li>Paste screencaps of other case studies next to your draft as reference points</li><li>Drag content sections up and down in real time</li><li>Quickly undo and redo changes to layout and content order</li></ul><p><br></p><p>Other features include:</p><ul><li>Ability to apply different layout selections to content without recreating it</li><li>Image placeholders you can write ideas into to help maintain your writing flow</li><li>Ability to optimize image size and cropping based on your layout choices</li><li>A “Draft” effect to help track draft vs final content</li></ul><p><br></p><p>The template uses Auto Layout &amp; Variants to accurately recreate UXFolio’s layouts &amp; customization options (and also includes short instructions) so you can rapidly experiment with your document structure without worrying about feasibility on the actual site.</p><p><br></p><p><em>*This template is still a work in progress - if you encounter bugs, potential areas for improvement, or anything that specifically made you say \"no thanks!\" and move on, I'd love to hear about them in the comments!</em></p>","url":"https://www.figma.com/community/file/1032187230732819318"}
