{"id":"1032187230732819318","name":"UXFolio Case Study Template","lastUpdateDate":"2021-11-24T00:41:01.640Z","publisherHandle":"randy_hembrador","publisherImage":"https://www.gravatar.com/avatar/5abfc42a0cc796449fd9df8425cd0f5e?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_r_v2.png","publisherId":"273688","publisherName":"Randy Hembrador","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1321157661/cb58be89-dcec-4117-891e-b71e69d28fc6-cover.png","description":"<p>Draft, organize, and experiment with your document’s structure more rapidly in Figma before publishing final work to UXFolio.</p><p><br></p><p>This template allows you to quickly drag around UXFolio layouts like building blocks and use certain native Figma functionality not currently available directly on the UXFolio site, including...</p><ul><li>Zooming out to see your entire document</li><li>Including screencaps of other case studies next to your draft as reference points</li><li>Quickly undoing and redoing changes to layout and content order</li><li>Trying out different layout selections without losing your draft content</li></ul><p><br></p><p>Other features in this template include the ability to...</p><ul><li>Re-order content by dragging sections directly up and down in the document</li><li>Use text-based placeholders in image frames to jot down content ideas</li><li>Apply a “Draft” effect to distinguish between draft vs final content</li><li>Adjust sizing and cropping for image content (or create new content in context) that can be exported as assets for the site</li></ul><p><br></p><p>The template uses Auto Layout &amp; Variants to accurately recreate UXFolio’s layouts &amp; customization options so you can rapidly experiment without worrying about feasibility on the actual site.</p><p><br></p><p>In this latest update, you can now paste images directly into the layout templates! I've also fixed some Variant bugs, tried to make instructional text appear in smaller more context-sensitive chunks, and incorporated a slew of other improvements based on feedback!</p>","url":"https://www.figma.com/community/file/1032187230732819318"}
