{"id":"738264841927149297","name":"Coda for Figma","lastUpdateDate":"2021-07-23T21:22:37.800Z","publisherHandle":"carlo","publisherImage":"https://s3-alpha.figma.com/profile/aaabe887-93bc-49f7-a11f-c828cb306b32","publisherId":"1688149","publisherName":"Carlo Jörges","description":"<p>Design with data from apps like Spotify, Wikipedia or your own custom data with this plugin. This plugin works with Coda, a tool for making documents. Simply create a table in Coda, and use the plugin to fill your designs with content from the tables.</p><p><br></p><p>→ To use this plugin</p><p>1. Create a Coda doc with a table in it, or use the example doc that's provided. The example doc already has data for you to get started with.</p><p>2. Fill individual layers by selecting the layer you want to change, and then select the relevant column in the plugin selector.</p><p>3. Group layers, or create a component, to keep related info together.</p><p>4. Select an entire frame or multiple groups to update all of the layers at once.</p><p><br></p><p>→ Live Data</p><p>To pull live data into your Figma designs, create a Packs Table in Coda. Using Packs you can pull in data from Wikipedia, Spotify, Intercom and more. Once you've set up your table, you can connect your design to that table and watch it fill up with real data.</p><p><br></p><p>→ Custom Data</p><p>To pull custom data into your Figma docs, create a Table in Coda. You can enter text, image URLs, formulas, and more. Then, connect your layers to that table, and watch your designs fill up with your own data.</p><p><br></p><p>See more info here: <a href=\"https://coda.io/d/Example-data-doc_dFOHtXx4pnz\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://coda.io/d/Example-data-doc_dFOHtXx4pnz</a></p>","url":"https://www.figma.com/community/plugin/738264841927149297","iconUrl":"https://www.figma.com/community/plugin/738264841927149297/icon","thumbnailUrl":"https://www.figma.com/community/plugin/738264841927149297/thumbnail"}
