{"id":"743170618365358883","name":"Masker","lastUpdateDate":"2019-09-26T18:32:39.652Z","publisherHandle":"1006","publisherImage":"https://www.gravatar.com/avatar/1ad71cdb2decf2f414a2d4ff1e14d9b2?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_v_v2.png","publisherId":"1006","publisherName":"Vyacheslav Myskov","description":"Masker allows you to easily overlay devices on selected layers in your project.  First, select one or more layers in your design file, then choose from the Masker palette to apply.\nWe recommend that you select layers that match the actual size of the device. The best way to do this is with the devices built into Figma.\n\nChoose from the following: \n— Iphone X\n— Iphone 8 Plus\n— Iphone 8\n— Google Pixel 2\n— Google Pixel 2 XL\n\nHow to use Masker. \n— For single layer selection: Select a layer in the project, then choose from the Maker palette to apply. If you have done everything correctly, the plugin will automatically select the device by size, if not, it will give you this choice.\n— For multiple selections with a layer: select multiple layers in the project, then choose from the Maker palette to apply. If you have done everything correctly, the plugin will automatically calculate the number of selected layers and select the device by size, if not, then give you the choice.\n— For select without a layer: open the Masker from the palette, and then select the desired device and the number of items. \nMinimum possible number: 1.\nMaximum possible number: 49.\nThe maximum limit is made to optimize Figma's performance. Please contact us if you need a larger limit 🙂\n\nIMPORTANT: When selecting a layer, make sure it does not have a device mask. Otherwise, an error will be displayed.\n\nIdeas for the next version: \n— Possibility of filling the screen with color and background selection from the gallery.\n— New devices such as watches, laptops, and desktops.\n— Automatic mask matching for different layers. \n\nAny other ideas? Send them to us at dudeinhoodie@gmail.com","url":"https://www.figma.com/community/plugin/743170618365358883","iconUrl":"https://www.figma.com/community/plugin/743170618365358883/icon","thumbnailUrl":"https://www.figma.com/community/plugin/743170618365358883/thumbnail"}
