{"id":"1028761915982516982","name":"Resize Frame to Contents","lastUpdateDate":"2022-01-20T19:31:21.967Z","publisherHandle":"rui_p_cabrinha","publisherImage":"https://s3-alpha.figma.com/profile/133f156b-5c2b-4bff-b5c9-980973615fe7","publisherId":"1001403","publisherName":"Rui P. Cabrinha","description":"<p>Resize to fit the selected edge(s) to the content of Frames, or Main Components; or adjust the padding of Auto Layout frames, or Main Components.</p><p><br></p><h2><strong>How to use Resize Frame to Contents ❓</strong></h2><ol><li>Select one or more frames;</li><li>Run plugin;</li><li>The plugin will automatically filter the selection for Frames and Main Components;</li><li>If the Frame, or Main Component, has Auto Layout the plugin will update the padding value for the selected edge(s).</li><li>If not, the plugin will adjust the Frame, or Main Component, to fit its content in the selected edge(s). Note that Shadows, Outside Strokes, and other effects count as part of the contents.</li></ol><p><br></p><h2><strong>Use Cases 🔨</strong></h2><ul><li>Adjusting one or more Frames, or Main Components, to their contents;</li><li>Make sure an icon pack has consistent padding;</li><li>Make sure all app screens have consistent spacing around the contents;</li><li>Anything else you find it useful for!</li></ul><p><br></p><h2><strong>In Detail 🔎</strong></h2><ul><li>Any type of layers can be selected, the plugin will then look for Frames or Main Components within that selection;</li><li>A Main Component will have its Auto Layout padding value updated, an Instance will not;</li><li>The operation time will increase if a large amount of Frames or Main Components is selected;</li><li>The plugin will measure the success of the operation by showing how many frames had their dimensions or Auto Layout padding changed.</li></ul><p><br></p><p>❤ Trim Frame? <a href=\"https://www.buymeacoffee.com/ruipcabrinha\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Buy me a coffee</a>!</p>","url":"https://www.figma.com/community/plugin/1028761915982516982","iconUrl":"https://www.figma.com/community/plugin/1028761915982516982/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1028761915982516982/thumbnail"}
