{"id":"1009741687635558607","name":"Rotato 3D Mockups + Explosions","lastUpdateDate":"2022-01-14T13:35:44.287Z","publisherHandle":"rotato","publisherImage":"https://s3-alpha.figma.com/profile/c1910fe5-d5b3-4d61-bc5c-88f1b9b44b9c","publisherId":"1058496985069957631","publisherName":"Rotato","description":"<p>Wrap any Figma frame in a 4K ultra-realistic 3D mockup device frames for the perfect showcase in your slide decks, landing pages and portfolio. Or, grab screenshots directly from your iPhone via a USB cable. Without leaving Figma.</p><p><br></p><p>Exclusively for macOS, Rotato uses its own renderer based on Apple Metal, optimized for both M1 and Intel.</p><p><br></p><p>Rotato for Mac, version 125 required. <a href=\"https://rotato.app/download\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Download free.</a></p><p><br></p><h2>Stand out with 3D mockups right in Figma</h2><p>Click anywhere in a frame and then “Render” in the plugin. The plugin matches your design with a mockup so your iPhone designs are wrapped in an iPhone device frame—or you can choose your own. You can now drag and drop the rendered 4K image onto your page in Figma. Click “Adjust in Rotato” to adjust the phone’s color, rotation, clay mode, shadows, and even animate and export as a video with a solid or transparent background.</p><p><br></p><h2>Bring it home with hypnotic layer explosions</h2><p>Explode all the layers of your design in a 3D explosion for an effect that highlights the detail of your design in an impossible-to-look-away showcase of your app design.</p><p>Simply check the “Explode layers” checkbox when you render your design. You can adjust and animate the explosions by continuing in Rotato.</p><p><br></p><h2>Instant snapshots from your iPhone</h2><p>Got a design on your iPhone you want to showcase? Connect your phone and Mac with a charging cable and click your iPhone’s name in the plugin’s top menu. You can now transfer screenshots—and even wrap them in 3D mockups in one, single little click.</p><p><br></p><h2>Choose between 30+ scenes and always expanding</h2><p>Rotato comes with iPhones, Samsung and Pixel Androids, iPads, Apple Watches, Macbook and surface laptops, and subtle, generic devices so you always have the perfect backdrop for your hard design work.</p>","url":"https://www.figma.com/community/plugin/1009741687635558607","iconUrl":"https://www.figma.com/community/plugin/1009741687635558607/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1009741687635558607/thumbnail"}
