{"id":"735442706723922553","name":"Blend","lastUpdateDate":"2019-10-23T15:04:03.415Z","publisherHandle":"g","publisherImage":"https://s3-alpha.figma.com/profile/3d457903-1cb1-4308-9137-03b1a8fb2c66","publisherId":"328","publisherName":"Gleb","description":"<p>Blend plugin allows you to copy any object along the path.</p><p><br></p><p><strong>How it works </strong></p><ol><li>Select an object you want to clone, then select the path and the Blend Group will be created (it's a regular group but it stores useful data about the blend so it's not recommended to ungroup it).</li><li>Change the number of copies or the distance that you want to keep between them to make the composition fit your needs.</li><li>While the plugin is open you can also edit the blend path and you will see changes in real time.</li></ol><p><br></p><p>★ Check out the design &amp; development process of this plugin on Behance: <a href=\"https://www.behance.net/gallery/83421531/Blend-Plugin-for-Figma-Creation-Process\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://www.behance.net/gallery/83421531/Blend-Plugin-for-Figma-Creation-Process</a></p><p><br></p><p><strong>Features</strong></p><ul><li>You can click on layers to select them, they will also reflect which layer is currently selected on the canvas.</li><li>Replace blend path or object by clicking the pencil icon near them and selecting the object you want to change it to.</li><li>Click the Remove Blend button to quickly remove all copies and keep your original object and path.</li></ul><p><br></p><p><strong>Tips</strong></p><ul><li>Use an instance of a component as the main object to be able to easily change its properties.</li><li>Select an object and a path when opening the plugin and it may be able to automatically detect them and create the Blend Group.</li><li>Select an existing blend group when opening the plugin to edit it instead of creating a new one.</li></ul><p><br></p><p><strong>Known issues</strong></p><ul><li>If you edited the node you are copying, change the number of steps to update the copies.</li><li>If you use Cmd + Z it may break the blend and you will have to manually remove copies, reselect the missing object or restart the plugin.</li><li>You cannot use anything other than a simple vector object as a path. If you want to use a shape like an ellipse, flatten it first (Right-click -&gt; Flatten).</li></ul>","url":"https://www.figma.com/community/plugin/735442706723922553","iconUrl":"https://www.figma.com/community/plugin/735442706723922553/icon","thumbnailUrl":"https://www.figma.com/community/plugin/735442706723922553/thumbnail"}
