{"id":"1106150216329093748","name":"Walt Disney Method","lastUpdateDate":"2022-05-11T09:26:03.002Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856356683/dfdbc207-a090-4927-8763-02b578d5316a-cover.png","description":"<p>Brainstorm from three different perspectives to elaborate ideas.</p><p><br></p><h2><strong>Summary</strong></h2><p>Walt Disney is known worldwide for his creative life's work. The way Walt Disney developed creative and innovative ideas is described in the Walt Disney Method. The team takes on three&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/six-thinking-hats\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>different perspectives</strong></a>. Those of the dreamer, the realist or maker, and the critic. The goal is to try to solve the problem at hand through three different approaches.</p><ol><li><strong>Dreamer:</strong>&nbsp;Doesn't think anything is impossible, thinks visionary instead.</li><li><strong>Realist/Maker:</strong>&nbsp;Doesn't think too much but immediately starts to work, one step at a time.</li><li><strong>Critic:</strong>&nbsp;Questions everything and looks for contradictions, as well as things that may come to pass in the future.</li></ol><p>The team either moves through all three perspectives together, one at a time, or splits between the perspectives so that a discussion between different parties can occur.</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>The Walt Disney Method begins from the dreamer's perspective. In this phase, the goal is to block out what is (technically) actually possible or generally realistic. All&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/crazy-eights\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>crazy ideas</strong></a>&nbsp;are allowed and should in no case be hindered by possible risks.</li><li>Once some ideas have been found and expanded from the perspective of the dreamer, it is possible to switch to the next perspective. The realist/maker is in direct contrast with the Dreamer's views. In this phase, the team considers which ideas are useful or enriching. What materials would be needed for implementation or what challenges an idea or concept might entail?</li><li>The critic represents the third and final perspective taken by the team. Here, the previously developed approaches of the realist are criticized or questioned. Does the idea or concept have risks or gaps? What needs to be improved?</li><li>The process of going through the three perspectives is repeated until no more questions remain with the critic. The Walt Disney Method is best done as a team to bring in different ways of thinking, but can also be done as an individual.</li></ol>","url":"https://www.figma.com/community/file/1106150216329093748"}
