{"id":"1014351715209805744","name":"Auto Number","lastUpdateDate":"2022-01-07T13:46:33.356Z","publisherHandle":"SydLiu","publisherImage":"https://s3-alpha.figma.com/profile/dea16e51-2018-48ff-bccf-1d6b885effe5","publisherId":"867938628917123243","publisherName":"刘松迪","description":"<p><strong>Automatically mark width and height in Figma.</strong></p><p><br></p><p><a href=\"https://youtu.be/QHpHNIqSWYo\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Function demonstration video.</a></p><p><br></p><p>Using this plug-in, you can do interactive measurement effects in your Figma documents, directly label the width and height, you only need to follow the steps below:</p><p><br></p><p>1. Create a new text node with any content text.</p><p><br></p><p>2. Input the text node in a frame.</p><p><br></p><p>3. Select the text node in the frame and turn on the [Node under control] switch in the plugin panel. At this time, the content of the text node will be replaced with the width number of the outer frame.</p><p><br></p><p>4. Adjust the measurement settings you need, click [Apply all] button, then the plug-in settings will be applied to all nodes in the document that are set to [Node under control].</p><p><br></p><p>5. Add auto layout and label lines in your frame, and then adjust the frame width, you can achieve the effect of the demo video.</p><p><br></p><p>6. If you just need the prefix of the label and want to switch the width and height of the text, just rotate the outer frame.</p><p><br></p><p>Notice:</p><p><br></p><p>1. The plug-in can only recognize the width of the container frame. To mark the height, please refer to the demo video.</p><p><br></p><p>2. After optimization, when adjusting the size of a single label, there will be no stalls, but if there are many annotations in the document, such as hundreds of them, there may be a short stall when clicking [Apply all] button.</p><p><br></p><p>3. You can directly copy the finished label and reset its width, just like the demo video.</p><p><br></p><p>3. The plugin will automatically recognize your font.</p><p><br></p><p>4. You need to keep the plugin turned on to use the functions.</p><p><br></p><p>5. After closing the plug-in, the set options will not be retained. If you need to retain the setting function, please feedback in the comment area.</p><p><br></p><p><strong>在figma内自动标注宽高</strong></p><p><br></p><p>使用本插件，你可以在你的figma文档中实现交互式标注效果，直接标注宽高，你只需要按以下步骤进行操作：</p><p><br></p><p>1.新建一个文本节点，内容文字任意</p><p><br></p><p>2.把文本节点装在一个frame里</p><p><br></p><p>3.选中frame里的那个文本节点，打开插件中的【是否受插件控制】开关，此时文本节点的内容会被替换为外层frame的宽度</p><p><br></p><p>4.调整你需要的标注设置，点击【应用全部】，此时插件设置会应用到文档里全部设置了【是否受插件控制】的节点上</p><p><br></p><p>5.给你的frame添加自动布局和标注线，再调整frame宽度时，就可实现演示视频的效果</p><p><br></p><p>6.如果你恰好需要标注的前缀，想要切换宽高的文字，旋转标注frame就可以了</p><p><br></p><p>注意：</p><p><br></p><p>1.插件只能识别容器frame的宽度，要标注高度可以参考演示视频</p><p><br></p><p>2.经过优化，在调整单个标注的大小时，不会出现卡顿，但如果文档中有很多标注，比如几百个，点击【应用全部】时可能会出现短暂卡顿</p><p><br></p><p>3.可以直接复制做好的标注并重新设置其宽度，就像演示的那样</p><p><br></p><p>3.插件会自动识别你的字体</p><p><br></p><p>4.你需要保持插件开启才可以使用功能</p><p><br></p><p>5.关闭插件后，设置好的选项不会保留，如果你们需要保留设置功能请在评论区反馈</p>","url":"https://www.figma.com/community/plugin/1014351715209805744","iconUrl":"https://www.figma.com/community/plugin/1014351715209805744/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1014351715209805744/thumbnail"}
