{"id":"1078333497483884238","name":"Figma's Trending and most powerful UI Kit and Design System.","lastUpdateDate":"2022-02-23T15:31:31.707Z","publisherHandle":"uitrend","publisherImage":"https://s3-alpha.figma.com/profile/2ddf589d-6d39-4d90-b831-e32895dce19b","publisherId":"1077614444054810239","publisherName":"UI Trend","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1586978247/e7606ac2-e363-49cd-a8dd-ed0e0cb7be29-cover.png","description":"<p>UI Trend is the largest Figma UI kit and design system in the world. Kickstart any project, save thousands of hours, and level up as a designer.</p><p><br></p><p>✨ Learn more and preview the full version at <a href=\"https://uitrend.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">uitrend.com</a> ✨</p><h2>Say hello to....</h2><p><br></p><p><strong>🎨400+ global styles</strong></p><p>Huge collection of colour, gradients, typography, grid, shadows, and blur styles.</p><p><strong>🗂 3000+ media resources</strong></p><p>A huge collection of pixel-perfect icons, avatars. logos, brands, vector shapes, device mockups, badges, payment icons, and much more!</p><p><strong>💎 11000+ components &amp; variants</strong></p><p>Includes every component for designing marketing websites to complex web-apps. Utilizing the power of master and style components! Oh did I mention, they're 100% Autolayout 3.0 powered as well.</p><p><strong>💻 500+ templates</strong></p><p>Custom designed web templates that you can use right out of the box.</p><p><br></p><h2><strong>Our mission</strong></h2><p>UI Trend is Figma's most powerful and comprehensive UI kit and design system. It has been designed to help you radically speed up your workflow and drastically improve the quality of your UI designs.</p><p>Every detail, in every component has been carefully built with Autolayout 3.0, advanced variants and accessibility in mind. We've done all the hard work for you, so you don't have to!</p><p><br></p><h2><strong>UI Trend is perfect for...</strong></h2><ul><li><strong>Design graduates and junior designers:&nbsp;</strong>Understand how to build the fundamental building blocks to get started in UI design.</li><li><strong>Freelance designers:&nbsp;</strong>Dramatically speed up your workflow and delivery time with perfectly designed components already done for you.</li><li><strong>Senior designers:</strong>&nbsp;Get equipped with the perfect design system that is not bloated with unnecessary components, but just the right amount of fundamentals to set the foundation for every new project.</li><li><strong>Product managers:</strong>&nbsp;Avoid wasting time and get right into the meat of what you want to create with the design system, with everything you need.</li><li><strong>Anyone else that may be working within Figma</strong>. If you don't want to waste time and speed up your entire process, this is what you need.</li></ul><p><br></p><h2>✨Thankyou✨<a href=\"https://uitrend.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">uitrend.com</a></h2>","url":"https://www.figma.com/community/file/1078333497483884238"}
