{"id":"995040358636632267","name":"Tunas Sawa Erma Korindo","lastUpdateDate":"2021-07-08T18:55:08.619Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968331004/ec8f26c6-e015-474b-bcb7-e6db8896cf32-cover.png","description":"<p><strong>Tunas Sawa Erma Group</strong> sebagai perusahaan yang bergerak di bidang perkebunan sawit, sudah beroperasi di wilayah Desa Asiki, Distrik Jair, Kabupaten Boven Digoel, Propinsi Papua sepanjang 22 tahun. Dalam kurun sementara tersebut, Tunas Sawa Erma Group sudah laksanakan upaya - upaya pembangunan penduduk yang berkesinambungan didalam beraneka bidang melalui kesibukan Corporate Social Responsibility (CSR). Pembangunan berikut dikerjakan sesuai dengan filosofi perusahaan untuk membangun pertalian yang harmonis, berfungsi dan berkesinambungan dengan penduduk dan stakeholders demi kemajuan dan kesejahteraan bersama. Dalam menggerakkan kesibukan CSR kita berfokus terhadap program yang strategis, sistematis dan berkesinambungan melalui 5 pilar program utama.</p><p><br></p><p>Tunas Sawa Erma Group merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang bisnis perkebunan dan pengolahan minyak kelapa sawit dengan kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang semuanya bergerak didalam bidang budidaya kelapa sawit dan mengolah minyak sawit mentah (Crude Palm Oil/CPO) dan juga berlokasi di Papua. Sejak th. 1995, Tunas Sawa Erma Group mengawali bisnis kelapa sawit di Papua atas keinginan Pemerintah Daerah. Kondisi infrastruktur sementara itu tetap minim, tapi Tunas Sawa Erma Group sanggup berkembang baik dan juga menjadi pihak pertama yang berkontribusi didalam pembangunan jalur Trans-Papua.</p><p>​</p><p>Sesuai dengan visi dan misi untuk menjadi perusahaan global, Tunas Sawa Erma Group punya komitmen terhadap kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang sudah berjalan dan tertuang secara sadar di web site formal perusahaan. Areal konsesi kita tidak berlokasi di lahan gambut. Selain itu, TSE Group juga menciptakan proses dan lingkungan kerja yang menunjang pengembangan sumber daya manusia melalui program seleksi dan pelatihan dan juga pembangunan berkelanjutan. Saat ini perusahaan juga sudah punya tim Sustainability.</p><p><br></p><p>Kami juga mengapresiasi kontribusi para karyawan yang tetap berkembang dengan perusahaan. Atas dedikasinya, Tunas Sawa Erma Group sudah mempromosikan 70% berasal dari karyawan menjadi karyawan tetap. Kemajuan wanita juga menjadi anggota berasal dari perhatian kami. Sebanyak 20% berasal dari total karyawan adalah perempuan dan kita tetap menunjang untuk meraih potensi terbaik mereka.​</p><p><br></p><p>Tak cuma itu, Tunas Sawa Erma Group Sebagai perusahaan juga tetap merawat pertalian yang serasi dan saling membangun dengan Pemerintah Daerah maupun penduduk setempat, dan juga tetap aktif didalam kesibukan pengembangan ekonomi dan kesejahteraan penduduk Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang sudah beroperasi yakni milik PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.</p><p>&nbsp;</p>","url":"https://www.figma.com/community/file/995040358636632267"}
