{"id":"952002642263288070","name":"Empty State","lastUpdateDate":"2021-05-01T17:57:14.909Z","publisherHandle":"uiguideline","publisherImage":"https://s3-alpha.figma.com/profile/5b40d0a4-57e6-4d59-9a8e-8ae5a85f850d","publisherId":"887463242776663900","publisherName":"UI Guideline","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/824225168/d7e86e01-8be0-4ae1-9620-11211f147788-cover.png","description":"<p><strong>INTRODUCING</strong></p><p><br></p><p>A <strong>Stencil</strong> is a file that provides you an excellent starting point for the creation of your own components in order to avoid errors and anti-patterns.</p><p><br></p><p>Here you’ll find the result of many hours of research, all synthesized on a single file. We went through our <a href=\"https://www.uiguideline.com/reference-systems\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Reference Systems</a>, one by one, gathering all the information about this component's definition and the applied best practices.</p><p><br></p><p><strong>HOW TO USE THIS FILE</strong></p><p><br></p><p>You'll find a ready-to-use component on the <strong>❖ Components</strong> page. Take this component as your <strong><em>base skeleton</em></strong> to design your own component. That's why our focus is not on style. If you are looking for styles or inspiration there are many resources on the internet that do a much better and more detailed job than us.</p><p><br></p><p>If what you're looking for is to learn more in detail about how the component is composed (Anatomy) and what are its Variants (Props), all that information is synthesized on the page <strong>Anatomy</strong> and <strong>Props</strong> respectively.</p><p><br></p><p>We always try to be up to date with the new features that Figma adds over time. If you think that this file is out to date or something is wrong, don't hesitate to contact us, we'll solve it immediately.</p><p><br></p><p><a href=\"https://www.uiguideline.com/components/alert\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">See more information about this component →</a></p><p><br></p><p>---</p><p><br></p><p>⚠️ <strong>TRADEMARK</strong></p><p><br></p><p>This file includes material that may be protected as a trademark in some jurisdictions. If you want to use it, you have to ensure that you have the legal right to do so and that you do not infringe any trademark rights. The use of these trademarks does not indicate endorsement of the trademark holder by UI Guideline, nor vice versa. See the trademark owner for rules about appropriate use of their trademarks.</p>","url":"https://www.figma.com/community/file/952002642263288070"}
