{"id":"995039300883679434","name":"Tunas Sawa Erma Group","lastUpdateDate":"2021-07-08T18:50:56.408Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968319534/2cb4efdf-2c60-4303-a46f-a371fe764718-cover.png","description":"<p>Tunas Sawa Erma Group sebagai perusahaan yang bergerak di bidang perkebunan sawit, sudah beroperasi di wilayah Desa Asiki, Distrik Jair, Kabupaten Boven Digoel, Propinsi Papua sepanjang 22 tahun. Dalam kurun saat tersebut, Tunas Sawa Erma Group sudah lakukan upaya - upaya pembangunan penduduk yang berkesinambungan di dalam bermacam bidang melalui kegiatan Corporate Social Responsibility (CSR). Pembangunan tersebut dijalankan cocok dengan filosofi perusahaan untuk membangun jalinan yang harmonis, berfungsi dan berkesinambungan dengan penduduk dan stakeholders demi kemajuan dan kesejahteraan bersama. Dalam menggerakkan kegiatan CSR kita berfokus terhadap program yang strategis, sistematis dan berkesinambungan melalui 5 pilar program utama.</p><p><br></p><p>Tunas Sawa Erma Group merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang usaha perkebunan dan pengolahan minyak kelapa sawit dengan kantor pusat di Papua. Tunas Sawa Erma Group terdiri dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang seutuhnya bergerak di dalam bidang budidaya kelapa sawit dan memproses minyak sawit mentah (Crude Palm Oil/CPO) serta berlokasi di Papua. Sejak th. 1995, Tunas Sawa Erma Group mengawali usaha kelapa sawit di Papua atas permohonan Pemerintah Daerah. Kondisi infrastruktur saat itu masih minim, tapi Tunas Sawa Erma Group sanggup berkembang baik dan terhitung jadi pihak pertama yang berkontribusi di dalam pembangunan jalan Trans-Papua.</p><p>​</p><p>Sesuai dengan visi dan misi untuk jadi perusahaan global, Tunas Sawa Erma Group memiliki prinsip terhadap kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang sudah berlangsung dan tertuang secara jelas di website resmi perusahaan. Areal konsesi kita tidak berlokasi di lahan gambut. Selain itu, TSE Group terhitung menciptakan proses dan lingkungan kerja yang menunjang pengembangan sumber kekuatan manusia melalui program seleksi dan pelatihan serta pembangunan berkelanjutan. Saat ini perusahaan terhitung sudah memiliki tim Sustainability.</p><p><br></p><p>Kami terhitung mengapresiasi kontribusi para karyawan yang konsisten berkembang dengan perusahaan. Atas dedikasinya, Tunas Sawa Erma Group sudah mempromosikan 70% dari karyawan jadi karyawan tetap. Kemajuan wanita terhitung jadi bagian dari perhatian kami. Sebanyak 20% dari total karyawan adalah perempuan dan kita konsisten menunjang untuk menggapai potensi paling baik mereka.​</p><p><br></p><p>Tak hanya itu, Tunas Sawa Erma Group Sebagai perusahaan terhitung konsisten menjaga jalinan yang seirama dan saling membangun dengan Pemerintah Daerah maupun penduduk setempat, serta konsisten aktif di dalam kegiatan pengembangan ekonomi dan kesejahteraan penduduk Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang sudah beroperasi yaitu punya PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.</p><p>&nbsp;</p>","url":"https://www.figma.com/community/file/995039300883679434"}
