{"id":"831997833675385869","name":"Radius Design Kit","lastUpdateDate":"2020-04-18T16:58:40.067Z","publisherHandle":"Rangle","publisherImage":"https://s3-alpha.figma.com/profile/5af700a8-f0a5-42b4-8b6e-95ad7da070d3","publisherId":"2036","publisherName":"Rangle","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/301480593/a00c5f45-dbc3-4127-b161-f1c256dea6e3-cover","description":"Radius is a collection of open-source tools and libraries that allow you to accelerate your own design system. The choice of tools, their composition, and a set of foundational components guides you on how to build a constraint-based system. https://rangle.io/radius\n\nWhy Radius?\nBuilding a new design system from scratch isn't easy! Stakeholders are often overwhelmed by decision fatigue  — selecting the framework, libraries, tooling and architecture. Radius takes the guesswork out of building a design system, reducing the risk and effort required to to get started. You can start building today with a high quality, fully tested stack. \n\nIt’s based on seven years of modern customer experience design and development work, including global design systems spanning multiple brands and languages. Radius is also based on establishing design systems with a single brand and language that maximize future agility and the associated market and customer-centricity that brings.\n\nRadius includes:\n\nDesign Kit\nBuilt and maintained in Figma. It includes a set of foundational components and a reference architecture.\n\nComponent Library\nBootstrapped using TSDX, mirrors the Figma components and is built using Typescript, React, Styled System and Styled Components\n\nDocumentation & Sandbox\nStorybook acts as both the developer sandbox and the documentation platform.\n\nTest, Build & Deploy\nChromatic runs visual regression tests, CircleCI runs all other forms of testing and Netlify builds and deploys Storybook as a static site.\n\nInternal Alignment and Confidence\nEarly decisions and alignment are the most important factors in long-term design system success.\n\nGet started: visit https://radius-ds.netlify.app/?path=/docs/foundations-get-started-design--page to access the component library and the getting started guide.\n\nHave a question? Email info@rangle.io","url":"https://www.figma.com/community/file/831997833675385869"}
