{"id":"965825767811358609","name":"Zelda BOTW UI Kit","lastUpdateDate":"2021-04-19T04:06:47.320Z","publisherHandle":"hparamore","publisherImage":"https://s3-alpha.figma.com/profile/b6443f22-3269-405c-ba9f-3a120bbaf9f0","publisherId":"126625","publisherName":"Hunter Paramore","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/796250809/a9055e1d-4ee7-4819-a982-244ae7e7b45f-cover.png","description":"<h1>Introduction</h1><p>Ever since Breath of the Wild was first released I have wanted to do a project centered around its user interface.</p><p>From the subtle animations that help guide the user to understand what is happening, to the intricate, yet simple menu systems, there is a lot more under the hood than I first expected.</p><p>I can now say for certain that a staggering amount of work went into the creation of the User Interface, and it shows everywhere when you begin look closer.</p><p><br></p><h1>UI Challenge</h1><p>In an effort to sharpen my user interface design skills, I challenged myself to build<strong> the entire user interface </strong>of Zelda: Breath of the Wild.</p><p><br></p><p><em>This Figma UI Kit is the result!</em></p><p>Also, it’s not just a dumb pixel copy... All of the components are built using Figma’s scaling and responsive tools, as well as variants and components. This thing is ready for anything.</p><p><br></p><p><strong>Every single element on these pages</strong>, save for the 3D game screenshots (that I used as backgrounds) and the item spritesheets I created myself for this project.  Every text element, UI piece, and icon were crafted from scratch using <strong>Figma</strong> and<strong> Illustrator.</strong></p><p><br></p><p>This has been a wonderful project, and I have learned a ton about the effort and care that went into crafting this interface.</p><p><br></p><h1>Free To Use</h1><p>This UI kit was primarily a <strong>challenge for myself</strong> to learn about the design of game interfaces.</p><p>I also don’t own the copyright to this game or its assets.</p><p>As strong a believer in open-source projects, I am releasing this<strong> FREE</strong> for anyone to look at, use, and learn from.</p><p>All I ask is that if you use it, please link back to either my Figma profile or to my website <a href=\"http://www.hunterparamore.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">hunterparamore.com</a> with credit/thanks, and comment on the Figma project so I can follow the amazing things that you make.</p><p>I intend to create more of these for several of my other favorite games, including<strong> Satisfactory, Valheim, Apex Legends, and</strong> (*gulp)<strong> Destiny 2.</strong></p><p><br></p><h1>Support Me</h1><p>If you would like to see more of these, communicate directly with me, vote on future projects, or get 1 on 1 help in creating your own UI Kits, please consider supporting me on <a href=\"https://www.patreon.com/KraftHP\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Patreon</a>, or consider <a href=\"https://www.buymeacoffee.com/hparamore\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">buying me a soda.</a></p><p>UI and UX Design is a passion of mine. If you are a company looking to hire a <em>dedicated and experienced UI designer </em>who pays attention to the details, I would love to hear from you.</p>","url":"https://www.figma.com/community/file/965825767811358609"}
