{"id":"817043359134136295","name":"Mockup","lastUpdateDate":"2021-10-22T13:54:30.061Z","publisherHandle":"lsgraphics","publisherImage":"https://s3-alpha.figma.com/profile/dce1d154-c38b-4f4c-a2ef-43d1c2f9a537","publisherId":"141115","publisherName":"ls.graphics","description":"<p>Free, easy-to-use mockup plugin</p><p><br></p><h2>Perspective transformation plugin</h2><p>We have carefully read your comments and thoroughly reworked the plugin.</p><ul><li>Some of you guys asked for bigger previews, so we increased it.</li><li>We also added the Select on canvas function - now you can select a layer on the canvas or in the layers panel, which is much more convenient.</li><li>Previously, if the outgoing picture was more than 4000 pixels, then due to the Figma limitation, the 2x, 3x function might not work. Now, if the outgoing image is more than 4000 pixels, then the plugin will automatically determine the maximum possible resolution and your design will look great</li></ul><p>We tested all sorts of shapes - inverted, with incomplete pixels, with the wrong direction - everything should work, but if the distort does not work in your scene and your mockup – please send us this scene so it will be easier for us to track down what the problem is (info@ls.graphics) and we will fix this issue</p><p><br></p><h2>Mockup Library</h2><p><br></p><p>We also added a big and cool update. At first glance, it seems that this is another plugin with a library of mockups, which are already in the Figma community, but this is not so. Our plugin is very different:</p><ul><li>Our mockups are very high quality. We spend a lot of time and resources to make the highest quality mockups. We work out every detail - the angle, every highlight, and even the direction and smoothness of the shadow.</li><li>Thanks to good optimisation and fast CDN, you can use huge 6k mockups and it will work fast, as fast as Figma allows.</li><li>We keep the entire structure of the mockups. The best practice is when each element in the scene is on a separate layer, each shadow is also separate, and the background can be changed or turned off altogether. This is very important, when you will be using mockups in your design it is important that you can easily integrate it into your design. All layers are clearly named and conveniently structured.</li><li>We initially focused on the plug-in for Figma and did our best to work with mockups as comfortably as possible in Figma and use and supplement all the functions.</li><li>Different colors of devices. Need a gold iPhone for your design this time? No problem, just switch the color in the top bar.</li><li>Select frames from the list of layers or use the Select on Canvas function</li><li>Convenient crop to select the desired aspect ratio for a specific device</li><li>It's free. Of course, we plan to add monetization in the future so that you can develop new mockups and pay for servers, but free mockups will always be available as well.</li><li>We are adding new mockups right now. We will add thousands of mockups shortly.</li></ul>","url":"https://www.figma.com/community/plugin/817043359134136295","iconUrl":"https://www.figma.com/community/plugin/817043359134136295/icon","thumbnailUrl":"https://www.figma.com/community/plugin/817043359134136295/thumbnail"}
