{"id":"1106151778164177529","name":"One-Minute-Pitch","lastUpdateDate":"2022-05-11T09:32:15.351Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1828826291/447c70af-203c-4381-8996-e5ed0ff2f339-cover.png","description":"<p>Break the concept down to the essential core points in the shortest time possible.</p><p><br></p><h2><strong>Summary</strong></h2><p>When developing an innovative concept, it's easy to lose sight of the big picture. The One-Minute-Pitch can create clarity by listing the most important aspects for outsiders in a short time. Whether for practice purposes or in real life, presenting to investors or other audiences helps convey the essence of the product or service.</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li><strong>Open:</strong> Because there is only one minute for the entire pitch, you need to keep your opener brief. Explain who you are and why a specific audience should care about your product, service, or company. What problem does this solve? For which target group? How does it solve a problem?</li><li><strong>Compete:</strong> A core skill of good entrepreneurs is that they know their competition and what they have ahead of them. Next, explain the market in which the product is located and why it will have no problems establishing itself in it.</li><li><strong>Differentiate:</strong> Now that the audience has learned about the existing competition, they need to be convinced that the product or service is ahead of the competition and why. This is the moment not only to create enthusiasm for the solution but also to make sure that the audience remembers the pitch.</li><li><strong>Locate:</strong> At what point is the concept? In which phase is the company, service, or product? Has the concept already been tested with the target group? Is there a prototype?</li><li><strong>Target:</strong> In the final step explain to the audience, which might include investors, why this exact concepts has been pitched on the stage today. What are you hoping to achieve? What service, financial resources or similar do you need to achieve which goal in the future?</li><li><strong>Improve:</strong> Get feedback on your pitch from the people present. What questions did they leave unanswered? How could you anticipate them in a new version of the pitch?</li></ol>","url":"https://www.figma.com/community/file/1106151778164177529"}
