{"id":"987258646891639848","name":"Growth Model Canvas","lastUpdateDate":"2021-06-17T07:33:23.941Z","publisherHandle":"roybammboo","publisherImage":"https://www.gravatar.com/avatar/d421057dfc3b4f1edd52ad0b243d0fdd?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_r_v2.png","publisherId":"916265921234417812","publisherName":"Roy de Vries","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/863931474/035146fa-6c5e-4600-8899-88d6ff1db39d-cover.png","description":"<p>Want to know more? Take a look at our website: <a href=\"https://bammboo.io/?utm_source=socialmedia&amp;utm_medium=Figma&amp;utm_campaign=GMC-Figma&amp;utm_content=44337\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">www.bammboo.io</a></p><p><br></p><p>The Growth Model Canvas offers you an effective and concrete model to plot your proposition, the customer journey and your funnel in one overview. When you fill it in, it facilitates you in finding&nbsp;the points that&nbsp;require your attention on a strategic level.</p><p><br></p><p>The customer journey in relation to your entire funnel is the engine of your growth strategy.</p><p><br></p><p>The Growth Model Canvas consists of 3 blocks</p><p>1. The customer journey of the target group with the corresponding value proposition: See - Think - Do - Care</p><p>2. The acquisition phases and the product phases for growth: Awareness - Acquisition - Activation - Retention - Revenue - Referral</p><p>3. The market and performance metrics that underpin your funnel</p><p><br></p><p>From proposition to the phases of your funnel, from lead to loyal customer</p><p>The Growth Model Canvas has two sides. The left side of the canvas is focused on finding the target group, the right side of the canvas is focused on serving the customer and improving the proposition.</p><p><br></p><p>The areas in which you plot your funnel make the transitions between the different phases very clear. Each phase is aimed at linking the value of your proposition to the expectations and experiences of your customers/users.</p>","url":"https://www.figma.com/community/file/987258646891639848"}
