{"id":"970143391809565172","name":"UX User Persona Template","lastUpdateDate":"2021-05-02T05:06:40.210Z","publisherHandle":"nige","publisherImage":"https://s3-alpha.figma.com/profile/2d509ddb-0351-46da-8521-7143aa95b20b","publisherId":"1662142","publisherName":"Nigel","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/824481941/3bcae387-c6b7-4786-8017-6f6382ed6292-cover.png","description":"<h1>UX User Persona Template</h1><h2>With auto-layout, components and variants.</h2><p>User personas are fictitious yet realistic representations of your target users. They act as a multipurpose tool used to drive many important product development tasks such as: the creation of user scenarios, feature generation, and feature prioritization.</p><p><br></p><p>Created out of complex user data, personas take on a format that is meaningful and creates user empathy among your development team, ensuring your users are always the focus of your efforts.</p><p><br></p><p>Learn more about UX User Personas at the <a href=\"https://www.nngroup.com/courses/personas/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Nielsen Norman Group website</a>.</p><p><br></p><h2>Add your info, change components and variants to suit, and you're done!</h2><p>This template makes powerful use of auto-layout, as well as components and variants - to make it easy to create a beautifully presented user persona.</p><p><br></p><p>All you need to do is add your persona information, and edit the various components with variants to suit your needs.</p><p><br></p><h2>Feedback and suggestions welcome</h2><p>You are welcome to share, modify and remix this template however you wish. Do make sure you're familiar with the creative commons license around proper attribution and additional restrictions though!</p><p><br></p><p>I'd also love to know how else this template might be used and how it could be improved so more people can make use of it. This wouldn't be a true UX project without encouraging feedback and suggestions! So, if you're having trouble with the template, or if you've got suggestions for anything to add or change, let me know in the comments and I'll take it on board to keep improving this template.</p><p><br></p><p>If you <em>really </em>like my work, you could <a href=\"http://buymeacoff.ee/nige\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">buy me a coffee</a>.</p>","url":"https://www.figma.com/community/file/970143391809565172"}
