{"id":"983446464948439880","name":"100 Race","lastUpdateDate":"2021-06-06T19:09:52.980Z","publisherHandle":"minigolf2000","publisherImage":"https://s3-alpha.figma.com/profile/af8dfbf2-db8d-4b5a-8d5a-a929d16d902d","publisherId":"98046","publisherName":"Golf Sinteppadon","description":"<h2><strong>Multiplayer platforming in Figma with friends! 🕹</strong></h2><p><br></p><p>Play and create race courses to compete with your friends! <a href=\"https://www.figma.com/community/file/983449023070835589?fuid=407309632208199131\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Example courses</a></p><p><br></p><p>To create a game, select a world and run this Plugin.</p><p><br></p><p>To join a game, run the Plugin while another game is running. The Plugin will automatically find and join a game if one exists in the same Figma file.</p><p><br></p><p><strong>Create custom courses</strong></p><p>To create custom courses, create a Frame and place rectangles inside! Optionally place something that looks like a goal post somewhere. Players will spawn at the bottom-left of the frame. Collision detection is done <strong>only</strong> between rectangles, so only non-rotated rectangles are supported and every other layer is ignored. Also overlapping rectangles can cause weirdnesses right now so try to have them not overlap if possible. You can name a layer \"bg\" to have collision detection ignore it (for custom art). When you're done, select your Frame and run this Plugin to race!</p><p><br></p><p><strong>How it works</strong></p><p>This is a simple plugin that takes in user input and does some simple platforming calculations to move a node around. The viewport then follows that node. The magic lies in Figma's multiplayer, which lets <a href=\"https://www.figma.com/blog/coming-together-at-config-2021/#_500-users\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">up to 100 users</a> run this plugin simultaneously to edit nodes on the same page. There is no countdown timer to start the race, no finish line detection, no concept of lives or death.</p>","url":"https://www.figma.com/community/plugin/983446464948439880","iconUrl":"https://www.figma.com/community/plugin/983446464948439880/icon","thumbnailUrl":"https://www.figma.com/community/plugin/983446464948439880/thumbnail"}
