{"id":"1084045892191402945","name":"SCAMPER","lastUpdateDate":"2022-03-29T14:34:08.615Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1704039874/5e73edb7-7a87-4d3b-84ba-b5664a35b88f-cover.png","description":"<p>Stimulate new ideas and challenge existing ones.</p><p><br></p><h2>Summary</h2><p>The SCAMPER method reflects ideas in by asking questions in seven different ways: substitue, combine, adapt, modify, put to another use, eliminate and reverse. The goal is to understand how existing ideas, products or services can be improved or how the idea generation process can be facilitated.</p><p><br></p><h2>Step-by-step</h2><ol><li>The SCAMPER method can be used alone or in a team. If you are working in a team, determine which idea, product or service etc. you want to evaluate with the method before you start. Whether digital or analog, either a paper can be used, or the pre-made SCAMPER worksheet.</li><li>Now the seven steps of the SCAMPER method are processed one after another, starting with “substitute”. Question which parts of the product, idea or service could be replaced by something else. What can be replaced to achieve optimization? Can the shape, smell, weight, name, material or similar be replaced? Can I change or&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/stakeholder-map\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>replace the stakeholders</strong></a>?</li><li><strong>Combine:</strong>&nbsp;Can parts of the product be combined with other things? How can parts of the product be combined to create a different product? What materials, shapes etc can be combined? What can be combined to increase the benefit or number of users?</li><li><strong>Adapt:</strong>&nbsp;How to customize the product? What needs to be customized to solve a specific problem? Which parts of the process can be adapted? Can the user group or target group be adapted?</li><li><strong>Modify:</strong>&nbsp;Which components can be magnified or minified? What modification could improve the results? Can the process be simplified or made more efficient? What can be removed without losing the value? What features can be slower, faster, bigger, smaller, louder, quieter, etc.?</li><li><strong>Put to another use:</strong>&nbsp;Which elements of the product can be used for another purpose? Is the use of the product in another area also useful? Can other target groups use the product or service? Can it be used by children or people with disabilities?</li><li><strong>Eliminate:</strong>&nbsp;Which part of the concept can be neglected or left out without changing the value? How can the product be simplified? How much can the concept be minimized?</li><li><strong>Reverse:</strong>&nbsp;Can the order of the elements or the process be changed? Can I change the appearance so that the results improve?</li><li>If you have worked in a team, you can now discuss the results together. Which insights can be taken from this exercise for the further process? Which part of the concept has proven to be unimportant or indispensable? Record the results in writing, if appropriate.</li></ol>","url":"https://www.figma.com/community/file/1084045892191402945"}
