{"id":"995044568179313872","name":"PT Tunas Sawa Erma (korindo Group)","lastUpdateDate":"2021-07-08T19:11:52.208Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968357311/ac5c670f-629c-469f-a3a9-611d1cb85490-cover.png","description":"<p><strong>Tunas Sawa Erma Group </strong>merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang usaha perkebunan dan pengolahan minyak kelapa sawit bersama dengan bersama dengan kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang seutuhnya bergerak didalam bidang budidaya kelapa sawit dan memproses minyak sawit mentah (Crude Palm Oil/CPO) serta berlokasi di Papua. Sejak th. 1995, Tunas Sawa Erma Group memulai usaha kelapa sawit di Papua atas keinginan Pemerintah Daerah. Kondisi infrastruktur waktu itu tetap minim, tapi Tunas Sawa Erma Group bisa berkembang baik dan termasuk jadi pihak pertama yang berkontribusi didalam pembangunan jalan Trans-Papua.</p><p><br></p><p>Sesuai bersama dengan bersama dengan visi dan misi untuk jadi perusahaan global, Tunas Sawa Erma Group memiliki komitmen pada kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang udah terjadi dan tertuang secara mengetahui di web site resmi perusahaan. Areal konsesi kita tidak berlokasi di lahan gambut. Selain itu, TSE Group termasuk menciptakan sistem dan lingkungan kerja yang menolong pengembangan sumber energi manusia lewat program seleksi dan pelatihan serta pembangunan berkelanjutan. Saat ini perusahaan termasuk udah memiliki tim Sustainability.</p><p><br></p><p>Kami termasuk mengapresiasi kontribusi para karyawan yang tetap berkembang bersama dengan bersama dengan perusahaan. Atas dedikasinya, Tunas Sawa Erma Group udah mempromosikan 70% berasal berasal dari karyawan jadi karyawan tetap. Kemajuan wanita termasuk jadi anggota berasal berasal dari perhatian kami. Sebanyak 20% berasal berasal dari keseluruhan karyawan adalah perempuan dan kita tetap menolong untuk meraih potensi paling baik mereka.​</p><p><br></p><p>Tak hanya itu, Tunas Sawa Erma Group Sebagai perusahaan termasuk tetap memelihara hubungan yang serasi dan saling membangun bersama dengan bersama dengan Pemerintah Daerah maupun masyarakat setempat, serta tetap aktif didalam aktivitas pengembangan ekonomi dan kesejahteraan masyarakat Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang udah beroperasi yaitu milik PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.&nbsp;</p>","url":"https://www.figma.com/community/file/995044568179313872"}
