{"id":"1084034412362136494","name":"Service Blueprints","lastUpdateDate":"2022-03-29T14:33:58.475Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1704041209/4ca0fa92-a256-4bc2-a764-fbf2349d4bb3-cover.png","description":"<p>Describe how a service works.</p><p><br></p><h2>Summary</h2><p>The Service Blueprint provides a framework for capturing and visualizing the user or customer experience of a product or service. This method not only helps to optimize and question existing products or services but also to understand emerging processes. The special advantage of the Service Blueprint is that it shows the company or product as a whole and thus provides a good overview.</p><p><br></p><h2>Step-by-step</h2><ol><li>Whether working in a team or alone, the first step is to define the scope of the Blueprint. This also includes defining the goals of the method. These could be, for example, to find out how much the business has invested in certain actions, where there is room for improvement, or what opportunities for interaction exist. The Service Blueprint worksheet provides the appropriate structure for these goals and insights.</li><li>Similar to a (treasure) map, visualizing the big picture opens up new paths (to the goal). For this purpose, some research information should already be known, obtained for example through&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/contextual-inquiry-plan\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Contextual Inquiries</strong></a>,&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/stakeholder-map\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Stakeholder Maps</strong></a>,&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/mobile-diaries\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Diary Studies</strong></a>, or User Interviews. Another option is to complete and discuss the Service Blueprint worksheet directly with the matching stakeholders on the team.</li><li><strong>Physical evidence:</strong>&nbsp;At the beginning of the work with the map, the so-called physical evidence is recorded. This includes the systems or tools that are being used, e.g. a website, social media, products, stuff, etc.</li></ol><ul><li><strong>Customer actions:</strong>&nbsp;How do customers interact with the service or product? What actions do they perform? Is there interaction with employees or with virtual assistants, etc.?</li><li><strong>Onstage contact actions:</strong>&nbsp;Actions that customers can consciously perceive, such as service quality.</li><li><strong>Backstage contact actions:</strong>&nbsp;Actions that customers cannot perceive or see. For example, content is being prepared for social media in the background, or a dish is being prepared in the kitchen of a restaurant.</li><li><strong>Support processes:</strong>&nbsp;Everything that happens in the background so that other things can be executed. For example, the system into which an employee can enter a customer's reservation.</li></ul><p>4. To make the service map even more detailed, time specifications can be assigned to the individual steps. Some actions may happen in a few minutes, while others may take weeks. Furthermore, actions of different levels that are dependent on each other can be linked.</p>","url":"https://www.figma.com/community/file/1084034412362136494"}
