{"id":"819995136233235915","name":"Component Variables","lastUpdateDate":"2020-03-12T19:11:30.741Z","publisherHandle":"luizmoura","publisherImage":"https://s3-alpha.figma.com/profile/c22865bc-f4c2-4925-ba05-e1c4761d05f8","publisherId":"529811","publisherName":"Luiz","description":"A plugin that helps customize Figma components in an orderly and automatic manner.\n\nCreate and edit preset variables within your component without the hassle of going through groups and autolayouts.\n\n__________________\n\nHOW TO USE\n\n• TEXT VARIABLES\nAssign a variable name to a text layer and change the text content through the panel.\n\nName the text layer wrapping it in curly brackets. The name inside will be assigned to the variable. \n\nE.g.: {label} will create a variable `label`.\n\n• SELECTOR VARIABLES\nCreate grouped options which only one is shown at a time.\n\nWrap the layer name in brackets, the first name should be the group name and the second the variable name. Separate the names with a '.' .\n\nWhen selected, all layers will be hidden, expect the chosen one.\n\nE.g.: [Color.Blue], [Color.Green] creates a group 'Color' in which you can choose between 'Blue' and 'Green' colors.\n\n• CONDITION VARIABLES\nShow or hide a layer based on a condition.\n\nName the layer wrapping it in parenthesis. This will create a toggle for the variable name which you can show/hide on the panel. \n\nE.g.: (disabled)\n\nYou can create an inverse condition by naming the layer starting with a '!' .\n\nE.g.: (!disabled)\n\n__________________\n\nNOTES\n\n• The variables should be created on the master component, keeping in mind not to rename the layers on the instance.\n\n• The configuration panel works only with instances.\n\n• You can create multiple layers with the same name to get the same behaviour on them.","url":"https://www.figma.com/community/plugin/819995136233235915","iconUrl":"https://www.figma.com/community/plugin/819995136233235915/icon","thumbnailUrl":"https://www.figma.com/community/plugin/819995136233235915/thumbnail"}
