{"id":"1106148175735479915","name":"Mental Models","lastUpdateDate":"2022-05-11T09:17:56.483Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856364620/d206d99a-3f23-43bd-8c4d-4c159ed1fd95-cover.png","description":"<p>Match with your user's expectations.</p><p><br></p><h2><strong>Summary</strong></h2><p>In the course of life, a person learns certain behaviors. These experiences, which are also called Mental Models, in turn, help to deal with future situations. Mental Models play a crucial role not only in everyday situations but also in human-computer interaction. To provide users with a successful experience through a product or service helps to understand their Mental Models. If these models are disregarded, this leads to users being frustrated because a particular interaction doesn't go as expected.</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>Every person has their mental models. These can be different, depending on culture, environment, age, and fellow human beings. Other models may be the same for many people, such as the expectation of what happens when you click the \"Buy” button on a web page. Users expect learned functionality to remain consistent from product to product (or service to service).</li><li>Ask yourself: What functionalities do I use in my product or service that are self-explanatory for users with the help of mental models? Which elements do not adhere to commonly known mental models and could cause confusion or even frustration? Take notes if helpful!</li><li>To ensure that the task adequacy of a product or service is appropriate for the users, a&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/user-testings\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>User Testing</strong></a>&nbsp;or a&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/user-interviews\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>User Interview</strong></a>&nbsp;can be conducted. Ask users what they expect from certain features and what their expectation is based on. Afterward, the functionalities can be adapted to increase user-friendliness through self-explanatory design.</li></ol>","url":"https://www.figma.com/community/file/1106148175735479915"}
