{"id":"764389386376321679","name":"Magia Record Character Grid Creator Interface","lastUpdateDate":"2020-03-27T08:53:36.626Z","publisherHandle":"LeoChan","publisherImage":"https://www.gravatar.com/avatar/9aa94e7f172b8128320c819e138cc7d9?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_l_v2.png","publisherId":"1329086","publisherName":"Leo Chan","description":"This plugin is for creating a grid view of your Magical Girls in the game Magia Record: Puella Magi Madoka Magica Side Story (https://magiarecord-en.com/). The game does not include a good overview for displaying all you owned Magical Girls and how awakened and upgraded they are, so this plugin creates that view as image for easy sharing.\n\nInstalling the Plugin\n1. Duplicate the Figma project (https://www.figma.com/file/jcgWY0YGzPbAwBp47LV3oL/Magia-Record-Character-Grids). \n2. Install the plugin and open the Magia Record Character Grids Project.\n3. Right click on the background or go to the hamburger menu and select Plugins > Magia Record Character Grid Creator Interface\n4. The HTML window for the plugin will open.\n\nFeatures\n1. Create a fully detailed Character Displays for your Magical Girls, including: Character Card, Stars (Rank), Attribute, Experience Level, Magic Level, Magia Level, and Episode Level.\n2. Available values for each field are automatically filled in and available for selection for easy creation.\n3. Update an existing Character Display if a mistake was made or as you progress though the game.\n4. Copy the properties of an existing Character Display to create a new or update an existing one.\n5. Automatic placement of newly created Character Displays with respect to the selected Character Display or parent Frame.\n6. Convert copied Character Display frames from one file to another file to work with the new file.\n7. Group and Sort Character Displays in a frame based on selected properties.\n8. Set Backgrounds for the frames containing Character Displays.\n\nUsage\n\nCreate new Character Display\n1. Either select an existing instance or frame (can be the document itself)\n2. Select the properties you want.\n3. Press Create.\n\nUpdate an Existing Character Display\n1. Select an existing instance of a Character Display.\n2. Press the Copy and all properties appear in fields.\n3. Modify the fields you want to update.\n3. Press Update. \n\nCreate new Character Display with Existing Properties\n1. Select an existing instance of a Character Display.\n2. Press the Copy and all properties appear in fields.\n3. Modify any fields if desired.\n4. Press Create.\n\nConvert Copied Character Displays from Another File\n1. Copy and paste either a Character Display instance(s) or an entire frame containing all the instances to convert from one file to another. Once pasted, all the instances will become frames as they are no longer attached to their master components. All the names of all the layers must match the original components.\n2. Select the Character Display frame(s) or parent frame (where all the children are Character Display frames) you want to convert.\n3. Press Convert and a toast message will show how many were converted or skipped.\n4. All the frames that were copy and pasted over are now converted to instances for which their master components are in the current document. \n\nGrouping and Sorting List\n1. Navigate to the Sorting tab.\n2. Select a frame containing only Character Displays.\n3. Select the property to group by, the property(s) to sort by, the grouping and sorting direction(s), the direction to sort the ID's (the last property to sort by), and the number of Character Displays per row.\n4. Press Sort.\n\nAdding Background to List\n1. Navigate to the Background Tab.\n2. Select the frame you want to add a background to.\n3. Select the Background Type and Background Name you want to add to the frame. You can see the available backgrounds in the Background Page.\n4. Press Create/Update.\n\nResizing Existing Background\n1. Navigate to the Background Tab.\n2. Select the frame you want to add a background to.\n3. Press Resize. You would want to do this if the frame has been resized and the background no longer fits or is no longer centered.\n\nRemoving a Background.\n1. Navigate to the Background Tab.\n2. Select the frame you want to remove a background from.\n3. Press Remove.","url":"https://www.figma.com/community/plugin/764389386376321679","iconUrl":"https://www.figma.com/community/plugin/764389386376321679/icon","thumbnailUrl":"https://www.figma.com/community/plugin/764389386376321679/thumbnail"}
