{"id":"1000963812142874727","name":"variables","lastUpdateDate":"2021-08-30T06:28:21.650Z","publisherHandle":"dnlrj","publisherImage":"https://s3-alpha.figma.com/profile/86fd9dad-49a3-4740-97da-32fa1bcc1a18","publisherId":"466014","publisherName":"Dan Araujo","description":"<p><strong>Create global variables and link them to any property across any layer. Experiment with your designs, keep organized, and unlock new functionality within Figma.</strong></p><p><br></p><h2>📕<strong> Playground and documentation</strong></h2><p>Start by duplicating <a href=\"https://www.figma.com/community/file/1000887127710719764\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>this handy file</strong></a> in the community! Check out interactive lessons and documentation, and see how variables can transform the way you work in Figma.</p><p><br></p><h2>✅<strong> Features</strong></h2><ul><li><strong>Use variables to control nearly 50 layer properties</strong> like blurs, shadows, size, rotation, text, padding, and much more.</li><li><strong>Use combo variables to modify your existing variables with math.</strong> For example, set a variable to be the value of another variable divided by 2, or multiply two of your variables together.</li><li><strong>Change variable scope to work for you.</strong> Have a different set of variables for each page in a document, share variables across the whole document, or even use one set of variables for all your documents.</li><li><strong>Batch edit specific properties</strong>, like blur, shadow offset, and contrast, across different images or shadows without requiring the other properties to match.</li><li><strong>Realtime syncing for multiple editors.</strong> Add, modify, or delete a variable and your changes will automatically sync to all users.</li></ul><p><br></p><h2>🤔<strong> How to use</strong></h2><p>That’s really up to you! Variables and linked properties work together to do whatever you want. At the bare minimum, you create a variable in the Variables tab. You can then use that variable to link it to the same property across different layers. Or different properties on the same layer. Or any combination you can dream up. Go wild! For inspiration, check out the <a href=\"https://www.figma.com/community/file/1000887127710719764\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>playground and documentation file</strong></a><strong>.</strong></p><p><br></p><h2>☕️ Support the plugin</h2><p>If you love the plugin and feel inclined to provide some small financial support to encourage the development of new features and bug fixes, that would be greatly appreciated. No pressure, of course!</p><p><a href=\"https://ko-fi.com/dnlrj\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Buy me a coffee</strong></a></p><h2><br></h2><h2><strong>🚧 Roadmap</strong></h2><ul><li>The option for layers with linked variables to be automatically updated when you rename a variable.</li><li>Variable value previews in the Properties tab</li><li>Much more!</li></ul><p><br></p><p>_</p>","url":"https://www.figma.com/community/plugin/1000963812142874727","iconUrl":"https://www.figma.com/community/plugin/1000963812142874727/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1000963812142874727/thumbnail"}
