{"id":"1041241874419596473","name":"Aleya Furniture Landing Page","lastUpdateDate":"2021-11-13T06:43:28.291Z","publisherHandle":"abir","publisherImage":"https://s3-alpha.figma.com/profile/1e26b326-9092-480c-a0bc-ea917ff228b8","publisherId":"797567","publisherName":"Abir Ahmed","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1290545586/49c7a7a2-b9a3-4c0d-8a2e-0eb5a8759131-cover.png","description":"<p>Hi there, this is a landing page designed for your new furniture product that needs attention and needs a standalone landing page to communicate how great your product is!</p><p><br></p><p>All the Illustrations and Icons are designed by me and are completely free of cost to use on your next project.</p><p><br></p><p>This landing page is designed to give users information about the product which is very hard to convey to the customer another way around (through Facebook or Instagram posts). With this website, you can convey the message to the user about your product very effectively.</p><p><br></p><p>This landing page is user-friendly, unique (so that easily recognizable), easy to build, looks clean &amp; minimal, and can be used for multiple purposes, such as for other products which can be a lamp, clothe, you name it! You can also customize the design easily so that it communicates your brand color, typefaces, or pictures.</p><p><br></p><p>The typefaces and Pictures used in this design are all free. You can easily download typefaces and pictures from Google Fonts and Unsplash.</p><p><br></p><p>Features:</p><p><br></p><ul><li>Font used: Poppins (Free to download)</li><li>Images used from Unsplash (Free to download)</li><li>Illustration and Icons designed by me which is included with this design</li><li>Responsive Layouts: (Desktop, Mobile &amp; Tablet)</li><li>8pt Grid System</li><li>Pixel Perfect Design</li></ul><p><br></p><p>Let me know what you think about the design and share any feedback. Thank you very much and have a nice</p>","url":"https://www.figma.com/community/file/1041241874419596473"}
