{"id":"1084052710048774107","name":"SWOT Analysis","lastUpdateDate":"2022-03-29T14:33:26.635Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1704046824/2b436bf7-de1c-49d0-a86f-46cd0183e8fa-cover.png","description":"<p>Question and analyze your project or business venture.</p><p><br></p><h2>Summary</h2><p>The SWOT Analysis reflects internal factors of a project to assess external factors. Here, the areas of strengths, weaknesses, opportunities and threats are reflected upon to help teams and individuals to classify and question their (product) concept.</p><p><br></p><h2>Step-by-step</h2><ol><li>Depending on whether the analysis is to take place alone or in a team, a meeting can be scheduled and the worksheet prepared. It is best to print the worksheet at least in A3 format, so enough post-it's will fit on it, if it is to be processed analogously.</li><li>If working in a team, the project idea should be summarized before starting the method so that everyone is on the same level. This summary should be done as neutrally as possible, so that no one is influenced by the feelings of the narrator. It makes sense for each participant to first collect their own thoughts and then discuss them with the others.</li><li>First, the internal factors are analyzed. Each participant writes at least one strength on a post-it, or directly on the worksheet in the respective quadrant. No more than one item should be listed per post-it. Once everyone has given their input, the post-it's can be clustered to identify possible overlaps. Points that have been mentioned several times could be particularly important.</li><li>Next, the same process is performed for the weaknesses. For example, a weakness may be a company's location, lack of knowledge, or dependence on other companies or service providers.</li><li>Subsequently, the external factors are considered, the opportunities and threats. The process is the same as for strengths and weaknesses. What are the uncertainties? How can the market or the competition create opportunities or threats? After the worksheet is filled with the post-it's they can be clustered again to determine similar points.</li><li>Optional: The SWOT Analysis worksheet now gives a good impression of what makes the product or service special. If the clustered points need to be further categorized, a point vote with the team can help. Let each participant mark one to two points in each category as the most important in their opinion.</li><li>Finally, the findings and consequences of the analysis should be discussed. Which strengths should be particularly cultivated? Which weaknesses can be addressed and how? The SWOT Analysis can be updated during the course of the project and should always be accessible to the entire project team. If a new version of the product has been iterated, the worksheet can be used to see whether individual weaknesses have been eliminated with the new version.</li></ol>","url":"https://www.figma.com/community/file/1084052710048774107"}
