{"id":"1077829383354591636","name":"⚡️🔮 lukexdod: 1/1 Auction template🔮⚡️","lastUpdateDate":"2022-02-22T05:49:10.289Z","publisherHandle":"lukefarrugia","publisherImage":"https://www.gravatar.com/avatar/4671b5aa135dec90c5ab5d8ce2752b67?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_l_v2.png","publisherId":"1998508","publisherName":"luke farrugia","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1580217039/361726e6-3366-4422-85c1-7deb11659e50-cover.png","description":"<p>I'm a life-long learner, an observer and a creator. Thereby I pay close attention, soak in the details and try to playback what I learnt in a way that I creatively understand. </p><p><br></p><p>In this case, I've noticed that running NFT art auctions is a lot of work, with many moving pieces. I began to plan my auction for Esther's Escape on Figma to counter this, and once I got into a groove, I never looked back. </p><p><br></p><p>My auction ran super smoothly, and I thought it was only fitting to open-source my process to empower others to use it. So I created this template for people to enjoy. I am not an expert by any means, but this is my baseline, and I'll iterate and improve from here. </p><p><br></p><p>I've documented 4 critical steps in this process: </p><p><br></p><p><strong>Step 1:  Organising the items to be auctioned</strong></p><p>When organising the auction pieces, dedicate some time to think about the visual story; what are you trying to say? </p><p><br></p><p>Once you have that answered, the attributes, story and posts help build that narrative and form a stronger connection with your community.  </p><p><br></p><p><strong>Step 2: Capturing the auction details</strong></p><p>Most NFT calendars, promoters and sharing posts branch off these central details. I have found that the more precise I am from the jump, the more I can leverage this content to power promotions and posts, both pre-planned and in real-time. </p><p><br></p><p><strong>Step 3: Pre-planning announcement</strong>s</p><p>A lot of work happens in this section; the pre-game for me begins weeks before anyone knows an auction is coming. That detail can be saved for another post; in this case, I'll focus on the most essential posts, the auction coming soon post and the sneak-peaks. </p><p><br></p><p><strong>Step 4: Auction day, let's bring it home</strong></p><p>Now it's time to kick back and run the play, enjoy the posting, the sharing and the support. But, make sure you also give love back, reply to people, show them gratitude, and you'll begin to make longer-term relationships that will open doors in the future. </p><p><br></p><p><strong>Step 5: Enjoy your success</strong></p><p>Sit back, relax and enjoy your success. Remember that the win comes from the enjoyment of making and the connections made. </p><p><br></p><p>The auction results are just a bonus. </p><p><br></p><h2>Posting intent</h2><p><br></p><p>When posting rapidly over the auction period, it became clear that I had a different intent each time I posted. Sometimes I was promoting, and other times I was engaging in sharing my feelings and/or showing support to others. </p><p><br></p><p>Here are the 3 key posting types I've noticed when running an auction: </p><p><br></p><p><strong>Core auction information posts</strong></p><p> The goal of these posts is to enhance the wayfinding to your auction. Making the browsing and bidding experience super easy for people. Make sure your critical information is clear and captured in a single post (info can be added to the image also). This way, you can quote tweet this anchor post when you have additional auction information or timing reminders.  </p><p><br></p><p><strong>Auction update posts</strong></p><p> These posts aim to deliver a status update on the progress of your auction. These will increase your reach as you @ top bidders and raise awareness for people who are watching your auction. These do not have to be quote tweeted from the 'core auction information posts' but should include a link back to the auction to make it easy for people to find the auction location.  </p><p><br></p><p><strong>Connection posts</strong></p><p> The aim of these posts is to connect with your community, say thank you and jump into the crowd amongst the people. These posts can come in the form of support of others upcoming work, showing your gratitude and/or showing project progress or backstage concept work. </p><p><br></p><p>That's it from me; I hope you find value in this template, and if you like what you see, please share it and feel free to <a href=\"https://twitter.com/lukexdod\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">throw me a follow</a>; I am all about making new frens and supporting each other. </p><p><br></p><p>⚡️🔮 <a href=\"https://twitter.com/lukexdod\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Lukexdod</a>🔮⚡️</p>","url":"https://www.figma.com/community/file/1077829383354591636"}
