{"id":"880826733808822304","name":"Translations for figma","lastUpdateDate":"2021-07-17T23:26:44.887Z","publisherHandle":"58f630cf_0983_4","publisherImage":null,"publisherId":"880870850386678883","publisherName":"figmat's Team","description":"<p>Translations for Figma seamlessly integrates into your environment and allows you to test every page with different languages on-fly.</p><p>You can use the service for free or as paid service. The&nbsp;<strong>free tier</strong>&nbsp;is free of payments with no registration required and enabled by default. Check out what is available with&nbsp;<strong>featured access&nbsp;</strong>at&nbsp;<a href=\"https://figmat.com/pricing\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://figmat.com/pricing</a>.</p><p><br></p><p>The plugin adds a command menu to run translations. The commands aim to minimize your efforts to translate content and designed to work on multiple labels at a time.&nbsp;</p><p><br></p><p><strong>On the first run,</strong>&nbsp;a confirmation window will appear.&nbsp;</p><ul><li>You need to provide the original language and choose the translation scope.</li><li>If your labels are in frames you do not need to select specific elements. Make sure you choose the \"All in frames\" translation scope.&nbsp;</li><li>If labels are outside of frames or it's not necessary to translate the entire content you should select the labels before running translations. Make sure you choose 'Incremental' scope in the confirmation window. Once translated text will be included in future translations even if not selected.</li></ul><p><br></p><p><strong>Further details.</strong>&nbsp;To manage translations you should be aware of two essential parameters - original/source language and scope for translations. A confirmation window will appear on the first attempt to translate a new page to get the parameters.&nbsp;&nbsp;</p><p><em>Original/source language</em>&nbsp;is the language that you use to develop. The plugin uses the entered text as a source for all translations and reverts it without modifications when you request a translation to the language.</p><p><em>The translation scope</em>&nbsp;is a way to determine which labels you want to translate. There are two options - 'All in frames' and 'Incremental'. With 'All in frames', the plugin will detect all labels in frames, including nested ones. It will also translate all newly added labels. You do not need to select specific labels to have them translated if they are in a frame.&nbsp;</p><p>With 'Incremental', the plugin translates only selected and previously translated labels. If you add a new label, you need to select it and request translation. Please, use the method if your design does not use frames, or you want to reduce affected labels.&nbsp;</p><p>&nbsp;</p><p><br></p><p><strong>Learn deeper.</strong>&nbsp;The plugin does not request previously translated labels from the server on a second language switch.</p><p>&nbsp;</p><p>If you edit a label in the source language, the plugin will request a new translation on the next request to translate the page.</p><p><br></p><p>If you edit a translated label in non-source language - the plugin will keep the proposed translation to recover it in the future. You can share your document with a professional or a native speaker for a review, and the plugin will keep the modifications.</p><p><br></p><p>When you append a new label on a translated page, the plugin considers new text as written in a source language, even if an entire page translated. The next translation request will synchronize added text with another context.</p>","url":"https://www.figma.com/community/plugin/880826733808822304","iconUrl":"https://www.figma.com/community/plugin/880826733808822304/icon","thumbnailUrl":"https://www.figma.com/community/plugin/880826733808822304/thumbnail"}
