{"id":"1088169423442872035","name":"Mac Mini Concept","lastUpdateDate":"2022-03-30T17:12:14.975Z","publisherHandle":"Alborz","publisherImage":"https://s3-alpha.figma.com/profile/fe6fe9f0-6b5e-4a83-9736-3f3c71864507","publisherId":"923478277059881504","publisherName":"Alborz Heydaryan","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1710867851/20adb723-03aa-489d-a5ac-ac7547520c5f-cover.png","description":"<h2>Mac Mini now in full colour!</h2><p><br></p><p>A while ago I created the Mac Studio in Figma and <a href=\"https://www.figma.com/community/file/1086551237269592374/Mac-Studio\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">published it to the community</a> for everyone to download for free.</p><p><br></p><p>I realized I could modify a few things and easily make new concept Macs based on the Studio. So I created a concept Mac Studio Pro and a Mac Mini which I also <a href=\"https://www.figma.com/community/file/1086862544865098585/Mac-Mini-and-Mac-Studio-Pro-Concepts\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">published to the community</a>.</p><p><br></p><p>The Mac Mini however I felt could use a majour re-design. I really liked the direction Apple took with the new 24\" iMac. Bringing back the colour into the personal computer for the non-pro consumers was a great idea.</p><p><br></p><p>So I set out to do the same with the Mac Mini. Since the Mini usually sits on the desk next to other objects i wanted it to look very friendly. So i made the edges completely round while keeping the overall footprint identical to the current Mac Mini and Mac Studio.</p><p><br></p><p>The port layout in the back is very similar to the Mac Studio minus a Thunderbolt. The power cable is the same as the current Mac Mini and not the 3 prong one on the Mac Studio.</p><p><br></p><p>On top of the device yo see the apple logo in the same finish as the iMac</p><p><br></p><p>Underneath the device I added 2 slots. The front takes the cold air in and the rear vent exhausts the hot air from the M2 or M2 Pro chips.</p><p><br></p><p>The vents and the legs are inspired by the new MacBook Pro 14\" and 16\". The legs should provide enough ground clearance to ensure a nice airflow. I didn't go with the circular grip of the Mac Studio since at this size there were no major benefits to it.</p><p><br></p><p>Next to the air vents there is a slightly darker line going around the device. This is where all the antennas will be just like the Mac Studio.</p><p><br></p><p>For the colours I used the same one from the 24\" iMac. This way you can match it with an iMac that you already own.</p><p><br></p><p>Update March 30 2022: Added a noise to all devices to look more realistic when you zoom in. </p>","url":"https://www.figma.com/community/file/1088169423442872035"}
