{"id":"915647337333327091","name":"Figma for Beginners","lastUpdateDate":"2021-10-11T21:07:59.278Z","publisherHandle":"1","publisherImage":"https://s3-alpha.figma.com/profile/677fd5cb-188c-4bb9-a7c5-661234cc87df","publisherId":"199306","publisherName":"アンドリュー","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1198616049/9de305a5-d6aa-4f09-bd95-3a1d224d02c8-cover.png","description":"<h2>Figma for Beginners</h2><p>Learn to use Figma in 45 minutes. If you or someone you know is looking to learn Figma, this series is for you!</p><p><br></p><p>This file was created as a part of the <a href=\"https://www.youtube.com/playlist?list=PLXDU_eVOJTx7QHLShNqIXL1Cgbxj7HlN4\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Figma for Beginners tutorial series</a> on Figma’s <a href=\"https://www.youtube.com/c/Figmadesign/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">YouTube channel</a>. In the four-part series we take you through a rough approximation of the design process and show you how to use Figma along the way.</p><p><br></p><p>We try move at a fast pace and only give the information that is relevant to the situation. If you want to learn more about any feature, watch our other <a href=\"https://www.youtube.com/c/Figmadesign/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">video tutorials</a>, or search our <a href=\"https://help.figma.com/hc/en-us\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Help Center</a>.</p><p><br></p><h2>Video 1: Explore Ideas (through wireframing)</h2><p>In part one of the series, we explore the absolute basics from creating an account, opening the editor, and drawing our first frames and shapes.</p><p><br></p><p>We briefly touch on collaborative editing as we ask for feedback from the rest of our team early in the design process.</p><p><br></p><p>If you have some experience in Figma, you might feel comfortable skipping this one. We’ll circle back on some of these topics in video 2.</p><p><br></p><p><a href=\"https://youtu.be/dXQ7IHkTiMM\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Watch Video 1: Explore ideas on YouTube...</strong></a></p><p><br></p><h2><br></h2><h2>Video 2: Create (medium-fidelity) designs</h2><p>Here we get our feet wet by introducing color and image fills to our shapes. We also create Styles (reusable properties), to keep our colors and typography in sync. We’re not going to win any awards with this design, but we’ll show you all the tools you need to make your own creations!</p><p><br></p><p>When we introduce color to our designs, we place some focus on the accessibility, and use the Stark plugin from the Figma Community.</p><p><br></p><p>Lastly, we use Auto Layout to create fluid and responsive designs that reflow to adapt to the changes we make. Auto Layout is a powerful and complex feature. To learn more, search Auto Layout on the Help Center.</p><p><br></p><p><a href=\"https://youtu.be/wvFd-z7jSaA\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Watch Video 2: Create Designs on YouTube...</strong></a></p><p><br></p><h2>Video 3: Build Prototypes</h2><p>Prototypes level up your designs and communicate how users should interact with your final product. You can use observation mode in Presentation view to see collaborators interact with your prototype.</p><p><br></p><p>If you want to learn to make more advanced prototyping interactions check out our resources on Smart Animate, Drag triggers, and Overlays.</p><p><br></p><p>You can also view your prototypes on your mobile device using the Figma Mirror app (this wasn’t shown in the video tutorial).</p><p><br></p><p><a href=\"https://youtu.be/lTIeZ2ahEkQ\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Watch Video 3: Build Prototypes on YouTube...</strong></a></p><p><br></p><p><br></p><h2>Video 4: Prepare for Handoff</h2><p>Figma is built for multiplayer collaboration and open design. But there’s a lot you can do to customize your file to make it easier to navigate by your team.</p><p><br></p><p>We’ll teach you how to create a custom thumbnail with file/project information, what Figma looks like as a viewer, and how to export assets.</p><p><br></p><p><a href=\"https://youtu.be/EQ_FL6u8EyM\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Watch Video 4: Prepare for Handoff on YouTube...</strong></a></p><p><br></p><p>-------------------------------------------------</p><p><br></p><h2><strong>Change log:</strong></h2><p><br></p><p><strong>July 20, 2020</strong></p><ul><li>Added dark mode components</li><li>Added additional variants for components without them</li><li>Added interactive components to the image carousel variants</li><li>Added complete dark mode designs on the \"Complete design\" page</li><li>Added three new color styles</li><li>Added additional elements to the card including a username, counts for likes and comments, and a dateTime stamp</li><li>Updated the educational annotations to be more robust and thorough.</li></ul>","url":"https://www.figma.com/community/file/915647337333327091"}
