{"id":"1037309320238203168","name":"DhiWise - Figma to Code","lastUpdateDate":"2021-11-02T13:21:56.151Z","publisherHandle":"dhiwise","publisherImage":"https://www.gravatar.com/avatar/d0017a804a487ac98b9335107d42ba84?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_d_v2.png","publisherId":"995306497476533838","publisherName":"DhiWise Pvt Ltd","description":"<p>Convert Figma designs to clean, scalable and responsive code in minutes for Android (Kotlin), iOS (Swift) and Flutter mobile applications.</p><p><br></p><p><strong>It works too fast! See how?</strong></p><ul><li>Install the plugin and sign in/sign up</li><li>Select the technology in which you need the code (iOS (Swift), Flutter, or Android (Kotlin))</li><li>Wait for a few minutes and receive the downloadable source code in your registered email</li></ul><p><br></p><p><strong>Why use Dhiwise?</strong></p><ul><li>Large range of UI components support - DhiWise supports and identifies a wide range of UI components and generates executable code.</li><li>Responsive design - Code generated using DhiWise is responsive and supports all the mobile devices.</li><li>Reusability - DhiWise identifies screens and components that’s used multiple times and prevents code duplication and maintains better code quality.</li><li>Clean code architecture - DhiWise platform follows clean code architecture that makes apps scalable and easy to maintain.</li><li>Fast, effective &amp; accurate - Generated code will be bug free and you will be able to get the code in just a few minutes.</li><li>Prototyping support - Actions added while prototyping Figma design will also be captured in the generated code.</li></ul><p><br></p><p><strong>Limitations</strong></p><p>We are working to achieve almost 100% accuracy for any design conversion and most of the time it works well. But sometimes due to complex design or some unidentified scenario an UI component may not be identified correctly and that needs to be corrected manually. (Create Figma design for your application with or without prototyping just by keeping a few standard <a href=\"https://docs.dhiwise.com/knowledgehub/reference-guide-and-tools/figma\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">design guidelines</a> in mind to get maximum accuracy for your design.)</p><p><br></p><p><strong>How to overcome limitations?</strong></p><p>To overcome limitations, developers can <a href=\"https://app.dhiwise.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">sign in to an account</a> on DhiWise platform and by using the <a href=\"https://docs.dhiwise.com/knowledgehub/technology-features-guide/Android/screens#change-view\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">change view</a> option they'll be able to change the correct view type for that UI component.</p><p><br></p><p><strong>What else can you do with DhiWise?</strong></p><p>DhiWise is a Pro Code platform made exclusively to empower developers and increase productivity with total code ownership! <strong>Build production-ready mobile applications using DhiWise.</strong></p><p><br></p><p>Starting a new project requires lots of basic setup and it’s time consuming too. However, with DhiWise developers can build the basic setup of their web &amp; mobile app in just a few hours and focus on things that matters most! With DhiWise you can set-up/manage following features in your mobile apps :</p><ul><li>Integrate APIs by uploading postman collection (Data to view and View to data binding support)</li><li>Set up permissions (Camera, Gallery and others)</li><li>Alert box (Snack bar, Toast and Alert)</li><li>Manage navigation (With back navigation support)</li><li>Firebase integration</li><li>Social authentication (Google and Facebook)</li><li>Manage lifecycle</li></ul><p>For more information, refer to our <a href=\"https://docs.dhiwise.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">documentation</a>.</p><p><br></p><p>Feedback and improvements are welcome, please drop us an email at <a href=\"mailto:help@dhiwise.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">help@dhiwise.com</a>.</p><p><br></p><p>Made with ❤️ by <a href=\"https://www.dhiwise.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Dhiwise</a>.</p>","url":"https://www.figma.com/community/plugin/1037309320238203168","iconUrl":"https://www.figma.com/community/plugin/1037309320238203168/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1037309320238203168/thumbnail"}
