{"id":"1084051973641072601","name":"Lessons Learned","lastUpdateDate":"2022-03-29T14:34:58.198Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1704034107/47420037-1ef3-4074-b49d-207d9cd8173d-cover.png","description":"<p>Reflect on what was learned from the experience of designing a product or service.</p><p><br></p><h2>Summary</h2><p>The Lessons Learned method describes reflecting on and recording everything what has been learned through actions, decisions, and project-specific experiences. Internalizing these lessons helps to avoid possible mistakes in the next project. This method can be carried out after a few weeks of working on a project, as well as at the end of a project.</p><p><br></p><h2>Step-by-step</h2><ol><li>Depending on whether the method is being performed as an individual or personal reflection, or within the team, a meeting needs to be planned in which all participants in the project can take part.</li><li>One team member reflects on the project by summarizing it for the others. This summary should be done as neutrally as possible, so that no one is influenced by the feelings of the narrator.</li><li>Then the most important key factors are recorded in written form. It is important not only to list things that did not run satisfactorily, but also those that worked well and can possibly be used again. Every voice counts: a moderator should make sure that each team member expresses his or her personal and, above all, honest opinion. Optionally, the Lessons Learned worksheet can be used.</li><li>Subsequently, recommendations for action can emerge for all learned lessons in both, positive or negative ways. This reduces the probability of recurring errors and increases the chances of success by reapplying successful approaches.</li></ol>","url":"https://www.figma.com/community/file/1084051973641072601"}
