{"id":"1114001199549197320","name":"Untitled UI Icons – 1,100+ FREE essential Figma icons","lastUpdateDate":"2022-06-03T02:15:30.527Z","publisherHandle":"designer","publisherImage":"https://s3-alpha.figma.com/profile/910a809b-359c-4c9f-9a82-febd85377bbe","publisherId":"1339065","publisherName":"Jordan Hughes","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1944090965/ae0dfb6f-247f-4101-8424-935eae75058a-cover.png","description":"<p>Untitled UI Icons are a clean, consistent, and neutral icon library crafted specifically for modern UI design. Made for Figma, in Figma.</p><p><br></p><p>✨&nbsp;Learn more and preview the entire library at<strong> </strong><a href=\"http://untitledui.com/icons\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">untitledui.com/icons</a> ✨</p><p><br></p><h2><strong>1,100+ FREE essential Figma UI icons</strong></h2><p><br></p><p>We searched everywhere for the \"ultimate\" icon set for modern UI design to use across all our projects... We couldn't find an icon library for Figma we loved so we made one.</p><p><br></p><ul><li><strong>Made for Figma, in Figma.</strong> 100% compatible with Figma's latest 2022 component properties and override features. Say goodbye to Illustrator.</li><li><strong>Crafted specifically for modern UI design.</strong> Clean, consistent, and professionally crafted. Purposefully not overly stylized and neutral enough for any project.</li><li><strong>1,100+ and counting.</strong> Packed full with everything you need to design modern and beautiful UI and websites. No more custom icons.</li><li><strong>Neatly organized.</strong> The entire library is neatly organized alphabetically across 19 categories. Spend less time searching and more time designing.</li><li><strong>Smooth corners by default.</strong> Untitled UI Icons use beautiful and naturally continuously 60% variable curves on all corners. We stress these tiny details because once you see it, you can't unsee it.</li><li><strong>2px stroke weight default. </strong>2px stroke weight by default for visually-balanced icons across sizes. Change stroke weight in Figma with just a few clicks.</li><li><strong>Optimized SVG output.</strong> No unnecessary layers or shapes. SVG outputs are optimized for minimal file size, no unnecessary attributes, and infinite scalability.</li><li><strong>Use in unlimited projects. </strong>In fact, we designed it this way — to be as neutral, flexible, and scalable as possible to use as a single \"ultimate\" library for any project.</li><li><strong>Lifetime updates. </strong>No subscriptions or \"upgrades\". Get lifetime updates forever. We're <a href=\"https://www.untitledui.com/changelog\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">always making improvements</a> to Untitled UI products.</li></ul><p><br></p><h2><strong>Not all icon libraries are equal</strong></h2><p><br></p><p>There are hundreds of icon libraries, but the majority of them are low-quality, designed for Illustrator, or simply too small — usually all three. We couldn't find an icon library for Figma we loved so we made one.</p><p><br></p><p>We’ve built this icon library to be professional quality, while neutral and flexible enough for any project.</p><p><br></p><h2>What are you waiting for?</h2><p><br></p><p><a href=\"https://www.untitledui.com/icons\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Untitled UI Icons</a> is the last icon library you'll need and comes packed full with everything you need to design modern and beautiful UI and websites.</p><p><br></p><p>✨&nbsp;Learn more at<strong> </strong><a href=\"http://untitledui.com/icons\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">untitledui.com/icons</a> ✨</p><p><br></p><p>✨ <a href=\"https://www.untitledui.com/changelog\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Learn what's new in Untitled UI</a> on our changelog ✨</p><p><br></p><h2>Why do I need a high-quality icon library?</h2><p><br></p><p>Nothing stands out more in modern UI design than inconsistent icons. There are hundreds of icon libraries floating around the internet today, but the majority of them are low quality, buggy, overly stylized, or simply too small — usually all of these.</p><p><br></p><p>You don’t realize the power of a high-quality icon library until you start using one. A good icon library saves you time and money usually spent on meticulously creating icons one-by-one, or even worse, constantly fixing existing icons so they're more consistent and optically balanced.</p><p><br></p><p>A good way to frame it is to ask the question, “will this icon library save me a few hours of work in a project?” If the answer is YES, it’s probably worth the investment. Then it becomes an asset you can use in unlimited future projects.</p><p><br></p><p>We’ve thought of everything you need for modern UI design and have wrapped it into one neatly organized package. Better yet, it's made for Figma, in Figma, which means they're carefully designed to be 100% compatible with Figma's latest 2022 component properties and override features.</p><p><br></p><p>You can use this icon library in unlimited projects. In fact, we designed it this way — Untitled UI Icons are designed to be 100% Figma native, consistent, professional quality, and neutral enough for any UI or web design project.</p><p><br></p><h2><strong>How are Untitled UI Icons different?</strong></h2><p><br></p><p>We get it. There are hundreds of icon packs. Why did we create another one?</p><p><br></p><p>When we were building <a href=\"https://www.untitledui.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Untitled UI</a>, we looked at dozens and dozens of open source and best-selling icon libraries. Some were good, but we found the vast majority lacked in quality, were overly stylized, or simply too small.</p><p><br></p><p>The main problem was that not a single one was set up to respect component overrides in Figma. For example, when you use an icon in a component and change the color, as soon as you swap out that icon instance, you'll lose those overrides and have to add the color again. We actually had to fix the Feather icons one by one to make them work for Untitled UI's launch.</p><p><br></p><p>We realized we needed an “ultimate” icon library that was professional quality, but also big enough and neutral enough for any project, <em>and</em> designed to work seamlessly with Figma. We couldn't find an icon library we loved so we made one. Untitled UI Icons are made for Figma, in Figma, and tick all the boxes we were looking for. Basically, we made it for ourselves.</p><p><br></p><h2>Any questions?</h2><p><br></p><p>Check out our&nbsp;<a href=\"https://www.untitledui.com/faqs\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Frequently Asked Questions</a> page on our website.</p><p><br></p><p>Something else? Chat to our friendly team via <a href=\"mailto:hello@untitledui.com\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">hello@untitledui.com</a></p>","url":"https://www.figma.com/community/file/1114001199549197320"}
