{"id":"978648737523411901","name":"Addjust","lastUpdateDate":"2021-05-24T14:03:59.635Z","publisherHandle":"morqua","publisherImage":"https://s3-alpha.figma.com/profile/7241a072-6b79-4c97-bd12-ec2a64509685","publisherId":"930567135904019989","publisherName":"MORQUA","description":"<p>The <em>Addjust</em> plugin adds hundreds of unique 3D illustrations and icons in PNG format to Figma. You can repaint and choose the right angle to be displayed.</p><p>A large collection of icons and illustrations can be used to design presentations, create websites or apps.</p><p><br></p><p><strong>Palette Customization</strong></p><p>Figma has the option to save palettes for each document. It's convenient if you work with several projects of different brands which have their own brand colors. In the Addjust extension, you can also edit, delete and complement your own palette collections.</p><p><br></p><p><strong>Free content</strong></p><p>The plugin has a large selection of free 3D icons and illustrations which will be updated periodically.</p><p><br></p><p><strong>Artists</strong></p><p>We collaborate with outstanding artists and illustrators from all over the world who have created unique icons and illustrations for you. Each image or icon has its own author. You can visit their profiles to learn more details about them.</p><p><br></p><p><strong>Just a Few Easy Steps:</strong></p><ul><li>Open the Addjust plugin and select the appropriate collection. Each collection is categorized, e.g. Business, Design, Leisure, etc.</li><li>Click the icon or illustration you want to insert into the canvas.</li><li>In the editor window, you can change the display angle, choose a color from the default palette, or apply your own.</li><li>Once an icon or illustration has appeared on the canvas, you can adapt it even better for your layout or product. To do this, click on the icon twice and select the desired parameters in the menu that appears.</li></ul><p><br></p><p><br></p><p>------------</p><p><br></p><p>We can't wait to see what you create with the Addjust plugin!</p><p>Share your creations with the hashtag <strong><em>#withaddjust</em></strong></p><p><br></p><p><br></p><p><em>MORQUA team</em></p>","url":"https://www.figma.com/community/plugin/978648737523411901","iconUrl":"https://www.figma.com/community/plugin/978648737523411901/icon","thumbnailUrl":"https://www.figma.com/community/plugin/978648737523411901/thumbnail"}
