{"id":"1106147243951220326","name":"Could, Should, Must","lastUpdateDate":"2022-05-11T09:14:14.359Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856364877/2e667448-3f74-4061-8bda-f0007dd47222-cover.png","description":"<p>Prioritise and rate features.</p><p><br></p><h2><strong>Summary</strong></h2><p>Originally for working with user stories, this method (also known as MoSCoW method) can be used to bring prioritisation into any point of discussion when there’s a number of available segments which are comparable with each other. In most cases, it is used for providing weight to work packages.</p><ol><li><strong>Could:</strong>&nbsp;This item is nice to have and not of considerable importance.</li><li><strong>Should:</strong>&nbsp;This item is important in order to meet certain&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/kpi-tracking\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>KPIs</strong></a>.</li><li><strong>Must:</strong>&nbsp;This item is essential for the overall mission and needs to be part of the scope.</li></ol><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>Set up a meeting and have plenty of pens and post-it's available.</li><li>In individual work, put all points of discussion on post-it’s and place them on a wall.</li><li>Each post-it will be discussed shortly, in a pre-defined amount of time (30 – 60 seconds), and then rated or even clustered into one of the three categories Could, Should, and Must.</li><li>Additionally, a relative estimated implementation effort can be added to the post-it. Usually provided as numbers 0, 25, 50, 75, and 100, where 0 is no effort and 100 is a very high effort.</li><li>Record the tasks, incorporate them into your backlog if necessary, or take a picture of the “post-it-wall” for later reflection.</li></ol>","url":"https://www.figma.com/community/file/1106147243951220326"}
