{"id":"877698871356754847","name":"Color Theme Manager","lastUpdateDate":"2020-08-24T19:58:58.884Z","publisherHandle":"40a78181_9f15_4","publisherImage":"https://www.gravatar.com/avatar/6c6319c9f683d4b38593520b3ee2687a?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_d_v2.png","publisherId":"2630296","publisherName":"Derek Zhang","description":"About\n\nColor Theme Manager is a light weight easy to use plugin for create and swap between different color themes. Simply save color styles as you normally do and Color Theme Manager can help you with the rest. No need to worry about JSON, naming prefix, selection, etc. Good for developing color systems, projects require multiple color themes (like dark mode and light mode), and giving your design a new look.\n\nFeatures\n\nSave Color Theme\nCarefully name your current color theme and it will be saved within the Figma file you are working with. This will save all local color styles into a color theme. Note color styles in color themes will not update when you modified local color styles, you need to manually save changes to color themes.\n\nApply Color Theme\nChange to an entirely different look by applying a color theme with only one click. Your local color styles will be replaced by ones from the color theme you choose.\n\n Import/Export Color Themes\nDue to the current Figma Plugin API limitation, transferring data across Figma file can not be streamlined. A second-best solution is offered by Color Theme Manager, simply copy your saved color theme into clipboard and paste to another file.\n\nHow?\n\nColor Theme Manager will look for color style from a saved theme with the exact same name and replace the local style. So name your color styles (and color themes) wisely. Repeated names will cause unexpected results.\n\nFuture\n\n- Features like auto update, read/write to libraries can not be implemented efficiently with the current set of APIs. This might change when new APIs come out.\n- Color styles involve image fill is not implemented very efficiently. This might be fixed in a future update.\n- UI might be reimplemented in a more maintainable way.","url":"https://www.figma.com/community/plugin/877698871356754847","iconUrl":"https://www.figma.com/community/plugin/877698871356754847/icon","thumbnailUrl":"https://www.figma.com/community/plugin/877698871356754847/thumbnail"}
