{"id":"1008670902206388125","name":"Talkie","lastUpdateDate":"2021-08-15T09:50:47.298Z","publisherHandle":"SVV_24","publisherImage":"https://www.gravatar.com/avatar/bd81e6b2f0e017c8b8ecdda6411ee4e3?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_s_v2.png","publisherId":"996991208852775148","publisherName":"SHIVAM VORA","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1053284403/00fe0e66-8cac-42dc-add4-d5a55182bc4b-cover.png","description":"<p>One of the biggest challenges for people working remotely is alienations from their teams and colleagues. It becomes difficult to befriend people especially in a completely new work environment. Job life is a major change in every person's life. And with everything online, social interaction has become a nightmare for most of us. So, this inspired us to create an app that makes workplace more interesting and to form tight-knit, amicable bonds between the colleagues thus creating a positive impact on the society and increasing productivity, boosting work outcomes. </p><p>Talkie is an app that allows workplace or organization/teams colleagues to connect with each other and forming communities with likeminded people based on their interests. It also helps the user to match with people on personal level and have opportunity to know them. They could talk about random stuff like matters, hobbies, funny cat videos, experiences and more. That way you not only improve the team spirit and camaraderie, but you don't feel lonely anymore. Additionally, random conversation connects employees who might otherwise never get the chance to talk to each other. So, they can make a company feel less hierarchical.</p><p>The idea itself will serve as a boon to the society and improve human relations, thus boosting workplace interactions. It will help to know the team better thus driving the performance levels to greater pinnacles of success. Talkie is exactly the need of the hour. Nothing better can complement the new normal, the way TALKIE does.</p><p><br></p>","url":"https://www.figma.com/community/file/1008670902206388125"}
