{"id":"750499296698468459","name":"Retextifier","lastUpdateDate":"2021-06-18T20:58:25.090Z","publisherHandle":"vadim","publisherImage":"https://s3-alpha.figma.com/profile/fb647062-c72c-462e-97b4-04a9085e290f","publisherId":"779","publisherName":"Vadim Pleshkov","description":"<p>Change multiple texts in a batch, without having to click on each of them first. Paste new-line delimited texts into the several layers at once.</p><p><br></p><h2><strong>How the plugin works:</strong></h2><p>• Plugin will find every visible, unlocked text layer, and show you the input for each of them, letting you change all the texts in one take.</p><p>• Plugin is aware of text layer positions and nesting layers, and ordering inputs depending on layer positions from top left to bottom right.</p><p>• Completely keyboard accessible — select next field with TAB, change texts with ENTER, cancel with ESC</p><p><br></p><h2><strong>How to use:</strong></h2><p><strong>1. Select all the layers you want to be changed.</strong> If there is a Group or Frame within the selection, the plugin will find every unlocked visible text layer inside the selection.</p><p><br></p><p><strong>2. Call the plugin and change texts in the needed layers.</strong> Navigate between fields with Tab / Shift+Tab.</p><p><br></p><p>You also can paste multiple lines at once. Hold Shift while pasting, and every new line from copied text will be pasted into its own field.&nbsp;</p><p><br></p><p>Copying with Shift will copy texts from currently selected input and all inputs down from it will be copied to clipboard with new lines as delimiters. (It is handy to past the set of text in another group of layers using Retextifier)</p><p><br></p><p><strong>3. Click \"Change\" or press Enter.</strong> All changes would be applied. Mixed formatting for the layers that have been changed will be dropped.</p><p><br></p><p>See some details and video preview on Twitter:<a href=\"https://twitter.com/aswellasyouare/status/1179063309280174081\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> https://twitter.com/aswellasyouare/status/1179063309280174081</a></p><p>Also, follow me there to not miss new updates and announcements.</p><p><br></p><h2><strong>Added in version 4:</strong></h2><p>• Text layer corresponding with the currently active input now selected on canvas, so you can see more clearly which layer you will be changing.</p><p>• Input orders now depend on position and nesting of the layers. If the top leftmost object among the selected is a group or a frame, all the text layers inside it will be placed in the list of inputs first, and so on.</p><p>• Now you can copy multiple layers from inputs. When you press Cmd+Shift+C texts from the currently selected input and all inputs down from it will be copied to clipboard with new lines as delimiters.</p><p>• Now tabs also work as delimiters with multiline paste. With that, you can copy-paste rows from Google Sheets and other places.</p><p><br></p><h2><strong>Added in version 10:</strong></h2><p>• Now the plugin finally works correctly on Windows! Had to implement some tricky logic handling new lines on Windows, and now everything should work as expected.</p><p>• Starting from this version, the plugin preserves the name of the layer when changing the text. This will ensure that changing the texts won't disrupt smart animate or propagating defaults from main components into instances. Whenever you need to match layer name back to the text content, you could use “Reset Text Layer Name” plugin.</p><p><br></p><p><br></p>","url":"https://www.figma.com/community/plugin/750499296698468459","iconUrl":"https://www.figma.com/community/plugin/750499296698468459/icon","thumbnailUrl":"https://www.figma.com/community/plugin/750499296698468459/thumbnail"}
