{"id":"787488293482536319","name":"Data Populator","lastUpdateDate":"2020-02-23T23:19:06.724Z","publisherHandle":"ptrckmrgn","publisherImage":"https://s3-alpha.figma.com/profile/359945db-6ee7-4e51-8cc5-136bad7930d4","publisherId":"68","publisherName":"Patrick Morgan","description":"Figma Data Populator makes using real, meaningful data faster and easier than ever. Inspired by Sketch Data Populator, this plugin allows you to connect a JSON data source and quickly populate text and images.\n\nTry it out\n\n  1 - Click “Manage Data Source” and add the demo JSON file: https://api.myjson.com/bins/zdv2i\n  2 - Create a Text layer and rename it \"{name.first}\"\n  3 - Create a Rectangle or Ellipse layer and rename it \"{avatar}\"\n  4 - Create another text layer, rename it “location” and type into it “{location.city}, {location.country}”\n  5 - Select all your new layers and click “Populate”.\n  6 - Turn the layers into a component and populate again. Note how all the layers within a component or instance will be populated with data from the same record.\n\n---------------\n\nAdding a data source\n\n  •  Try http://myjson.com/ for simple JSON hosting.\n  •  If you want to populate layers randomly, use arrays in your first level of JSON values, e.g. { “users\": [ object1, object2, …, objectN ], “jobs”: [ objectA, objectB, …, objectC ] }.\n  •  Data from these objects is referenced using curly brackets {…} and dot notation, allowing you to populate structured data like {users.name.first} and {jobs.description}.\n  •  If you only have a single array, you don’t need to reference the first key. E.g. for { “data\": [ object1, object2, …, objectN ] }, write {name.first} instead of {data.name.first}\n\nPopulating text\n\n  •  Populate an entire text layer by renaming the layer. \n  •  Alternatively populate a part of a text layer by adding your curly brackets within the text (e.g. “I love {location.city}” becomes “I love New York”). \n  •  The plugin remembers the parts it populated, so you can populate the same layers again and again.\n\nPopulating images\n\n  •  Populate images by renaming a shape layer. \n  •  The data source for images must be a URL to a hosted image.\n  •  Try https://source.unsplash.com/ for easy hosted images.\n\nPopulating a component/instance\n\n  •  When you select a bunch of regular layers, the plugin randomly chooses the records to populate them with. If you want them to all be populated from the same record, turn them into a component (or instance).\n  •  Add data to your library components so that they’re ready to go!\n\nRoadmap...?\n\n  •  Manage multiple data sources\n  •  Use data from google sheets and other sources\n  •  Basic functions like random() and if()\n  •  DM me suggestions!","url":"https://www.figma.com/community/plugin/787488293482536319","iconUrl":"https://www.figma.com/community/plugin/787488293482536319/icon","thumbnailUrl":"https://www.figma.com/community/plugin/787488293482536319/thumbnail"}
