{"id":"1033638654746235310","name":"Godrej Park Retreat","lastUpdateDate":"2021-10-23T07:10:59.477Z","publisherHandle":"godrejpark","publisherImage":"https://www.gravatar.com/avatar/b0ab2ee2827c220a80e1ab441dd8e3ce?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_g_v2.png","publisherId":"1033636427580016256","publisherName":"Godrej Park Retreat","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1231812696/8f431e71-4d61-435a-9dfc-9b4cff8708bb-cover.png","description":"<p><a href=\"https://www.godrejparkretreats.in/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Godrej Park Retreat</a> is a cutting edge private undertaking by the Godrej Properties off Sarjapur Road in Bangalore. This apartment building Park Retreat comprises of 800 Plus houses. The new dispatch is among the most anticipated tasks by Godrej. Sarjapur Road has probably the best high rises in east Bangalore. There are numerous IT organizations. It is a quickly developing region. With this pre-dispatch extravagance level on Sarjapur street, Godrej will make another milestone.&nbsp;</p><p><br></p><p><a href=\"https://www.godrejparkretreats.in/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Godrej Park Retreat</a> property comprises of extravagance apartment buildings with favored 2 and 3 BHK units. We can get reasonable homes with a few administrations and offices exactly at doorsteps. Godrej Properties has done whatever it may take to furnish us with an incredible way of life property loaded up with fun, security, and peaceful.&nbsp;</p><p><br></p><p>Godrej Park Retreat enormous Pre-dispatch property is in measure with RERA endorsement. Whenever this is gotten we could anticipate the dispatch of the property. Godrej Park Retreat has been created impeccably with huge arranged gardens and open spaces.&nbsp;</p><p><br></p><p>Godrej Park Retreat is an immaculate treat for us with numerous relaxation and sporting conveniences like a gigantic clubhouse with a pool, a running track, and different games courts. There are likewise cafeterias present anywhere nearby to keep us drew in and achieved.&nbsp;</p><p><br></p><p><br></p>","url":"https://www.figma.com/community/file/1033638654746235310"}
