{"id":"1094003621848185554","name":"Anatomy Of Typography","lastUpdateDate":"2022-04-07T20:59:49.188Z","publisherHandle":"jordiespinosa","publisherImage":"https://s3-alpha.figma.com/profile/e2609f1f-756b-4cdb-891d-e788afab51eb","publisherId":"972862357493124820","publisherName":"Jordi Espinosa","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1741852240/1255b904-20cc-4911-8c2c-5d7292c06090-cover.png","description":"<h2><strong>Introduction</strong></h2><p><br></p><p>Welcome to the Anatomy of Typography, because the details matter. The present work is an extract of \"Typography is for everybody™.</p><p><br></p><p><strong>Get the book</strong>: <a href=\"https://jordiespinosa.com/typography/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">I want it!</a></p><p><br></p><p>----</p><p><br></p><h2>Book introduction</h2><p><br></p><p>The present work is a typographic manual developed and designed to operate as a basic encyclopedia where you can store the basic concepts of typography. In this book, we will not focus on advanced typography or very specific aspects. It is intended to function as an additional resource for designers in college or simply to have a cheat sheet to go to from time to time for those who want to apply typography correctly, efficiently and consciously.</p><p><br></p><p>This typography manual is made for several purposes, we all know that typography is a very open world, delicate and complex at the same time. Many designers would like to be able to say that they master typography and even those professionals who deal with typography every single day are still learning new applications, new variations, new perspectives, and still studying the basics and their corresponding fundamentals.</p><p><br></p><p>In this manual, we will not only study the fundamentals of typography (at least the ones that I consider important to start with), but we will also go further. It's fine to learn the basics of typography, but we need someone to explain to us how it works, how it is applied, what it does, what functionality has. That is, I will not only explain the theory, but we will try to guide the understanding of its practice, in other words, how we can apply it to reality.</p><p><br></p><p>Being said that, I hope you enjoy the anatomy and pay very close attention to the details!</p><p><br></p><p><strong>FOLLOW ME INSTAGRAM:</strong> <a href=\"https://www.instagram.com/ux.espinosa/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">ux.espinosa</a></p>","url":"https://www.figma.com/community/file/1094003621848185554"}
