{"id":"1084050995013891025","name":"Innovation Board","lastUpdateDate":"2022-03-11T09:51:38.048Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1641249381/c9a56b0e-2815-490f-acd9-a8dd55f838b6-cover.png","description":"<p>Evaluate the most important steps towards digital innovation.</p><p><br></p><h2>Summary</h2><p>For calculating a digital product's innovative value (i.e. its sustainable impact on the business), it is necessary to find out how well users get along with it and whether they would use it again, or even recommend it to others. The stronger the product's USP, the more likely it is to succeed on the market.</p><p><br></p><h2>Step-by-step</h2><ol><li>Evaluate the product's value by filling out the fields on the Innovation Board 1. Think of 1 being the lowest and 10 being the highest score possible.</li></ol><ul><li>To what extent does your product empower users to do what is expected from them?</li><li>Is your product preferred over other substitutional products?</li><li>At which level on the buyer readiness stage are your users currently located?</li><li>Would your users recommend the product to others?</li></ul><p>2. Describe (and discuss) your user's willingness to buy, and the price point of the product in more detail. Do you need to change your pricing strategy?</p><p>3. Mark the subjective ranking of the user experience on the scale provided. Why is your mark it at this position? What can be improved if necessary?</p><p>4. Place the product on the assessment matrix on the Innovation Board 2. How big is the market size? What is your product's viral potential?</p><p>5. Hold on to what unfair advantages your product has got over other products on the market. Determine the revenue stream,&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/kpi-tracking\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>KPIs</strong></a>&nbsp;and channels of the product.</p><p>6. Share your outcome with your team to promote exchange. This step is especially important as the Innovation Board is not a lifeless document but rather a continuously changing foundation for your entire product evolvement process.</p>","url":"https://www.figma.com/community/file/1084050995013891025"}
