{"id":"1020727956315288661","name":"Berrycast: Simple Screen Recorder & Sharing Tool","lastUpdateDate":"2021-09-17T16:08:48.519Z","publisherHandle":"dbertholet","publisherImage":"https://www.gravatar.com/avatar/30dc1f9e92dd0093f8df0baee98d5c4b?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_d_v2.png","publisherId":"2063309","publisherName":"Damien Bertholet","description":"<p>Dead simple to use screen recording tool.</p><p><br></p><p>Berrycast your colleagues.&nbsp;</p><p>It’s more productive.</p><p><br></p><p>The ability to share what’s on your screen within Figma and FigJam collaborations with your colleagues has never before been so easy. With Berrycast, simply hit the record button and add your spoken narrative. Your team will be more productive, and your message will be clearer than ever before.&nbsp;</p><p><br></p><p>Get started now &gt; berrycast.com.</p><p><br></p><p>Our mission is to make every second of your life more productive. We believe that starts with clear communications supported by the most appropriate tools.</p><p><br></p><p>Berrycast is a lightweight extension and native app combo that helps you share messages on your screen, using your voice and your face (both optional) to support your message. By clearly being able to show and articulate your user experience, viewers can learn and understand what you are trying to convey.&nbsp;</p><p><br></p><p>There’s no longer any need to download an app and then create a video that needs to be uploaded to YouTube. Create and share clear video messages in less time than it would take to type an email.&nbsp;</p><p><br></p><p>It takes 5 easy steps to Berrycast:</p><ol><li>Hit record</li><li>Strut your stuff (narrate if desired while showing the screen)</li><li>Stop the video</li><li>Copy the automatically-created URL</li><li>Share away!&nbsp;</li></ol><p><br></p><p>How can you use Berrycast to improve productivity? Let us count the ways.</p><p><br></p><ol><li><strong>Designs</strong>: As you iterate on your app’s design, recruit your teammates to provide feedback on their own time and at their own convenience. Easily highlight specific elements and narrate the feedback, preventing misunderstandings and confusion, and saving yourself from unnecessary and gruelling review meetings.</li><li><strong>Onboarding</strong>: Easily record hellos and welcomes to new teammates, communicate goals and progress, saving meeting times for real meetings. Using a new team collaboration tool? Teach your colleagues how to use the product with a quick Berrycast that can be watched at their convenience at varying speeds.</li><li><strong>Technical support</strong>: Got an issue with something? Record the issue, get the URL, and send it to your tech team to evaluate. This is also perfect for customers to communicate what design concerns they may be observing in your product to improve overall user experience.&nbsp;</li></ol>","url":"https://www.figma.com/community/plugin/1020727956315288661","iconUrl":"https://www.figma.com/community/plugin/1020727956315288661/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1020727956315288661/thumbnail"}
