{"id":"907012000809761240","name":"Strings - the UX writing tool","lastUpdateDate":"2021-08-31T16:42:48.922Z","publisherHandle":"strings","publisherImage":"https://www.gravatar.com/avatar/4f3dda2f6e79cceba63c83d135609e8d?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_j_v2.png","publisherId":"2501181","publisherName":"Jasper","description":"<p>Strings - UX writing software that saves time and improves products. Learn more how Strings can help your UX writing process:</p><p>&nbsp;</p><p>&nbsp;</p><h2><strong>Automated word check: Write consistently as a team</strong></h2><p><strong>&nbsp;</strong></p><p>This feature is like Grammarly but for your product. In our Word list you can capture the words and phrases you prefer to use as a team, and those you want to avoid. As you write in Figma, the Strings plugin flags any exceptions to your word list.</p><p>&nbsp;</p><p>How it works:</p><ol><li>Create your word list in our web app (app.strings.design).</li><li>Open the Strings plugin and go to the “Edit” tab, select a frame or text node you want to check.</li><li>Strings scans the text in your design for any inconsistencies against your word list.</li></ol><p>&nbsp;</p><p>Bonus: We also show <strong>readability scores</strong> to quickly check if your copy is easy to read for your audience (we use the Automated Readability Index - same as Hemmingway Editor).</p><p>&nbsp;</p><p>Learn more here -&gt;<a href=\"https://strings.design/how-it-works-word-list-check\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> Automated word check</a></p><p><br></p><p><br></p><h2><strong>Spell and grammar check</strong></h2><p><br></p><p>Making small mistakes can be a huge pain to fix later. Easily check your copy as you write in Figma.</p><p><br></p><p>We support the following languages:</p><ul><li><strong>Spell and grammar check:</strong> English, French, German, Portuguese, Spanish</li><li><strong>Spell check:</strong> Arabic, Asturian, Belarusian, Breton, Catalan, Catalan (Valencian), Chinese, Danish, Dutch, Esperanto, Galician, Greek, Irish, Italian, Japanese, Khmer, Norwegian, Persian, Polish, Romanian, Russian, Slovak, Slovenian, Swedish, Tagalog, Tamil, Ukrainian</li></ul><p><br></p><p><br></p><h2>Find and replace</h2><p><br></p><p>With this feature you can quick find and bulk edit copy across your Figma page. So if you need to change the same term or microcopy across your design file, you can do this with a few clicks instead of clicking through each text element.</p><p><br></p><p>It works similar to Find and replace features in commonly used word editor software.</p><p><br></p><p><br></p><h2><strong>Copy handoff to developers</strong></h2><p><strong>&nbsp;</strong></p><p>Ensure a clean copy handoff from design to production. Avoid copy/paste errors or developers using old copy. Your devs save time not having to click through Figma files to find copy - they get localization-ready code snippets for iOS (.strings), Android (.xml) and Web (nested JSON). You can also leave comments for your translators who can see everything in context of the visual designs.</p><p>&nbsp;</p><p>How it works:&nbsp;</p><ol><li>With the Strings plugin open, select the “Export” tab.</li><li>Select frames in Figma and use the plugin to upload them to the Strings web app.</li><li>In the Strings interface, you can add notes for developers and linguists next to images of the screens that contain the strings.</li></ol><p>&nbsp;</p><p>Learn more here -&gt;<a href=\"https://strings.design/how-it-works-copy-handoff\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> Copy handoff</a></p><p><strong>&nbsp;</strong></p><p><strong>&nbsp;</strong></p><h2><strong>Search and edit in-app copy (available on our web app)</strong></h2><p><strong>&nbsp;</strong></p><p>Unlock the ultimate source of truth for your copy -&gt; get access to in-code copy. Search and edit it with a few clicks.</p><p>&nbsp;</p><p>How it works:&nbsp;</p><ol><li>From your Strings account, install our GitHub app and link your string files. (No custom code integration needed.)</li><li>Search your product copy in code across all apps and platforms.</li><li>Edit copy easily.</li><li>Strings automatically submits the changes as a pull request back to GitHub for approval by your developers.</li></ol><p>&nbsp;</p><p>Learn more here -&gt;<a href=\"https://strings.design/how-it-works\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> In-app editing</a></p><p><strong>&nbsp;</strong></p><p><strong>&nbsp;</strong></p><p><strong>&nbsp;</strong></p><h2><strong>Learn more about Strings at </strong><a href=\"http://www.strings.design\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>www.strings.design</strong></a></h2><p><strong>&nbsp;</strong></p><p>We always love to hear your ideas and feedback on how to improve the product: contact@strings.design</p>","url":"https://www.figma.com/community/plugin/907012000809761240","iconUrl":"https://www.figma.com/community/plugin/907012000809761240/icon","thumbnailUrl":"https://www.figma.com/community/plugin/907012000809761240/thumbnail"}
