{"id":"970163435831759352","name":"UX User Journey Map Template","lastUpdateDate":"2021-05-02T05:06:51.582Z","publisherHandle":"nige","publisherImage":"https://s3-alpha.figma.com/profile/2d509ddb-0351-46da-8521-7143aa95b20b","publisherId":"1662142","publisherName":"Nigel","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/824481998/474ed800-43ba-4af4-bfc3-f59ca644ef2e-cover.png","description":"<h1><strong>UX User Journey Map Template </strong></h1><h2><strong>With auto-layout</strong></h2><p>Journey maps are a common UX tool. They come in all shapes, sizes, and formats. Depending on the context, they can be used in a variety of ways.</p><p><br></p><p>Most journey maps follow a similar format: at the top, a specific user, a specific scenario, and corresponding expectations or goals in the middle, high-level phases that are comprised of user actions, thoughts, and emotions;&nbsp;at the bottom, the takeaways: opportunities, insights, and internal ownership.</p><p><br></p><p>Read more about user journey mapping on the <a href=\"https://www.nngroup.com/articles/journey-mapping-101/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Nielsen Norman Group website</a>.</p><p><br></p><h2><strong>Add your info and you're done!</strong></h2><p>This template makes powerful use of auto-layout to make it easy to create a beautifully presented user journey map.</p><p><br></p><p>All you need to do is add your information. Nearly everything else is done for you. Thanks to the smarts of auto layout, the template will mostly take care of all of the formatting, spacing and alignment for you when you add new columns and rows, or duplicate blocks within a column.</p><p><br></p><p>The only section that requires manual adjustment (and good use of the pen tool) is 'Mindsets and emotions'.</p><p><br></p><h2><strong>Feedback and suggestions welcome</strong></h2><p>You are welcome to share, modify and remix this template however you wish. Do make sure you're familiar with the creative commons license around proper attribution and additional restrictions though!</p><p><br></p><p>I'd also love to know how else this template might be used and how it could be improved so more people can make use of it. This wouldn't be a true UX project without encouraging feedback and suggestions! So, if you're having trouble with the template, or if you've got suggestions for anything to add or change, let me know in the comments and I'll take it on board to keep improving this template.</p><p><br></p><p>If you <em>really </em>like my work, you could <a href=\"http://buymeacoff.ee/nige\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">buy me a coffee</a>.</p>","url":"https://www.figma.com/community/file/970163435831759352"}
