{"id":"1084047505675494342","name":"Poems","lastUpdateDate":"2022-03-29T14:34:28.601Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1705449111/ddb57e10-a381-4d7d-8248-498d5969f99b-cover.png","description":"<p>Poems (people, objects, environments, messages and services) is great to structure your field research during user and environment observations.</p><p><br></p><h2>Summary</h2><p>By&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/observation\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Observing</strong></a>&nbsp;the surroundings of your user you can learn a lot about them personally, the objects they use, the environment they’re living in, how and who they message and what services they use. The Poems method helps you to edit and structure all new information.</p><p><br></p><h2>Step-by-step</h2><ol><li>Recruit test candidates.</li><li>Use the Poems worksheet and fill-out the cells for each of the five subjects:</li></ol><ul><li><strong>People:</strong>&nbsp;Who are they in touch with? What are these people's roles, behaviours etc.</li><li><strong>Objects:</strong>&nbsp;With what devices, tools, helpers are the users interacting with?</li><li><strong>Environments:</strong>&nbsp;Where are the users spending their time and which effect does their surrounding have on them?</li><li><strong>Messages:</strong>&nbsp;Observe their messaging and communication behaviours. How do they communicate on a personal and professional level? What are their social interactions? What kind of language is being used?</li><li><strong>Services:</strong>&nbsp;Which frameworks, apps or services do they use? What do they use it for and why? How do they use it?</li></ul><p>3. Make sure to fill-out the Poems worksheet and pay attention to what is happening. Refer to the Observation method for more details.</p><p>4. When performing this method at a larger scale, you will start to develop an overview of the pain points and behavioural patterns. The interpretation is up to you and your team and depends on the potential of your product.</p>","url":"https://www.figma.com/community/file/1084047505675494342"}
