{"id":"1017379818245262817","name":"Webpixels Design System (Free)","lastUpdateDate":"2021-09-14T08:34:30.655Z","publisherHandle":"webpixels","publisherImage":"https://s3-alpha.figma.com/profile/8ee8e71b-584c-4182-9308-f244a068dcee","publisherId":"905445653561266410","publisherName":"Webpixels","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1123267532/d1f04193-03c7-4af7-acfe-8ea97095ac5d-cover.png","description":"<p>Webpixels Design System is a beautiful collection of styles, components, and templates for Figma professionally designed by Webpixels built to enable designers in creating modern user interfaces faster and better.</p><p><br></p><p>Whether you’re building a simple page or coming up with concepts for a whole new web app, we’ve prepared all the elements you need for an amazing development experience.</p><p><br></p><p>To achieve the best results on both sides, we took the time to create this awesome Figma kit to come in help. This way we can offer the same strong foundation and tools to the developers, and also the designers.</p><p><br></p><p>Upgrade to PRO and get access to the complete Figma Kit and 400+ fully-coded UI components and templates for websites, apps, and dashboards, all built with Bootstrap 5.</p><p><br></p><p><strong>Learn more:</strong><a href=\"http:// https://webpixels.io/pricing\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong> </strong></a><a href=\"https://webpixels.io/plans\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>https://webpixels.io/plans</strong></a></p><p><br></p><h2>Fully coded UI components</h2><p><br></p><p>Development is much more fun when you don't need to worry about design. With our component library and tools you can create diverse and beautiful websites that are supported by rock-solid design principles.</p><p><br></p><p>Speed up your development process by using our pre-built modules and already tested bits of code. Our component library includes over 400 fully responsive Bootstrap components, carefully designed for specific use-cases, like marketing, application, dashboards, and more. All you need to do is to install Webpixels CSS and start copying the items you like the most.</p><p><br></p><p><strong>Learn more: </strong><a href=\"https://webpixels.io/components\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>https://webpixels.io/components</strong></a></p>","url":"https://www.figma.com/community/file/1017379818245262817"}
