{"id":"1106149310841985649","name":"Pluralistic Walkthrough","lastUpdateDate":"2022-05-11T09:22:27.126Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856364236/2ce06f73-0639-4ddd-b58f-96bb0a743e19-cover.png","description":"<p>Review designs in an early stage with users.</p><p><br></p><h2><strong>Summary</strong></h2><p>With the help of the Pluralistic Walkthrough, problems in the usability of user interfaces are identified early in the design process by bringing together designers, developers, and users.</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>Invite users to a neutral space and brief them on the upcoming walkthrough. An expert, e.g. the software developer gives a short introduction to the product's key features as well as the concept in general.</li><li>Users are presented with specific tasks that they should complete using the products or services. They are then asked to explain how they would approach these tasks. Meanwhile, a team member takes notes on the statements, expectations, and hopes of the participants. This can also be done individually, for example, by having users write down their expectations on paper. The advantage here is that the users do not influence each other.</li><li>In the following, the results are discussed and sorted according to commonalities. If there are any questions regarding the users' notes, this is the moment when they can be clarified. Which expectations were not met? What do users want for features? Were there features that they liked? Was the user interface self-explanatory?</li><li>The team can prepare a questionnaire in advance, which they hand out to users after each task presented or discussed, to get certain defined questions answered.</li><li>After the users have been dismissed, the team discusses which recommendations for action have resulted for the product or service. These can be sorted according to their priority (e.g. by frequent mention) and aspects.</li></ol>","url":"https://www.figma.com/community/file/1106149310841985649"}
