{"id":"845512977962263995","name":"Kit de UX do Nando","lastUpdateDate":"2021-08-29T16:57:44.017Z","publisherHandle":"fernandolins86","publisherImage":"https://s3-alpha.figma.com/profile/c0ee4953-fb62-4141-8b17-7dc1b9e1c825","publisherId":"160280","publisherName":"Fernando Lins","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1087664142/b0a7d0d5-ae69-4e61-bcc7-0f94f8bf5ac9-cover.png","description":"<p>Este é um kit de UX e Descoberta de Produto feito do zero com auto-layout. O kit está completamente em Português do Brasil.</p><p><br></p><p>Contém/Contains:</p><ul><li>Notas adesivas / Post-its.</li><li>Avatares / Avatars.</li><li>Lista de Participantes / Participants List.</li><li>Lista de Afazeres / To-do List.</li><li>- Tíquetes de votação e feedback / Voting and feedback tokens.</li><li>Elementos e etiquetas para desenhar fluxos de navegação e interação / Elements and tags for user and navigation flows.</li><li>Etiquetas de Persona / Persona tags.</li><li>Blocos de wireframe (básico)</li><li>Modelos de uso dos componentes</li></ul><p><br></p><p>COMO USAR:</p><p>1. Duplique este arquivo no botão \"Duplicate\" nesta página</p><p>2. Abra o arquivo duplicado no seu Figma e vá até a página \"Elementos\"</p><p>3. Copie esta página e todos os seus elementos para um projeto ou biblioteca sua.</p><p>4. Duplique os itens que precisar em outras páginas do seu projeto para usar como instância.</p><p>5. Se quiser customizar algum elemento do kit, faça-o nos componentes principais que você copiou do kit. As alterações feitas nestes componentes se propagarão para todas as instâncias neste projeto.</p><p><br></p><p>Atualização 29/08/2021 (2.1) -</p><ul><li>Adição de Slider para wireframe</li><li>Adição de bloco de texto para wireframe</li><li>Adição de cabeçalho de acordeão para wireframe</li><li>Adição de tabelas customizáveis para wireframe</li><li>Adição de ícones de download e upload</li><li>Adição de ícones de playback (play, pause, stop)</li><li>Adição de ícone de menu (hambúrguer)</li><li>Adição de um tom novo de cinza (Alumínio)</li><li>Todos os componentes para wireframes agora usam tons de cinza do Kit</li><li>Ícones de chevron próximo e anterior foram renomeados para direita e esquerda</li><li>Alguns elementos estavam com a cor correta mas sem usar a cor do kit, foram corrigidos</li></ul><p><br></p><p>Novidades 23/05/2021 - v2.0:</p><ul><li>Todos os componentes foram reestruturados com autolayout mais recente e variações</li><li>Itens de Wireframe foram atualizados</li><li>Modelos novos mais limpinhos</li><li>Visite a página de Elementos para ver todas as novidades</li></ul><p><br></p><p>Novidades 08/10/2020 - v1.2:</p><ul><li>Adicionados alguns itens de Wireframe para ajudar no desenho de fluxos rápidos</li><li>Adicionados blocos (Fluxos/Bloco A) sem função definida que podem ser utilizados em organogramas, mapas de site, fluxos e outros.</li></ul><p><br></p><p>Novidades 06/08/2020 - v1.1:</p><ul><li>Adicionados modelos de fluxos e blocos de post-its para agilizar sessões (em Modelo/)</li><li>Adicionadas setas de bifurcação (em Setas/)</li><li>Adicionadas personas para Stakeholder, Entrevistador e Entrevistado (em Personas/)</li><li>Adicionado Interrupção de Fluxo (em Fluxo/)</li><li>Alguns ajustes de alinhamento, auto-layout e redimensionamento foram feitos a alguns elementos.</li></ul>","url":"https://www.figma.com/community/file/845512977962263995"}
