{"id":"903782092638332568","name":"Webflow Project settings icon generator for Figma","lastUpdateDate":"2020-10-29T23:07:22.479Z","publisherHandle":"itsdailyin","publisherImage":"https://www.gravatar.com/avatar/8034e6a972ab0cad5fa8a339394fb18a?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_t_v2.png","publisherId":"298661","publisherName":"Tom Green","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/521265263/460d6516-85aa-48ee-b9af-c71727453879-cover.png","description":"<h3><strong>Use this Figma file to preview and export ready to use icons in Webflow Project settings.</strong></h3><p><br></p><p>Here's a quick video overview of the main features:</p><p>https://www.youtube.com/watch?v=U6UClEdqmrU</p><p><br></p><p>When you're designing a new website in Webflow, you need to upload two images in different dimensions. One is used as a site favicon image, and the other as a web clip icon on your phone home screen.</p><p><br></p><p><strong>A typical workflow steps:</strong></p><ul><li>Go to your project files</li><li>Find the logo</li><li>Open vector or some other image editing software</li><li>Tweak the image</li><li>Export.</li><li>Two times. Because you need 32x32px and 256x256px version.</li></ul><p><br></p><h4><strong>So I've made this simple Figma file that helps you with that.</strong></h4><p><br></p><p>All you need to do: place your logo inside of the main logo component in Figma. You'll see an instant preview of how your icon will look like in Webflow project settings, on the phone home screen, and in a browser tab!</p><p>Now,&nbsp;tweak your icon. Since it's made as a Figma component — you'll see live a preview as you tweak it — how it will look in the Project settings panel, in a browser as a favicon + on the phone screen.</p><p><br></p><p>When you're ready, use predefined export settings in the Figma export panel. I've added .jpg and .png file formats in 32x32px and 256x256px resolution in export settings.</p><p><br></p><p><strong>Your workflow after.</strong></p><ul><li>Import your logo into the Figma component</li><li>Tweak it</li><li>Export required files — done!</li></ul><p><br></p><p>Simple as that!</p><p><br></p><p><strong>Plus, you can change your browser appearance and wallpaper!</strong></p><p>While your component instance is selected, click in the Figma Design panel and swap browser + wallpaper instance (Dark and Light versions included!).</p><p>Hope this helps and will save you some time!</p><p><br></p><p><strong>P.S. Small bonus:</strong>&nbsp;project name and subdomain text are also editable + I've included top wallpapers from Series 1 and 2 wallpapers.</p>","url":"https://www.figma.com/community/file/903782092638332568"}
