{"id":"857282333770086337","name":"Hide Layer from Instances","lastUpdateDate":"2020-06-26T07:02:54.535Z","publisherHandle":"qubecinema","publisherImage":"https://s3-alpha.figma.com/profile/a77f86fc-acdc-41ca-ab5a-f5a5bd5f8907","publisherId":"4276396","publisherName":"Qube Cinema","description":"Iterations always demand new additions to components. All of us have encountered cases where we need to add something to a component but don’t want that to show up in all the hundreds and thousands of existing instances. We finally end up creating a new component so that the existing work is not affected. This plugin solves this issue with a single click.\n\nFollow these steps to hide a particular layer from all component instances\n• Select the layer/group/frame that you want to hide from one of the instances of a component\n• Select Hide Layers from Instances -> Hide\n• The selected layer/group/frame will be hidden from all instances in the current page\n\nUse the Force Hide option if the layer that you want to hide is part of a component that is nested in multiple other components and you want to hide the layer in all of them at once.\nEg.: If you want to hide a layer in an icon component that is already used in various other components like different state and sizes of buttons, then Hide option will just hide the layer in the selected state or size of the button. Whereas Force Hide will hide the layer in all the instances of all the components that this icon is used.\n\nThis plugin works only on instances and not on components\nCAUTION: When using the Force Hide option. ensure that the name of the layer you are hiding is unique. If not, multiple layers may get hidden.\n\nFeels too small a feature for a plugin? There is also a Scripter File for this that you can use. https://www.figma.com/community/file/858014268242545394/Hide-Layers-from-Instances\n\nDo let us know if you want any additional features. We'll try adding it. Cheers! :)","url":"https://www.figma.com/community/plugin/857282333770086337","iconUrl":"https://www.figma.com/community/plugin/857282333770086337/icon","thumbnailUrl":"https://www.figma.com/community/plugin/857282333770086337/thumbnail"}
