{"id":"890698367651209301","name":"Actionable Persona template","lastUpdateDate":"2020-09-23T20:37:19.317Z","publisherHandle":"iamdanandrews","publisherImage":"https://s3-alpha.figma.com/profile/7f0710b9-0b28-4627-9a9b-ed0174363243","publisherId":"1692138","publisherName":"Daniel Andrews","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/468168891/1609dcc8-151f-4874-a93f-fd337613e01c-cover.png","description":"<p>I thought I'd share some persona templates which I recently used for a project. Details have been replaced with Pirate Ipsum of course :P</p><p><br></p><p>Personas get a bit of a bashing sometimes (as with lots of documentation) but I find them particularly useful when starting a new project or when trying to consolidate insights, notice new themes and perhaps conflicting information.</p><p><br></p><p>Another reason I think they are seen as having limited use is that a lot of the templates or examples I see focus too much on generic biographies or arbitrary scaling which can't really be used. There is certainly value here if you are very early on in a project, or trying to build on a storytelling narrative. However, I think we can make them more useful, and actionable.</p><p><br></p><p>As the examples show, I place the emphasis on 'pain', 'wants', 'needs' and in this case 'further questions'. Nothing more. I've left a section at the bottom with notes relevant to the research. In this case, noting the sample size, and confidence level in the characterisation.</p><p>The final reason, I think they are sometimes looked down upon, is because some companies may have 'so many personas', or they find the needs changing frequently. Humans can be are complex and its sometimes hard to accept common characteristics and traits. Nevertheless, I would still believe there lies utility in documentation to note the changes and build buy-in and empathy in the team.</p><p><br></p><p>You can download, customise as each project necessitates. I'd love to hear how you get on with it and what you have been using with your team.</p><p><br></p><p>Give me a ❤️ on dribbble if you find them useful!</p><p><br></p><p>https://dribbble.com/shots/14254407-Persona-template-Figma-Freebie</p>","url":"https://www.figma.com/community/file/890698367651209301"}
