{"id":"1082685165266043759","name":"Rasterize me!","lastUpdateDate":"2022-04-06T16:32:58.068Z","publisherHandle":"artlavrik","publisherImage":"https://www.gravatar.com/avatar/4d08adbd7e6ddfc6ceeda785814152e2?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_s_v2.png","publisherId":"941303031296110820","publisherName":"Stas L.","description":"<p><strong>In just 2 clicks,</strong> you can rasterize <strong>all </strong>the elements that are inside the Figma file. <strong>The plugin will be useful for each designer </strong>who is afraid to give Figma link for his work to an unverified customer!</p><p><br></p><p><strong>How it works?</strong></p><p>1. Install Rasterize Me!</p><p>2. Make a duplicate of the file you want to show to the customer</p><p>3. Open duplicated file</p><p>4. Open plugin settings and select image quality (x1, x2, x3, x4)</p><p>5. Apply the plugin to a current page or to the all Figma file</p><p>6. Wait from 10sec to 10min, the time depends on the number of files / pages inside.</p><p>7. Done ✅</p><p>Now you can feel free to share the link to everyone you want and be sure that no one will steal work or use your fonts/styles/components without your knowledge!</p><p><br></p><p>Video tutorial will be uploaded soon, stay tuned!</p><p><br></p><p>The team Stas Lavrik Design are happy to hear any feedback from the community in comments. Thank you for attention!</p><p><br></p><p>p.s. Our team is working on optimizing the plugin, if you have not rasterized ALL frames - repeat the procedure again, the plugin itself will calculate what is not an image and corrects the situation.&nbsp;</p><p><br></p><p>The speed of plugin depends on the speed of your internet and the power of your device which is used for rasterization.</p>","url":"https://www.figma.com/community/plugin/1082685165266043759","iconUrl":"https://www.figma.com/community/plugin/1082685165266043759/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1082685165266043759/thumbnail"}
