{"id":"1077802140349190531","name":"All about the way to Quinault Valley","lastUpdateDate":"2022-02-22T04:00:55.007Z","publisherHandle":"aviciied","publisherImage":"https://www.gravatar.com/avatar/4876e2832b8209b77441e5fc27b14344?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_b_v2.png","publisherId":"1077800943117014441","publisherName":"Bellamy Ryder","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1580033247/cca462be-96dd-4b70-8398-e5ff9f088e47-cover.png","description":"<p><strong>Quinault is located in the park's southwestern corner, about three hours from Port Angeles and one hour from Forks. Get&nbsp;</strong><a href=\"https://mapdrivingdirections.io/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>mapquest driving directions</strong></a><strong>&nbsp;to Quinault Valley!</strong></p><p><br></p><p>Quinault Valley is home to some of the world's largest trees, including Sitka spruce, Douglas fir, Western red cedar, and Western hemlock. Stretch your legs on the trails and say hello to the 191-foot-tall, thousand-year-old big Sitka spruce. For those with limited time, the Rain Forest Loop Drive is an excellent option for taking in the scenery. Keep an eye out for Roosevelt elk!</p><p>The Quinault Valley has two campgrounds: the North Fork campground has 9 campsites and the Graves Creek campground has about 30.</p><p><br></p><p><strong>There are also a number of lodging options in the surrounding area.</strong></p><p><br></p><p>The Quinault Rain Forest Ranger Station is a good place to start. There is a 1.3-mile loop to the old Kestner homestead, as well as another that winds through bigleaf maple groves.</p><p><br></p><p>Longer hikes in the Olympic Wilderness follow the North Fork Quinault River to the Low Divide or the East Fork Quinault River to the historic Enchanted Chalet.</p><p><br></p><p><strong>Areas Nearby:</strong></p><p>Queets is only a short drive away to the west. Kalaloch is a little farther away, about 35 miles. Make sure to check out the&nbsp;<a href=\"https://mapdrivingdirections.io/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://mapdrivingdirections.io/&nbsp;</a>page for distances to various park destinations.</p>","url":"https://www.figma.com/community/file/1077802140349190531"}
