{"id":"1106151112845454967","name":"Worst Possible Ideas","lastUpdateDate":"2022-05-11T09:29:36.764Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856355691/554f111c-c0d0-444c-93b8-db5dd9d9d70d-cover.png","description":"<p>The ultimate permission to have a terrible idea to come up with meaningful ideas in a fun way.</p><p><br></p><h2><strong>Summary</strong></h2><p>The compulsion to come up only with ideas that are as innovative and cool as possible can hinder many people in <a href=\"https://uxtoolkit.merck.design/methods/brainstorming\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">brainstorming</a>. The Worst Possible Ideas method (also known as “negative brainstorming”), on the other hand, gives creative minds the freedom to express all their crazy ideas and thus lightens the mood. Especially as a prelude within a new working group, or at the beginning of a design process, this method is helpful, as it boosts creativity and relaxes the participants. As the name of the method already suggests: in this working method everything is allowed, there are no taboos. Everyone is allowed to present any idea, no matter how crazy, full of self-confidence.</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li><strong>Brainstorm:</strong> There are different ways to generate the worst possible ideas: in several teams, in one team or in individual work. It is important that each participant has the chance to contribute his or her ideas. For this purpose, the ideas can first be recorded in writing in short individual work. A timer helps to ensure that the generation of ideas does not get out of hand.</li><li><strong>Share:</strong> The next step is to present the ideas that have just been generated to each other. In a larger working group, it might make sense for one person to take on the role of moderator so that the speaking shares are more or less equally divided. To get a better overview, all ideas can be collected on post-it’s, for example on an online whiteboard like <a href=\"https://www.figma.com/figjam/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">FigJam</a>.</li><li><strong>Discuss:</strong> Ask questions as: Why is an idea bad? Does it involve illegal activities? Is it a topic that is treated as taboo in society? Is it awful, gross or just stupid? Which of the collected ideas is by far the worst and why?</li><li><strong>Reverse:</strong> Can some of the bad ideas be turned into positive ones so that they create added value? What would be the exact opposite of these bad ideas? Is it possible to combine two or more of the ideas to create added value? Is there a way to replace the worst attribute of the worst idea with something else? The goal is to improve, modify, or merge the ideas discussed so that new approaches emerge which could make perfect sense.</li></ol>","url":"https://www.figma.com/community/file/1106151112845454967"}
