{"id":"1042436430698322448","name":"CI HUB Connector","lastUpdateDate":"2021-11-16T13:58:06.837Z","publisherHandle":"cihub","publisherImage":"https://s3-alpha.figma.com/profile/b6179d29-90a2-4855-a7b4-d320debbaa6a","publisherId":"1039648190743660914","publisherName":"CI HUB Connector","description":"<p>Add images/text to your designs directly from wherever they are, directly in Figma.</p><p>Access Stock Images or use your workflow for approval.&nbsp;</p><p>Share with your Team. in Dropbox or Google Drive and more.</p><p>And never leave Figma.&nbsp;</p><p><br></p><p>Supports already: Adobe CC Library, Adobe Lightroom, Adobe Stock, Adstream, Aprimo, Box, Brandfolder, Brandmaster, Brandworkz, Bynder, Celum, Censhare, Cliplister, Dash, Dropbox, Eyebase, Fadel, Fotoware, Gelato, Getty Images, Google Drive, Google Photos, Imageshop, Istock, Keepeek, Myview, OneDrive, Opentext, Picturepark, Pimcore, Pixelboxx, Purered, Sharedien, Sharepoint, Shutterstock, SiteFusion, Unsplash, Veeva, Webdam, WIden, Workfront</p><p><br></p><p><em>This is not an official plugin created by Google or Microsoft or any other• It is simply created with </em>❤️<em> by CI HUB</em></p><p><br></p><p><strong>STEP 1:</strong></p><p>Install the Plugin</p><p><br></p><p><strong>STEP 2:</strong></p><p>Setup your CI HUB ID at <a href=\"https://ci-hub.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://ci-hub.com</a></p><p><br></p><p><strong>STEP 3:</strong></p><p>Connect to where your Files are and start using.</p><p><br></p><p>--------</p><p><br></p><p>Visit our CI HUB Academy to learn how to save time in Figma: <a href=\"https://docs.sheetssync.app/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://ci-hub.com/academy/</a></p><p><br></p><p>--------</p><p><br></p><p><strong>Free Trial, and Subscription Payment:</strong></p><p>All first-time users receive a 30-day free trial upon registration/creation of a CI HUB ID.</p><p>Payment via credit card is required upon the conclusion of the trial period to continue use. VISIT https://ci-hub.com for all the latest pricing and details. Corporate plans are available on request at sales@ci-hub.com.</p><p><br></p><p><strong>Important Notes:</strong></p><p>To use the CI HUB Connector to connect to one of the offered third party systems, you may need a login/user account with the selected system. The availability and/or the right to connect to the third-party system is not part of the CI HUB Connector or the CI HUB Services. To use the third-party system, there may be additional cost and/or agreements with the provider of the third-party system needed. CI HUB reserves the right to remove the third-party system from the list of avail. systems or add new third party systems at any time and without notice. To use CI HUB Connector, a full connection to the Internet is required at all times. (Corporate setups with Proxy or Firewalls on request)</p><p><br></p><p>To see Demo-Video, Tutorials and more go to https://ci-hub.com/ci-hub-how-to-tutorial/ or visit our Youtube Channel.</p><p><br></p><p>We are always here to help you! Let us know any issue, suggestion or feedback: support@ci-hub.com</p>","url":"https://www.figma.com/community/plugin/1042436430698322448","iconUrl":"https://www.figma.com/community/plugin/1042436430698322448/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1042436430698322448/thumbnail"}
