{"id":"1066989580499138126","name":"UI workflow","lastUpdateDate":"2022-01-23T08:43:32.085Z","publisherHandle":"amandeepsingh","publisherImage":"https://www.gravatar.com/avatar/0b26cf30ff3484877f54002009b689c3?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"1386602","publisherName":"amandeep singh","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1482648336/74ffe69e-dddd-4fba-a66c-4cd06eed9cc9-cover.png","description":"<p>The core intent behind sharing this mindmap (living ecosystem) is to help peers, friends and community in UX space to jumpstart your UI workflow by 10x and adhere to the most appropriate design principles!</p><p><br></p><p>Through this file, you would be able able to easily navigate and find the most appropriate guidelines, resources to help you:</p><ol><li><strong>Stay organized with your design files </strong>so that you don't get overwhelmed with scattered canvas and waste ample time just to find something for you or even, stakeholder review</li><li><strong>Know laws of UX &amp; usability heuristics </strong>ever since, these principles are almost necessary at every fold whilst designing screen flows, variants</li><li><strong>Follow UI guidelines because whatever it is: </strong>you can't escape from guidelines set forth by apple or android when designing UI for precisely mobile/tablet form factors</li><li><strong>Adopt a smarter way</strong> to 10X your workflow and enhance your productivity and efficiency through design systems or icon libraries (Spoiler: Don't get overwhelmed and pick up the best ones that suit your rigour and understanding :))</li><li><strong>With usability cues </strong></li><li>Quick flow chart to help you navigate and not be overwhelmed, in case you are <strong>presented with unclear scope/requirement </strong></li></ol><p>And much more..</p><p><br></p><p><code><strong>Note: If you see any errors or feel there's correction required or even updates to help community at large, Do ping me </strong>and I will make changes accordingly and update in the next changelog.</code></p><p><br></p><p><strong>Keep learning and upskilling!</strong></p>","url":"https://www.figma.com/community/file/1066989580499138126"}
