{"id":"1084046737618062276","name":"Eisenhower Matrix","lastUpdateDate":"2022-03-29T14:37:07.629Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1704011397/c87b6d27-ae03-4a68-8154-c67cdc64303c-cover.png","description":"<p>Sort tasks by importance.</p><p><br></p><h2>Summary</h2><p>Former American president Dwight D. Eisenhower invented the so-called Eisenhower Matrix to sort to-dos according to their importance. The matrix compares the urgency of the tasks with their importance. The important and at the same time urgent tasks have to be completed immediately, a deadline has to be found for the completion of important but not urgent to-dos, non-important but urgent tasks have to be delegated and last but not least neither urgent nor important to-dos have to be eliminated. The goal is to stop endless to-do lists and work more effectively.</p><p><br></p><h2>Step-by-step</h2><ol><li>Keep the collection of all to-dos ready. When working with the Eisenhower Matrix analog, the to-dos can be transferred to post-it's in advance. Otherwise, the matrix can also be filled in digitally, or collaboratively using software such as FigJam.</li><li>Now the sorting of the tasks within the matrix can start. When working in a team, these decisions should be discussed so that each team member agrees with the placement. Tasks that end up in the \"not important and not urgent” column can be eliminated immediately after the session.</li><li>Internalize the positioning of the upcoming tasks and make sure that they are processed according to their urgency and importance. If you want to have the to-dos in front of your eyes at all times, print out the matrix and hang it in the workspace. This way, completed tasks can be removed and new tasks can be added and arranged.</li></ol>","url":"https://www.figma.com/community/file/1084046737618062276"}
