{"id":"1053790655021729426","name":"Figma to React Native","lastUpdateDate":"2022-03-04T18:13:15.548Z","publisherHandle":"erisvaldojunior","publisherImage":"https://www.gravatar.com/avatar/eeeb761859b5a34ff29f8c0576f663a3?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_e_v2.png","publisherId":"3004476","publisherName":"Erisvaldo Junior","description":"<p><strong>All in One Figma to React Native plugin. Design Tokens + Code Generation + Sync with GitHub in one single plugin!</strong></p><h2><br></h2><h2><strong>✅ Features</strong></h2><ul><li><strong>Import Figma Styles into Design Tokens</strong> like Color Styles, Text Styles, Effect Styles and Grid Styles.</li><li><strong>Batch edit Figma Properties using Design Tokens.</strong> Choose a token and update all Figma linked properties at once.</li><li><strong>Generate React Native code for any selected Figma Node.</strong> If you are using Auto Layout, generate responsive / usable React Native code for any Figma Node you select (i.e. an entire screen/frame or just a container). Choose between StyleSheet, Restyle (including Restyle Theme) and styled-components libraries for the generated code.</li></ul><h2><br></h2><h2><strong>✅ How does it work?</strong></h2><ul><li><strong>First, create as many Figma Styles as you want and use them on your Figma Document. </strong>Once you open the plugin, it will automatically convert them into Design Tokens and you will be able to export them to JSON or directly send to a GitHub repository.</li><li><strong>On the plugin UI, create as many custom Design Tokens as you want.</strong> Create tokens for sizes, spacing, borders etc, link them to Token Groups (you can also create groups like Sizes, Spacing, etc) and they will be also exported to code whenever you want.</li><li><strong>On the plugin UI, link your tokens to Figma properties.</strong> When the plugin is opened and you select a Figma Node (like a Frame representing a screen), you can see all node properties on the Properties Tab. Link any of those properties to any of your Design Tokens (i.e. paddingBottom to a XL Spacing token, for example). Later you will be able to change your token value and update all linked properties at once.</li><li><strong>Where is the plugin data stored?</strong> All the plugin data is stored as part of the Figma document / file. The data you see when you open the plugin depends on which document is opened at the moment (current page doesn't matter).</li><li><strong>Who can see my Design Tokens?</strong> If you have a team of designers and developers, anyone that access the same document and open the plugin inside it will be able to see and update the tokens (including properties linked tokens).</li></ul><p><br></p><h2><strong>🚧 Roadmap</strong></h2><ul><li>Support StyleSheet code generation</li><li>Support Restyle code generation (currently only theme code is generated properly)</li><li>Smart Tokens (ability to use percentage and math expressions to token values)</li><li>Auto update Figma when tokens are changed</li></ul>","url":"https://www.figma.com/community/plugin/1053790655021729426","iconUrl":"https://www.figma.com/community/plugin/1053790655021729426/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1053790655021729426/thumbnail"}
