{"id":"791262205400516364","name":"Theemo - Style Automator","lastUpdateDate":"2020-06-07T12:13:14.648Z","publisherHandle":"gossi","publisherImage":"https://s3-alpha.figma.com/profile/a58acd57-5569-459a-be44-7f170846a4f3","publisherId":"891","publisherName":"Thomas Gossmann","description":"Tired of update styles that reference another one? This plugin will do it for you!\n\nThis plugin will let you do this:\n\n1. Manage style references on a selected node\n2. Auto-update all references as you change origins (keep the plugin open for this)\n3. Export references to make it available for third-party consumers\n4. Switch contexts\n\n# 1. Manage References\n\nSelect a node for which you want to manage references, eg. a rectangle. Open the \"Style References\" plugin and a dialog will appear that let you do it. Currently these styles are supported:\n\n- Fill Style\n- Stroke Style\n- Effect Style\n\nFor each of those there is a section in the dialog where you can manage the origin style to the reference.\n\n- **Origin** That's the _original_ style.\n- **Reference** That's the style to which the origin is copied over when references are updated.\n\n## Transforms\n\nFor paint styles (Fill and Stroke) transforms are available. When styles\nare referenced from origin to reference you can put transforms in between.\nAvailabe are HSL + Opacity values. They will be applied during\nreferencing.\n\nUse this to automate your color palette. Make one color swatch for your\nbase value (e.g. \"Brand / 500\"). A darker color would take your base value as\nreference and set lightness to \"-20\" - name it for example \"Brand / 300\".\n\n# 2. Export\n\nYou can export your references to jsonbin.io and by that make it available for third-party consumers, e.g. if you want to update your design tokens in your code. Here is how:\n\nEnter credentials in settngs:\n\n1. Create an account and copy the API Key\n2. Create a bin and copy the bin URL\n\nOn the tools tab the `Export Settings` button becomes available. Clicking the button will export your references.\n\n# 3. Import\n\nYou can import your earlier exported references from jsonbin.io. That is really helpful when you duplicated your document - figma will not copy over your stored references. Here is how to import references:\n\n1. Duplicate a document\n2. Open the old document, open the plugin, go to settings and copy the Bin URL\n3. Go the new new document (the plugin should still be opened), paste the URL into the input for import and click the button next to it.\n4. A notification will appear telling you how much references were imported.\n5. You can work with your new document the same way as the old one now - win!\n\n# 4. Contexts\n\nContexts are a lightweight way to organize various theme modes within one document. E.g. if you have light and dark mode in one document, you may want to give styles for respective styles a specific suffix, e.g. `.$dark` - With defined contexts, you can swap between them quickly and then use Themer to export them.\n\n## Workflow Suggestion\n\nUse it in combination with Themer:\n\n1. Set your variants for each context (`§light` and `§dark`)\n2. Select a context\n3. Use `Style References` to map those \"compiled\" styles\n4. Use `Themer` to export and apply them\n\n### Things to Know\n\n- When setting the origin style the suggestions only show local styles, that is also due to limitations of the current figma API, given security reasons for shared team libraries. That's fair - figma keeps us safe, give them credit for that :)\n\nIt still is possible to use library styles, then you can't use the style references manage dialog, instead manually assign those style and THEN use the style references dialog in order to persist it.\n\n- Once you have one node \"under management\", you may want to change the local style but once you update references, those new ones will be overridden. Re-select the node again and the references dialog will provide you options for migrating styles, to either keep the old one or use the new one.\n\n- Once you link origin to reference the node itself will show the reference as its local style, which might give you wonders, yet is expected and the correct behavior.","url":"https://www.figma.com/community/plugin/791262205400516364","iconUrl":"https://www.figma.com/community/plugin/791262205400516364/icon","thumbnailUrl":"https://www.figma.com/community/plugin/791262205400516364/thumbnail"}
