{"id":"1072922888701184583","name":"Localize","lastUpdateDate":"2022-04-08T17:33:07.541Z","publisherHandle":"localizejs","publisherImage":"https://www.gravatar.com/avatar/a1be792d72eb5ccc1777e3712db40594?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_j_v2.png","publisherId":"4152723","publisherName":"James Binns","description":"<h2><strong>Localize Your Figma Designs in Minutes</strong></h2><h2><br></h2><h2><strong>Let your designs speak for themselves. Effortlessly translate your Figma creations into other languages.</strong></h2><h2><br></h2><p>Showcase your designs in front of the largest audience possible. Localize seamlessly integrates with Figma allowing you to amplify your work’s impact by making it accessible to more people and languages.</p><p><br></p><p>Unlike run-of-the-mill translators, Localize offers designers an easy and elegant solution that:</p><p><br></p><ul><li>Takes the hassle out of internationalization (i18n) and localization (l10n) processes</li><li>Automates and streamlines localization workflows right in the design phase</li><li>Reduces content translation complexities by eliminating the need for development resources</li><li>Maximizes ROI by speeding up time to market</li></ul><p><br></p><p>Localize empowers you to create globally-inclusive UI and UX designs, expanding the appeal and reach of your work by presenting them in the languages of your target markets.</p><p><br></p><h2><strong>Localization as easy as 1, 2, 3</strong></h2><h2><br></h2><ol><li><strong>Install Plugin.</strong> Go to the Community section on Figma’s website. Select Plugins and use the search functionality to locate Localize. Select Install on the top-right corner of the Localize plugin page.</li><li><strong>Connecting to Localize.</strong> Once installed, access Localize via the Plugins dropdown.</li><li><strong>Enter your API Key.</strong> Start a Localize free trial or integrate with your Localize Business plan (or higher) by entering the API key.</li></ol><p><br></p><p><strong>I already have a Localize Business plan or higher account:</strong></p><p><br></p><ol><li>Install the Localize plugin in Figma.</li><li>Open your Figma file.</li><li>Hover over Plugins in the toolbar. Select Localize.</li><li>Type in your Localize API key. Select Connect.</li></ol><p><br></p><p><strong>I don’t have a Localize account yet:</strong></p><p><br></p><ol><li>Install the Localize plugin in Figma.</li><li>Open your Figma file.</li><li>Hover over Plugins in the toolbar. Select Localize.</li><li>Click the Start Your Free Trial link on the bottom of the login view.</li><li>Create a Localize account and follow the Localize install steps.</li><li>Return to Figma and type in your Localize API key. Then, select Connect.</li></ol><p><br></p><p>If your organization doesn't have a Business plan or higher, <a href=\"https://app.localizejs.com/settings/organization/billing\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">please click to upgrade your plan!</a></p><p><br></p><p><strong>Need help?</strong></p><p><br></p><p>For more information and to learn how to install the plugin, visit our<a href=\"https://help.localizejs.com\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"> Help Docs</a></p><p><br></p><p>Don’t have a Localize account?<a href=\"https://app.localizejs.com/signup\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"> Try it for free!</a></p>","url":"https://www.figma.com/community/plugin/1072922888701184583","iconUrl":"https://www.figma.com/community/plugin/1072922888701184583/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1072922888701184583/thumbnail"}
