{"id":"1101944648482192724","name":"GitHub","lastUpdateDate":"2022-05-10T21:11:19.347Z","publisherHandle":"ymichael","publisherImage":"https://s3-alpha.figma.com/profile/8abf5cc8-6bf2-41f5-a869-b52857825732","publisherId":"4353268","publisherName":"Michael Yong","description":"<p>Go from brainstorming and bug bashing to building with fewer steps in between with the GitHub widget for FigJam. GitHub and Figma work together to help teams move project work forward—no matter which tool they’re in.</p><p><br></p><p>In FigJam, you can use the GitHub widget to pull GitHub issues onto the canvas to discuss and update as a team. And, if new to-dos come up in a meeting, you can capture them on stickies and then instantly convert them to issues in GitHub.</p><p><br></p><p>Get started with the GitHub widget for FigJam:</p><ol><li>Click “Install” at the top right of this page</li><li>Open a FigJam file</li><li>On the tool bar, click the button at the far right and search for “GitHub”&nbsp;</li><li>Select the GitHub widget to insert it into your document</li><li>Sign into your GitHub account via the prompt</li><li>To bring a GitHub Issue into FigJam, select “Import issue” on the widget and paste in the URL of the issue you’d like to import</li><li>To turn stickies into GitHub issues, select one or more stickies, then select “Convert selected stickies to issues” on the widget</li></ol><p><br></p><p>Learn more about how to use this widget with your team and try it out for yourself in this playground file: <a href=\"https://www.figma.com/community/file/1103764168304142262/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://www.figma.com/community/file/1103764168304142262/</a></p><p><br></p><p>---</p><p>The GitHub widget is licensed under <a href=\"https://www.figma.com/tos/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Figma’s Terms of Service</a>, unless you have a different agreement with us for Figma Services, and any use of GitHub is subject to your agreement with GitHub.</p>","url":"https://www.figma.com/community/widget/1101944648482192724","iconUrl":"https://www.figma.com/community/widget/1101944648482192724/icon","thumbnailUrl":"https://www.figma.com/community/widget/1101944648482192724/thumbnail"}
