{"id":"1084047099416958917","name":"Competitive Analysis","lastUpdateDate":"2022-03-11T09:36:09.248Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1641183438/11abb2dd-fbb2-4a01-a3c5-c1745af9459e-cover.png","description":"<p>Evaluate the competition.</p><p><br></p><h2>Summary</h2><p>To offer users added value and stand out from the market, existing brands, services, or products that are potentially in competition with the company's concept must be analyzed. This analysis also shows competitors’ possible weaknesses and how these could be turned into strengths in a new service or product.</p><p><br></p><h2>Step-by-step</h2><ol><li>Who are the competitors? Why are they competitors? What are their goals, methods, and features? The list of competitors should add up to five at least. The more competition the better. If not enough competitors can be found quickly, then it is probably because not enough research has been done. This may take a moment, but it is worth it, as your product or service can be strengthened by the weaknesses of the competition.</li><li>Are the competitors indirect or direct? An indirect competitor has the same target group but advertises with a different value proposition. On the other hand, a direct competitor has both the same target group and the same value proposition. Try to cluster the competitors, for example, by characteristics, strengths, and weaknesses. Use the Competitive Testing worksheet to sort your findings.</li><li>Evaluate and summarize your results by formulating a conclusion about the Competition Test. Can you determine which brand, service, or product represents the greatest competition? Are there any less threatening competitors on the other side? Have they come to a surprising realization? Specify the interval at which the research on existing competitors should be refreshed. It makes sense to perform the tests periodically. The following areas can be observed: the business model, financial resources, growth, marketing share, market strategies, profitability, strengths, and weaknesses.</li></ol>","url":"https://www.figma.com/community/file/1084047099416958917"}
