{"id":"1084035801664243632","name":"User Testing","lastUpdateDate":"2022-03-11T08:51:15.674Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1640983881/502cc9f2-239a-479a-b79a-3bc42e34b33a-cover.png","description":"<p>Understand how user-friendly your product is.</p><p><br></p><h2>Summary</h2><p>User Testing (also known as Usability Testing or User Experience Testing) means the testing of your product with real users from your target group. It is important to highlight that you are not testing the users. You are rather using their feedback to improve on your product.</p><p><br></p><h2>Step-by-step</h2><ol><li>Recruit test persons, at least five, to get a valuable result. You need to be careful with the amount of test candidates, as too little will not build a representative insight-base, and too many will not provide you with more valuable information.</li><li>Define hypotheses on the outcome of the test on a high level that you want to verify.</li><li>Prepare a question guideline that supports you during the interview.</li><li>Setup your testing zone. You want to make it comfortable but not distracting for your test candidate. Make sure to have all recording options ready and tested before the sessions start.</li><li>Welcome your user and explain what is going to happen. Prepare them to think out aloud and try to take any fear off them by reassuring that they cannot do anything wrong.</li><li>Start the test and explain the scenario.</li><li>Evaluate and analyze your results and use the worksheets to sort your notes for each step.</li><li>Improve your prototype based on your observations and repeat the process. Where did the test candidates struggle a lot? Are there some obvious usability issues?</li></ol>","url":"https://www.figma.com/community/file/1084035801664243632"}
