{"id":"910385004596112467","name":"Multilingual Font Mixer 多语言字体混排","lastUpdateDate":"2021-03-29T07:36:33.387Z","publisherHandle":"DigitalCreative","publisherImage":"https://www.gravatar.com/avatar/60ec680fe9336ac3805608e846251b54?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_d_v2.png","publisherId":"903194051602762238","publisherName":"Digital Creative","description":"<p><strong>Now you can mix multilingual text, styled with the fonts of your choice, with one click!</strong></p><p><br></p><p>Figma doesn’t provide any function that replicates font stacks, so it’s very time-consuming for the designer to work with multilingual text, when you want to set up different fonts for different languages. We are a design agency in Shanghai, China, called Digital Creative, and we created this Figma plugin to help you gain more control over your typography, making it look better while minimal effort is needed! Simply set up the font styles (plus the font color, opacity, and weight) you want for different languages, and with one click, they will be applied to all the text in one or multiple groups that you’ve selected.</p><p><br></p><p>到目前为止，Figma 始终缺失与 CSS font stacks 特性类似的字体自动适配功能，所以当设计师需要把同一页面上的不同语言文本分别设置为不同字体的时候便会非常费时费力。我们是一家位于中国上海的设计机构 —— Digital Creative，我们设计了这款多语言字体混排插件。有了这款插件，您只要在操作框内设置好各语言对应的字体（更可调节字重、字体颜色、字体透明度）即可一键应用至一个或多个文本框内！您不再需要因为繁琐的操作而妥协于使用单一字体，以及不再困扰于系统自带的中文字体选择少、中文字体配套的数字和英文字符设计不好看等问题。</p><p>&nbsp;</p><p><strong>Highlighted Features&nbsp;</strong></p><p><strong>功能特点</strong></p><ul><li>One-click to apply mixed fonts (as well as font color, opacity, and weight) to different content types (languages &amp; digits).</li><li>Autocompletion to suggest fonts quickly when typing in font names.</li><li>Ability to range select groups on the frame to apply the font setup to all the text selected.</li><li>Currently supports 6 languages, including English, Chinese, Portuguese, Japanese, Russian, Korean， and Thai.&nbsp;</li></ul><p><br></p><ul><li>一键针对不同文本类型（例：中文/英文/数字）进行不同的字体应用（更可调节字重、字体颜色、字体透明度）。</li><li>支持快速字体搜索， 自动关出现联字体。</li><li>支持将同一设定一键应用到多个不同的图层/文本框。</li><li>文本匹配支持 6 种语言（英语、中文、葡萄牙语、日语、俄语、韩语、泰语）及内容类型（数字等）。</li></ul><p><br></p><p><br></p><p><br></p><p><strong>How to Use</strong></p><p><strong>使用方法</strong></p><p>1. Install Figma-plugin-font-mixer into your Figma.</p><p>2. Select your preferred font, font-weight, color, and opacity, for each language &amp; digits.</p><p>3. Select a node or range select nodes that contain editable text, and click the apply button to apply all the selected font styles to the corresponding content types.</p><p>4. Ta-dah! Done.</p><p>&nbsp;&nbsp;</p><ol><li>下载安装 Figma-plugin-font-mixer 到您的 Figma。</li><li>在插件操作框内为不同文本内容（语言和数字）选择您偏好的对应字体，字重，字体颜色，和字体透明度。</li><li>选择一个或多个编辑框，点击应用键，即可按照您刚刚的偏好设置一键应用。</li><li>恭喜你完工！</li></ol>","url":"https://www.figma.com/community/plugin/910385004596112467","iconUrl":"https://www.figma.com/community/plugin/910385004596112467/icon","thumbnailUrl":"https://www.figma.com/community/plugin/910385004596112467/thumbnail"}
