{"id":"1062047334766899303","name":"Figma to Azure Devops","lastUpdateDate":"2022-01-14T20:03:09.500Z","publisherHandle":"iamallyniam","publisherImage":"https://www.gravatar.com/avatar/842078ac6c8b62e525c8cce2350dd216?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"2374834","publisherName":"Allyn Thomas","description":"<p><strong>This is a plugin that allows components created in Figma to be exported as links and images to items in Azure Devops.</strong></p><p><br></p><h2>Reasoning</h2><p>Figma and Azure Devops are two great tools for different purposes and both are used across team roles. A designer will make something in Figma but the rest of the team needs to know what that component is doing, and developers will need additional information to be able to build the component. Azure Devops allows for cross team collaboration, but getting this information linked up with Figma can be a slog of a manual process. Information can quickly go out of sync, as requirements develop the design may not be updated to reflect these changes. As great a design tool Figma is, it can be difficult to navigate for the wider team.</p><p><br></p><h2>Solution</h2><p>This plugin attempts to solve some of these cross team issues by</p><ul><li>Reducing the time it takes to update content in Azure Devops when the design changes.</li><li>Creates direct links between Azure Devops items and the component in Figma they are describing.</li><li>Easily visible snapshots of components in Azure Devops that stay up to date.</li><li>Automatic version numbering of the Figma file so the version number in Figma stays up to date with the version number in Azure Devops.</li></ul><p><br></p><h2>Running the plugin</h2><p>Only editors can use this plugin.</p><p>Get a link for your Azure Devops work item. The following url schema is expected</p><p><code>{https}://{dev.azure.com}/{Account}/{Project}/_workitems/edit/{ID}</code></p><p><br></p><ol><li>Protocol : https only</li><li>Domain : Only dev.azure.com works</li><li>Account : Azure Devops account name</li><li>Project : Azure Devops Project name</li><li>ID : Work item id</li></ol><p><br></p><p>Add this to as many components in Figma that relate to the work item in the \"Documentation Links\" field in the design view.</p><p><br></p><p>After installing the plugin you will need access tokens associated with your Azure Devops and Figma accounts.</p><ul><li><a href=\"https://www.figma.com/developers/api\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">How to get a Figma access token</a></li><li><a href=\"https://docs.microsoft.com/en-us/azure/devops/organizations/accounts/use-personal-access-tokens-to-authenticate?view=azure-devops&amp;tabs=preview-page\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">How to get an Azure Devops access token</a></li></ul><p><br></p><p>There are two fields when the plugin opens for entering these access tokens.</p><p><br></p><p>If the plugin isn't installed in a private organisation, you'll also need to enter the file's unique key. To find the file's key, you can click the share button on the top panel and click the copy link. You could also can copy the file ID from a browser's address bar. The File URL looks something like this</p><p><code>https://www.figma.com/file/lZv3g38KPFJKByY0rdIlG8/Sample-File</code></p><p>The file id is the value between the \"file/\" and \"/Sample-File\".</p><p><br></p><p>After establishing a successful connection you can tick the work items you'd like to update in Azure Devops. This will update the Figma file to a new version, create a URL to that version in Azure Devops along with a screenshot of the components.</p>","url":"https://www.figma.com/community/plugin/1062047334766899303","iconUrl":"https://www.figma.com/community/plugin/1062047334766899303/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1062047334766899303/thumbnail"}
