{"id":"1105971862825731214","name":"South African Flag","lastUpdateDate":"2022-05-15T21:43:33.110Z","publisherHandle":"NhlanganoUIX","publisherImage":"https://s3-alpha.figma.com/profile/08469c8c-2431-44e3-9293-4e90833cf396","publisherId":"981470673620687917","publisherName":"Nhlangano Chabalala","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1871751812/d2ab1f48-05c6-4c7f-8bdb-ca76dd5d3c5d-cover.png","description":"<p>The national flag was designed by a former South African State Herald, Mr Fred Brownell, and was first used on 27 April 1994. The design and colours are a synopsis of principal elements of the country's flag history. Individual colours, or colour combinations represent different meanings for different people and therefore no universal symbolism should be attached to any of the colours.</p><p>The central design of the flag, beginning at the flag post in a 'V' form and flowing into a single horizontal band to the outer edge of the fly, can be interpreted as the convergence of diverse elements within South African society, taking the road ahead in unity. The theme of convergence and unity ties in with the motto Unity is Strength of the previous South African Coat of Arms.</p><p><br></p><p><br></p><p><strong>Flying the flag</strong></p><p>Specific instructions with regard to the use of the national flag can be found in the&nbsp;<a href=\"https://www.gov.za/sites/default/files/22356.pdf\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Government Gazette 22356, Notice 510 of 8 June 2001</a>&nbsp;[PDF].</p><p>When the flag is displayed vertically against a wall, the red band should be to the left of the viewer with the hoist or the cord seam at the top. When it is displayed horizontally, the hoist should be to the left of the viewer and the red band at the top. When the flag is displayed next to or behind the speaker at a meeting, it must be placed to the speaker's right. When it is placed elsewhere in the meeting place, it should be to the right of the audience.</p><p><br></p><p><br></p><p><strong>Colour specifications</strong></p><p>Textile colours</p><p>Green - CKS 42 c Spectrum green</p><p>Black - CKS 401 c Blue black</p><p>White - CKS 701 c National flag white</p><p>Gold - CKS 724 c Gold yellow</p><p>Red - CKS 750 c Chilli red</p><p>Blue - CKS 762 c National flag blue</p><p><br></p><p>Approximate Pantone equivalents</p><p>Green - 3415 c</p><p>Gold 1235 c</p><p>Red 179 c</p><p>Blue reflex blue c</p><p><br></p><p><br></p><p><strong>Sources</strong></p><p><br></p><ul><li>BROWNELL, FG, National Symbols of the Republic of South Africa. 1995. Johannesburg: Chris van Rensburg Publications.</li><li>Department of Foreign Affairs and Information. 1983. South Africa 1983: Official Yearbook of the Republic of South Africa. 9th ed. Johannesburg: Chris van Rensburg</li><li>Republic of South Africa. 1995. Government Gazette, no 1658 of 1995, Pretoria.</li><li>South African Communication Service. 1993. South Africa 1993: Official Yearbook of the Republic of South Africa. 19th ed. Pretoria: South African Communication Service.</li></ul>","url":"https://www.figma.com/community/file/1105971862825731214"}
