{"id":"736368164448889527","name":"Interplay","lastUpdateDate":"2021-10-10T21:47:33.780Z","publisherHandle":"michael","publisherImage":"https://s3-alpha.figma.com/profile/5c4ba704-7fc9-4a86-b944-126bf76767d0","publisherId":"860295","publisherName":"Michael Fitzgerald","description":"<p>Interplay imports your design system code repository and lets you design with code components in Figma.</p><p><br></p><p>With the Interplay plugin you can browse all of your design system code components, add them to your design in Figma, edit their content and all of the Code Component properties.</p><p><br></p><p>Interplay generates a Figma component on the fly and keeps it connected with the related code component so that your design is always in sync with your production code.</p><p><br></p><p><strong>What’s new?</strong></p><p><br></p><p>Live rendering on the canvas. You can now edit components that have already been added to the canvas.</p><p><br></p><p>On canvas editing. You can now edit content directly on the canvas. When you edit a text box on the canvas, the Code Component property will be updated automatically.</p><p><br></p><p>On canvas resizing. To resize a component, you can now resize it directly on the canvas in Figma. When you resize a component, Interplay renders the code component in a browser in the background, and translates that layout back into Figma.</p><p><br></p><p>UI Improvements. We’ve made lots of UI updates to make it easier to browse components and edit properties</p><p><br></p><p><strong>Quick Start</strong></p><p><br></p><p>1. So that you can try out Interplay straight away, we’ve configured some open source libraries for you to get started including Reactstrap and Ant Design. Select a design system and start dragging components onto the canvas.</p><p><br></p><p>2. To edit content and Code Component properties, select any component on the canvas and the plugin will display all of the the available code properties for the component.</p><p><br></p><p>Using your own design system in Figma with Interplay</p><p><br></p><p>We are gradually rolling out access to the Interplay CLI tool and Design System Manager which lets can import your own design system to Interplay. We are gradually rolling out access to teams.</p><p><br></p><p>Sign up for updates from within the plugin or by going to <a href=\"http://interplayapp.com.\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">interplayapp.com</a></p>","url":"https://www.figma.com/community/plugin/736368164448889527","iconUrl":"https://www.figma.com/community/plugin/736368164448889527/icon","thumbnailUrl":"https://www.figma.com/community/plugin/736368164448889527/thumbnail"}
