{"id":"1089324220429437476","name":"Supreme Court blocks lower court ruling on Navy SEALs and Covid vaccinations, in win for Pentagon","lastUpdateDate":"2022-03-25T23:05:32.893Z","publisherHandle":"erergtrh","publisherImage":"https://www.gravatar.com/avatar/7305b500b2876b69a2af0e96016e14bc?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_p_v2.png","publisherId":"1087149528908162335","publisherName":"Pearl Nose","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1694690916/63ef38dd-9b02-402b-a9c7-f66d9172dd20-cover.png","description":"<p>Supreme Court blocks lower court ruling on Navy SEALs and Covid vaccinations, in win for Pentagon</p><p>The lower court order forbade commanders to make any changes to military assignments based on a refusal to be vaccinated.</p><p><br></p><p>March 26, 2022, 3:22 AM +07</p><p>WASHINGTON — The Supreme Court on Friday blocked a lower court order that prevented the Navy from restricting the deployment of Navy SEALs who refuse to get a Covid vaccination.</p><p><br></p><p>Secretary of Defense Lloyd Austin had urged the court to remedy what he called “an extraordinary and unprecedented intrusion into core military affairs” that had no precedent in American history.</p><p><br></p><p>A federal judge in Texas ruled in early January that the Navy must allow members of the elite special operations community to opt out of the vaccination requirement if they had religious objections. But the judge's order went further, forbidding commanders to make any changes to their military assignments based on a refusal to be vaccinated.</p><p><br></p><p>On Friday, the Supreme Court put the judge’s order on hold “insofar as its precludes the Navy from making deployment, assignment, and other operational decisions.” That frees up the Navy to issue deployment orders based on Covid vaccination status.</p><p><br></p><p>Three justices — Clarence Thomas, Samuel Alito and Neil Gorsuch — said they would have denied the Navy’s request.</p><p><br></p><p>In a separate dissenting opinion for himself and Gorsuch, Alito said the court rubber stamped the Navy’s request, doing “a great injustice” to the sailors.</p><p><br></p><p>“These individuals appear to have been treated shabbily by the Navy,” Alito said.</p><p><br></p><p>Justice Brett Kavanaugh said he agreed with the Supreme Court’s Friday order. Under the Constitution, he said, “the President of the United States, not any federal judge, is the Commander in Chief of the Armed Forces.” The judge in this case improperly inserted himself into the military chain of command, Kavanaugh said.</p><p><br></p><p>Austin said the restriction usurped the Navy’s authority to decide when servicemembers should be deployed to carry out some of the military’s most sensitive and dangerous missions. It required commanders to make assignments for servicemembers “without regard to their lack of vaccinations, notwithstanding military leaders’ judgment that doing so poses intolerable risks to safety and mission success.”</p><p><br></p><p>https://marketplace.visualstudio.com/items?itemName=Filmizle.turning-red-izle</p><p>https://marketplace.visualstudio.com/items?itemName=Filmizle.morbius-izle</p><p>https://marketplace.visualstudio.com/items?itemName=Filmizle.the-bad-guys-izle</p><p>https://marketplace.visualstudio.com/items?itemName=cinemaizle.kayip-sheir-izle</p><p>https://marketplace.visualstudio.com/items?itemName=cinemaizle.spider-man-izle</p><p>https://marketplace.visualstudio.com/items?itemName=cinemaizle.kripi-sonic-2-izle</p><p>https://marketplace.visualstudio.com/items?itemName=pubizle.doktor-strange-izle</p><p>https://marketplace.visualstudio.com/items?itemName=pubizle.fantastik-canavarlar-izle</p><p>https://marketplace.visualstudio.com/items?itemName=pubizle.incantation-full-version-921380921321</p><p><br></p><p>The Navy has already sent one member of a SEAL team to a mission on a submarine against the wishes of commanders, the Pentagon said.</p><p><br></p><p>U.S. District Court Judge Reed O’Connor issued the order on Jan. 3 in a lawsuit brought by 35 Navy Special Warfare servicemembers, including 26 SEALs, who said the mandatory vaccination policy violated their religious freedom. “The Navy provides a religious accommodation process, but by all accounts, it is theater. The Navy has not granted a religious exemption to any vaccine in recent memory. It merely rubber stamps each denial,” he wrote.</p><p><br></p><p>On Feb. 28, the U.S. Court of Appeals for the Fifth Circuit declined to block O’Connor’s order.</p><p><br></p><p>By granting the Navy’s request to block the order, the Supreme Court likely doomed the case of a Navy officer who commands a guided missile destroyer. He brought a similar court challenge to the vaccination requirement, and U.S. District Court judge Steven Merryday of Florida, like O’Connor, found the vaccination order to be a violation of religious freedom and barred the Navy from taking any adverse action against the officer.</p><p><br></p><p>Because the Navy considers the officer to be a threat to the health of the crew, it blocked the deployment of the ship, with its crew of 320.</p><p><br></p><p>The Supreme Court has traditionally been highly deferential to military judgments about deployments. It said in a 1973 case that it is difficult to conceive of an area of governmental activity in which the courts have less competence than “the complex, subtle, and professional decisions as to the composition, training, equipping, and control of a force.”</p><p><br></p><p>In a 1986 case, the court said the essence of military service “is the subordination of the desires and interests of the individual to the needs of the service.”</p>","url":"https://www.figma.com/community/file/1089324220429437476"}
