{"id":"987768158906531033","name":"Guia para criação de cases","lastUpdateDate":"2021-06-19T00:21:25.787Z","publisherHandle":"molgado","publisherImage":"https://s3-alpha.figma.com/profile/a2eae7fc-7a96-4a09-b50e-4ca76f739ad4","publisherId":"854357899664950507","publisherName":"Victoria Costa","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/925631268/b6f156a0-e45f-49b7-be57-24a0c45d5921-cover.png","description":"<h1>Guia com dicas e exemplos de boas práticas para criação de cases</h1><p><br></p><h2>Como começar:</h2><ul><li>Copie usando o \"Duplicate\" do Figma Community, no canto superior direito;</li><li>O arquivo será copiado para os seus \"Drafts\" no Figma;</li><li>Navegue clicando em \"Pages\" no canto superior esquerdo e selecionando as páginas \"Apresentação do material\" ou \"Guia de narrativa visual\"</li><li>Leia o guia com atenção, procure entender o porque de cada sugestão;</li><li>Use o material para entender o valor de cada informação na narrativa de um projeto.</li></ul><p><br></p><h2>Motivação</h2><p>Sabemos que muitas vezes tudo o que precisamos no início de carreira em Product Design é um empurrãozinho para decolar e <em>mostrar</em> todo o potencial da melhor forma possível.</p><p><br></p><p>Preparamos esse guia com dicas que exemplificam o que nós gostaríamos de ver nos cases (apresentação de projeto) de designers de produto e sobre o seu trabalho durante o processo seletivo da VTEX.</p><p><br></p><p>Lembre-se: este guia não é um template, nem apresenta regras do que é obrigatório em uma apresentação (para o processo seletivo da VTEX ou outras empresas). São apenas sugestões de informações básicas para o início da criação de uma narrativa — apresentar um projeto é contar uma história.</p><p><br></p><p>Com carinho,</p><p>Time de Design VTEX</p><p><br></p><p>✨ Estamos contratando! <a href=\"https://careers.vtex.com/postings/product-designer-joao-pessoa/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Veja as vagas aqui.</a></p><p>🗣 Sinta-se à vontade para deixar dúvidas ou feedback nos comentário abaixo.</p>","url":"https://www.figma.com/community/file/987768158906531033"}
