{"id":"760966234320559456","name":"Structure","lastUpdateDate":"2020-03-21T16:24:26.614Z","publisherHandle":"fabien","publisherImage":"https://s3-alpha.figma.com/profile/d86ee50a-f0c1-455c-809f-198339d43057","publisherId":"383","publisherName":"Fabien","description":"HTML & SASS code generator / fine-tune results / easy to use.\n\n________\n\n🏛️ What is Structure ?\n\nThis plugin generates HTML & SASS code from Figma. \nSelect an object, a component, a frame, anything, then click on \"Inspect\" and voilà ! \n\nBUT.. one problem with code generators can be code redundancy, especially with Figma objects where you can find instances inside instances inside..\n\nIn order to get a much cleaner code, you can use different options : \n\n• use \" ↑ \" to merge a div (and its css properties) with the parent div\n• use \" - \" to remove an element from code\n\nMerging and deleting affect both HTML and SASS generated code. You can freely experiment things, as you can find an undo button, if something didn't go as expected.\n\n________\n\n🧰 Options\n\n• You can adjust settings by clicking on the \"■\" option (flex, absolute or relative positioning,..)\n• You can double click inside an input field to zoom on the Figma object related to your code\n• Figma styles can be displayed (or not) inside SASS code\n• Images are generated as base64 background in the preview, but are not added to SASS code.\n• Vectors are generated as SVGs, and you can display/hide them in HTML code.\n• This plugin works best with objects using autolayout (support for spacing, alignement,..)\n• HTML & CSS are rendered inside the preview zone, so you can easily see how your actions affect rendered code.\n\n________\n\n🗒️  Notes\n\n• Using this plugin doesn't change anything in your Figma file.\n• This plugin is a WIP, and may not cover every cases. If you find bugs, or missing something from it, please feel free to contact me.","url":"https://www.figma.com/community/plugin/760966234320559456","iconUrl":"https://www.figma.com/community/plugin/760966234320559456/icon","thumbnailUrl":"https://www.figma.com/community/plugin/760966234320559456/thumbnail"}
