{"id":"858763146572554425","name":"Select by Font","lastUpdateDate":"2021-06-05T14:57:46.316Z","publisherHandle":"fb2f1d69_b79f_4","publisherImage":"https://www.gravatar.com/avatar/f1aa987895ea0a8da3239b65192b643a?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_s_v2.png","publisherId":"853706967592222314","publisherName":"Saurabh Gupta","description":"<p><strong>Figma’s Selection Color tool but for Fonts and Styles.</strong></p><p><br></p><p>Easily view all the distinct fonts used in the current selection. Then, select all text nodes of a similar font.</p><p><br></p><p><strong>WHY THIS PLUGIN WILL CHANGE YOUR WORKFLOW</strong></p><p>This plugin removes the pain of finding and selecting text nodes.</p><p><br></p><p>Designers relate a text node with its purpose - heading, caption, label, warning etc. A well crafted design system has font style names that match the purpose of the style. Thus, font types and style names are the best way to get to a text node. This plugin makes that possible.</p><p><br></p><p>In our beta testing, designers who use this plugin use it so often and after a while can’t imagine their workflow without it. The plugin is designed to be a narrow and vertical dialog so that it can be kept open while you are working on your designs.</p><p><br></p><p><strong>LATEST RELEASE</strong></p><p>Longer style names are now fully visible</p><p><br></p><p><br></p><p>HOW TO USE THE PLUGIN</p><p><br></p><p>STEP 1</p><p>Select a frame or a group of frames</p><p><br></p><p>STEP 2</p><p>Run the plugin to see the distinct list of fonts used in the selection</p><p><br></p><p>STEP 3</p><p>Click on the Font or Style Name to select ALL the text nodes that match that style.</p><p><br></p><p>STEP 4</p><p>If you make any changes to font or style, then refresh to update the font list.</p><p><br></p><p>COMING SOON</p><p>Cycle through text node selection</p><p>Auto refresh font list after changes are made</p><p>Spell check on text nodes</p>","url":"https://www.figma.com/community/plugin/858763146572554425","iconUrl":"https://www.figma.com/community/plugin/858763146572554425/icon","thumbnailUrl":"https://www.figma.com/community/plugin/858763146572554425/thumbnail"}
