{"id":"1076090065869699533","name":"UIUX Design - Project Boomerang - Instagram.com","lastUpdateDate":"2022-04-08T00:57:12.550Z","publisherHandle":"cavalon","publisherImage":"https://s3-alpha.figma.com/profile/326ddd5a-d3ed-404b-b5c4-d560a35b9ba6","publisherId":"859047","publisherName":"Cavalon","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1742325702/7c6a4a5e-bed3-4180-bfd7-f5ff2d370347-cover.png","description":"<p>Sharing a one-of-a-kind freebie with the design community, and some lessons I've learnt along the way.</p><p><br></p><p>Five years into digital product design, and, I still feel like I have just scratched the surface of what is possible. in fact, I feel like we all are still figuring it out. the digital product design space is barely 20 years old, yet, it has grown leaps and bounds, entire industries, systems, have been built -almost from nothing- countless jobs have been created, and many more opportunities continue to open up every day.</p><p><br></p><p>I am happy to be alive to witness the evolution, far happier to be part of it. however, what brings me the most joy is my ability to influence, shape, direct the growth of this massive community.</p><p><br></p><p>For me, - and I can speak for most of my colleagues - the learning never stops. We'll continue to grow, get better.</p><p><br></p><p><br></p><p><br></p><p>About \"Project Boomerang\"</p><p><br></p><p>I am aware of the struggle young designers go through when getting started in digital product design, there are too many resources out there, too many \"gurus\" too many paths to follow. I've been there, and it can be very frustrating.</p><p><br></p><p>One of the ways I believe young designers can learn is by getting access to what real-world projects look like. I believe it gives them a unique perspective, something to look up to, something to dissect, dismantle or break apart. I think if one can see the inner workings of something, it's easier to understand how the creator arrived at it. This is why I started \"project Boomerang\"</p><p><br></p><p>It's simple, I pick an existing website or App and recreate it using my all-time favourite tool Figma. I think by doing this I've made it easier for anyone to make the connection between a static or interactive design prototype and a fully published or executed work, being able to dissect the design, and at the same time get a feel of how the design translates on the web or mobile phone, helps a great deal in connecting many dots.</p><p><br></p><p>One thing to note though is that these designs are not in any way as robust as actual \"real-world projects\" but they are close - some are even \"one-pagers- But, I have created them, following the same approach I take when working on actual projects. unfortunately, I cannot share clients work with the public.</p><p><br></p><p><br></p><p>SUMMARY</p><p>I have made a home on dribbble.com/lodnael, I feel a bit lost in Behance, can't put a pin to “why” I hope that changes soon.</p><p><br></p><p>Made a home at ko-fi.com/nate as well, for those who’d like to support the project.</p><p><br></p><p>So, that’s it, Enjoy!</p>","url":"https://www.figma.com/community/file/1076090065869699533"}
