{"id":"1076090065869699533","name":"Project Boomerang - Instagram.com","lastUpdateDate":"2022-02-17T15:12:52.773Z","publisherHandle":"cavalon","publisherImage":"https://s3-alpha.figma.com/profile/326ddd5a-d3ed-404b-b5c4-d560a35b9ba6","publisherId":"859047","publisherName":"Cavalon","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1567194231/13dab661-8275-4f0d-b35e-8fb55f1ac54e-cover.png","description":"<p>WHY THIS?</p><p>I started the Boomerang series because I realized that I had done so much work in the past five years that I cannot share with the public, - at least not yet - these works are confidential. So, it is in the best interest of my clients that they remain private.</p><p><br></p><p>Also, I got so tired of seeing bad UI everywhere, and I figured that rather than nag or complain, I could just do something to improve the status quo, and build a “nice portfolio” in the process, yeah, I’m petty :)</p><p><br></p><p><br></p><p><br></p><p>ABOUT THE PROJECT</p><p>Typical projects I work on are quite robust and will take about three to eight months to complete, examples include platforms that have a robust web area, plus two to three, sometimes four dashboard areas - all prototyped to sync perfectly like an engine. :)</p><p><br></p><p>The Boomerang projects are not as robust - You are free to think of them as simple, mini-projects, I have made them, following the same approach I take when working on “real-world projects” and I have decided to dedicate about two to five weeks to each of them.</p><p><br></p><p>One thing to clarify though is that they are not “Daily UI challenges” I’m not a huge fan of the so-called “Daily UI challenges” :(</p><p><br></p><p><br></p><p>WHAT TO NOTE</p><p>These designs are living, not static, what this means is that I could come back at any time - especially in the middle of the night - to improve on them, tidy things up, add more screens, etc. - yeah, I’m OCD, deal with it.</p><p><br></p><p><br></p><p>BENEFITS</p><p>This could be a starting point for your next projects. You could learn from them - for those of you who are still in design school - or just take a sneak peek into my design “process”, break down all I’ve done and build upon my knowledge, honestly? whatever gets your boat rocking.</p><p><br></p><p>SUMMARY</p><p>I have made a home on dribbble.com/lodnael, I feel a bit lost in Behance, can't put a pin to “why” I hope that changes soon.</p><p><br></p><p>Made a home at ko-fi.com/nate as well, for those who’d like to support the project.</p><p><br></p><p>So, that’s it, Enjoy!</p>","url":"https://www.figma.com/community/file/1076090065869699533"}
