{"id":"949398715671878472","name":"CopyCat | HTML, react component code generator | Export color, icons, font, image","lastUpdateDate":"2021-09-28T09:32:47.329Z","publisherHandle":"copycat","publisherImage":"https://s3-alpha.figma.com/profile/97cd990d-dca2-4b2c-9f66-46f70c2f9dea","publisherId":"949357427487770107","publisherName":"CopyCat","description":"<p>CopyCat Figma plugin is the fastest way to build UI from designs. The CopyCat plugin helps React.js developers build UI half the time by automatically generating developer-friendly layout/component codes from selections.</p><p><br></p><p>Additionally, CopyCat Figma plugin generates HTML code. It also helps you automatically export images, colors, fonts, icons, SVGs, and other assets with a click of a button.</p><p><br></p><p>We're currently in the early alpha stage. If you have any issues/feedback, we would love to hear from you.</p><p><br></p><p><strong>What will CopyCat do for me?</strong></p><ol><li>CopyCat reads your Figma file to generate good quality React.js code from your designs. Our goal is to provide you with a boilerplate from your existing designs so you can spend your time focused on the harder challenges.</li><li>We try to focus on reusability and readability and thus break your code down into component-based React.js Views.</li></ol><p><br></p><p>The following key features ensure that the generated code is production-ready:</p><p><br></p><ol><li>Compatible with your existing code base &amp; framework</li><li>Ability&nbsp;to&nbsp;reuse generated component codes in new designs</li><li>Developer friendly variable naming</li><li>Logical breakdown of component codes</li></ol><p><br></p><p><strong>Languages supported:</strong></p><p>Currently, we only support React.js for web development.</p><p><br></p><p>If you'd like to see more features on CopyCat, feel free to email us or leave a comment below!</p><p><br></p><p>Topics: text, design, color, export, icons, images, generator, free, generative, svg, handoff, image, code, styles, html, components, UI/UX, components, productivity, fonts, figma plugin, prototype, selections, elements, automatically, group, convert, import, react, bootstrap</p>","url":"https://www.figma.com/community/plugin/949398715671878472","iconUrl":"https://www.figma.com/community/plugin/949398715671878472/icon","thumbnailUrl":"https://www.figma.com/community/plugin/949398715671878472/thumbnail"}
