{"id":"1020700094489447475","name":"Text to Columns","lastUpdateDate":"2021-10-21T15:47:33.753Z","publisherHandle":"jaclyntan","publisherImage":"https://s3-alpha.figma.com/profile/cb21db5e-8660-49f0-83c2-f0408b682b09","publisherId":"654690","publisherName":"Jaclyn Tan","description":"<h2>Generate evenly balanced columns from long form text</h2><p><br></p><h2>✨ To Use</h2><ul><li>Run the plugin</li><li>Select an element containing text</li><li>Update settings if required</li><li>Click 'Create Columns'</li></ul><p><br></p><h2><strong>✨ </strong>Notes</h2><ul><li>This plugin will work on any text element</li><li>Columns are created without splitting words</li><li>If only one text style is used it will be used in the newly created columns. Due to Figma's api, if multiple text styles are used in the reference element, the default font style (Roboto) will be used in the new columns instead.</li><li>Due to the way Figma returns text strings, soft returns (<code>&lt;br&gt;</code>) are ignored. Unfortunately I'm not sure if there is a fix for this until they update the api.</li><li>The <strong>Prioritise Paragraphs</strong> option ensures paragraphs are not split</li><li>The <strong>Prioritise Even Split</strong> option ensures each column has an even amount of words (the end result will likely need some manual finessing depending on your design)</li></ul><p><br></p><h2>❌ If you encounter any errors ❌</h2><ul><li>Any time the plugin does not work, the cause is most likely due to invisible/zero width characters in your text element (this happens if you work between Mac and PC or Word and Figma, where invisible characters can carry across)</li><li>To check if this is the case, you can open up the console by clicking Plugins &gt; Development &gt; Open console. Copy and paste the text string in the console log to <a href=\"https://regex101.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://regex101.com/</a>. If there are any weird characters in there you'll see them highlighted.</li><li>If this happens to you please submit an issue on Github so I can fix it in the regex! Thank you.</li></ul><p><br></p><p>---</p><p>♡ If you run into any bugs, have feature requests, or would like to improve on the plugin please submit an issue on Github. 😄</p>","url":"https://www.figma.com/community/plugin/1020700094489447475","iconUrl":"https://www.figma.com/community/plugin/1020700094489447475/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1020700094489447475/thumbnail"}
