{"id":"749061307736645564","name":"Send to Components Page","lastUpdateDate":"2019-09-09T21:36:26.499Z","publisherHandle":"vadim","publisherImage":"https://s3-alpha.figma.com/profile/fb647062-c72c-462e-97b4-04a9085e290f","publisherId":"779","publisherName":"Vadim Pleshkov","description":"If you prefer to keep your components on a separate page and are tired of carrying them manually, this plugin is for you.\n\n1. Select any number of Components. Frame, group, or just group selection will also work.\n\n2. Call up the plugin. All components from the selection will be transferred to a separate Components page and placed in a special Unsorted Components frame. The places occupied by the components will be substituted by their instances.\n\nThe plugin has two independent commands to choose from:\n\nSend to components page\n(For a quick search, print snc)\n\nWhen this command is invoked, the Components are sent to a separate page while staying on the same page.\n\nSend to components page and go to\n(for a quick search, print sngo)\n\nWhen this command is invoked, after moving components the focus is moved to the components page, and all newly transferred components are selected.\n\nAll components are placed in a special frame only for predictability, and you are welcome to extract the characters from the frame and organize them as you wish. See it as a predictable arrival point for new components.\n\nAlthough the presence of components in the frame will not prevent further calls (i.e. you can securely call the plugin several times in a row), the plugin looks up at the contents of the frame every time, so for better performance, it makes sense to keep it as empty as possible.\n\nA few details:\n\n- If you already have a page named \"Components\" or \"Symbols\", the plugin will use it to place its frame. If the page doesn't exist plugin will create it and use afterward.\n- If the page or frame has been deleted, the plugin will recreate the new ones at the next call\n- You can rename the components page or frame as you wish.","url":"https://www.figma.com/community/plugin/749061307736645564","iconUrl":"https://www.figma.com/community/plugin/749061307736645564/icon","thumbnailUrl":"https://www.figma.com/community/plugin/749061307736645564/thumbnail"}
