{"id":"1094231570169259885","name":"Frames X — Free Version","lastUpdateDate":"2022-04-08T12:19:38.243Z","publisherHandle":"buninux","publisherImage":"https://s3-alpha.figma.com/profile/6156b420-54a1-4886-a117-18f30689b96e","publisherId":"9885","publisherName":"Dmitriy Bunin","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1744399244/844aac7e-30be-4c52-952a-35bc80b71ec1-cover.png","description":"<p>Frames X is the one Figma UI kit and eBook to skyrocket your career and save thousands of hours.</p><p><br></p><p><strong>With this bundle, you will master system design and get access to a vast component library that will drastically improve your workflow by providing you with all the necessary assets, tips, and tricks to design a better UI.</strong></p><p><br></p><p>Learn more and preview the full version at &gt;&gt;&gt; <a href=\"https://gum.co/framesx/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">gum.co/framesx</a>.</p><p><br></p><p><strong>What is Frames X?</strong></p><p><br></p><p>Frames X is a design system and a handbook that offers a foundation and knowledge base to help you design smarter and faster. This product is the result of hundreds of hours of work. With Frames X, we hope to contribute to your growth as a designer through learning and applying the Frames X framework, tips, and UI Kit. From here you could:</p><p><br></p><ul><li><a href=\"https://buninux.gumroad.com/l/framesx\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Access the eBook</a> to skyrocket your flow and learn how to use Frames X at its best.</li><li>Access Templates, Design Tokens, and UI Tokens in the full version of this file.</li><li>Navigate file pages to preview and operate Frames X contents.</li></ul><p><br></p><p><strong>What's inside?</strong></p><p><br></p><p>✔ Design handbook and get started guide to help build, kickstart, and document your design system faster.</p><p>✔ Huge UI Kit with <strong>420+</strong> predesigned blocks to build your project faster.</p><p>✔ WCAG accessible color system.</p><p>✔ Accessible and scalable typography system.</p><p>✔ Global style guide with <strong>460 </strong>design tokens. Integrated <a href=\"https://www.figma.com/community/plugin/843461159747178978/Figma-Tokens\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Figma Tokens plugin</a> support (.json file included).</p><p>✔ <strong>30</strong> UI tokens categories.</p><p>✔ <strong>4,500+</strong> components and variants with the implemented Auto layout to save thousands of hours of designing them from scratch.</p><p>✔ <strong>800+</strong> MIT-licensed icons (<a href=\"https://heroicons.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Heroicons</a> set included).</p><p><br></p><p><strong>What are the perks of Frames X?</strong></p><p><br></p><p>✔ It's a perfect out-of-the-box design system for Figma with every string explained that you could use unlimited times.</p><p>✔ Frames can serve you as a blueprint for your projects, or as a conveyer template for making great UI kits at your agency.</p><p>✔ The final product will include a complete handbook for building a design system accompanied by a vast library of UI components.</p><p><br></p><p><strong>Free version includes full set of design tokens, 144 web blocks and 16 UI tokens categories. </strong></p><p><br></p><p>If you want to contribute to the development of Frames X, you are missing some component or something that doesn't work as you'd expect, you are welcome to <a href=\"https://twitter.com/buninux\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">dm me on twitter</a>.</p>","url":"https://www.figma.com/community/file/1094231570169259885"}
