{"id":"1106146900736651876","name":"Bodystorming","lastUpdateDate":"2022-05-11T09:12:52.512Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856366152/3e681a00-65c1-4d2e-a7fd-4bc7f7fb6d45-cover.png","description":"<p>Physically experience user scenarios.</p><p><br></p><h2><strong>Summary</strong></h2><p>As a variant of&nbsp;<a href=\"https://uxtoolkit.merck.design/methods/brainstorming\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Brainstorming</strong></a>, Bodystorming involves gaining and validating ideas by physically placing oneself in a situation or environment. The method can be used to generate ideas as well as to optimize existing concepts, products, services, etc.</p><p><br></p><h2><strong>Step-by-step</strong></h2><p>1. Prepare the place where the Bodystorming will be performed. Is it a specific environment in which the testing will take place? Or is it more about the product or service that is needed to achieve a specific goal?</p><p>2. Organize different materials with which to craft and imitate, such as pens, tape, scissors, furniture, wood, cups, glue, post-it's, cardboard etc. The prototype may also be very abstract.</p><p>3. It makes sense to appoint a moderator to keep track and guide the session, e.g. by making sure that the goal is not lost sight of. Tasks of the moderator:</p><ul><li><strong>Timekeeper:</strong>&nbsp;Keep track of the time that has passed. Sometimes the ideas just get crazy after a certain time. Let the team consciously take short breaks to be able to stay focused.</li><li><strong>Instructor:</strong>&nbsp;Before the session begins, summarize for all participants what the goal is and how it can be achieved. Establish do's and don'ts, if applicable.</li><li><strong>Observer:</strong>&nbsp;Consider Bodystorming as an outsider to gain a different perspective.</li><li><strong>Recorder:</strong>&nbsp;Record the thoughts and results to discuss with the team at the end of the session.</li><li><strong>Educator:</strong>&nbsp;Be careful not to let the roleplay get too crazy. Even though bodystorming is a comparatively fun and free method, the session should not be taken as a fun time out.</li></ul><p>4. Once everything is prepared, the session can start. The participants put themselves in the shoes of specific users, stakeholders or user groups. The aim is to experience a situation from the perspective of another affected person in order to identify possible difficulties or pain points.</p><p>5. Optional: Recording different situations with a video camera helps to remember the findings of this method later in the process or to enlighten team members who could not participate in the Bodystorming session.</p><p>6. Together with the team, the results should then be recorded in writing and discussed to determine the next steps. What new pain points have emerged as a result of the session? How or what needs to be improved to achieve the goal?</p>","url":"https://www.figma.com/community/file/1106146900736651876"}
