{"id":"862039267149408972","name":"Quest - Figma to React Components, HTML pages","lastUpdateDate":"2022-05-05T19:04:01.728Z","publisherHandle":"madewithquest","publisherImage":"https://s3-alpha.figma.com/profile/b8c3cb8a-6e84-4a7a-a8f4-6483848dacb3","publisherId":"882756015971217236","publisherName":"Quest","description":"<p>The better way to build your front end. Convert your Figma designs to React components automatically. Pixel-perfect to your design, responsive across screen sizes. Export clean, efficient code that is extendable with your custom code or business logic. Try it risk free.&nbsp;</p><p><br></p><p>Key Features:</p><ul><li>Easy to use - see your design come to life in the form of React code just by exporting to Quest. Iterate easily by looking at the end product - no more guesswork.</li><li>Works with Figma features like variants, autolayout, etc.</li><li>Use the built-in design system or bring your own.</li><li>Supports Material UI Component library by default. Or you can build your own or bring in your own (Contact us if you’d like to import your existing UI component library).</li><li>Set up props, bindings and state triggers easily without writing any code.</li><li>Export clean React code that is as good as hand-coded by a developer.</li><li>Separation of concerns between the presentation layer and the business logic - iterate on your design as often as you want and generate the presentation layer without any development effort.</li></ul><p><br></p><p>Risk-free - build one component and add it to your existing react app. Build more as you go - no need to throw away what you already have and start over.</p><p><br></p><p>To get started:</p><ul><li>Install this plugin</li><li>Login to your Quest account</li><li>Follow our Quick Start list to build your first component: <a href=\"https://docs.quest.ai/getting-started/quick-start\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://docs.quest.ai/getting-started/quick-start</a></li></ul><p><br></p><p>Learn more at <a href=\"https://quest.ai/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://quest.ai/</a></p>","url":"https://www.figma.com/community/plugin/862039267149408972","iconUrl":"https://www.figma.com/community/plugin/862039267149408972/icon","thumbnailUrl":"https://www.figma.com/community/plugin/862039267149408972/thumbnail"}
