{"id":"1037535899287211554","name":"Voting Sessions","lastUpdateDate":"2021-11-03T17:54:02.737Z","publisherHandle":"tkmadeit","publisherImage":"https://s3-alpha.figma.com/profile/bcd559d3-c65b-494b-8ad4-774bb83e15b7","publisherId":"156890","publisherName":"Tekeste Kidanu","description":"<h2>Voting Sessions - [BETA]</h2><h2><br></h2><h2>How to setup voting session</h2><p><br></p><p>1. Add the widget on to your Figjam board &amp; click on <strong>Setup Voting Session</strong>.</p><p><br></p><p>2. Fill out all the required fields. If you don't want the participants to be influenced by each other make sure you choose anonymous. This way the votes will be visible only when the voting session has ended.</p><p><br></p><p>3. Click on <strong>Start Voting Session</strong> button. After this point you can track the progress of the session on the small window that is open. You can alway open this window by click on <strong>Open Admin View</strong>. Only you will be able to see this admin view.</p><p><br></p><p>4. You can end the voting session by clicking on <strong>End Voting Session</strong> from the Admin view. You will see that the widget now shows all the objects sorted by the amount of votes they received and top 3 objects highlighted.</p><p><br></p><h2>How to vote</h2><p>If you are a participant you can vote and un-vote on objects by clicking on the <strong>up</strong> and <strong>down</strong> arrows. If the voting session is anonymous you can't see your votes being added but know that they are being recorded.</p><p>You can check how many votes you gave to an object by clicking on the <strong>eye</strong> icon next to the vote &amp; un-vote arrows.</p><p><br></p><p><strong>Caveats</strong></p><p>This is a very new widget and hasn't been stress tested by large teams. What I am hoping for this early version is to get your help <strong>stress testing it, reporting bugs and sending feature requests</strong>. There is one known issue where if you click really really fast some of the votes get dropped. But this is quite the edge case because I don't foresee anyone clicking that fast when voting. :)&nbsp;</p><h2>&nbsp;</h2>","url":"https://www.figma.com/community/widget/1037535899287211554","iconUrl":"https://www.figma.com/community/widget/1037535899287211554/icon","thumbnailUrl":"https://www.figma.com/community/widget/1037535899287211554/thumbnail"}
