{"id":"965300293958451734","name":"Conversis Translation XML Text Export & Import","lastUpdateDate":"2021-07-20T22:06:35.648Z","publisherHandle":"be959624_b181_4","publisherImage":"https://www.gravatar.com/avatar/8a29fca01f4381546f18862e25fe2a4d?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_i_v2.png","publisherId":"959766461421952710","publisherName":"Ian Barrow","description":"<p>Plugin to Export all text from nodes into a translatable XML format.</p><p>Once translated, updated text and formatting positions can be re-imported into the design.</p><p><br></p><p><a href=\"https://youtu.be/8Ew3aZ3ws78\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Short YouTube demonstration</a></p><p><br></p><p><strong>Export</strong></p><p>Once your source file has been created, make a copy of it. export from this copy by clicking generate XML.</p><p><br></p><p>Choose to export all font information if you wish to change the fonts within the XML. Useful when mass font changes are required.</p><p><br></p><p><strong>Translation</strong></p><p>Use of a CAT tool such as memoQ is recommended.</p><p>Translate the content of the \"String\" element. consider all elements within that as \"Inline\". You may wish to segment on \"br\" elements.</p><p>Ensure whitespace is preserved and not normalised. Especially if you are using multiple spaces for controlling layout of text on screen.</p><p><br></p><p><strong>Import</strong></p><p>On the import tab use \"Choose file\" to selected the translated XML, then click import translations.</p><p><br></p><p>Choose to import regardless of source differences.</p><p>useful if you want to reimport a modified XML over the top of a previous import.</p><p><br></p><p><strong>WARNINGS</strong></p><ul><li>Right-to-Left languages aren't well supported in Figma at present</li><li>In order for the import to function fully you must not have any missing font warnings on your design.</li><li>Contents of the \"base\" element should remain untranslated. this element is used to check for consistency between the source of the translation and the current contents of the node.</li></ul>","url":"https://www.figma.com/community/plugin/965300293958451734","iconUrl":"https://www.figma.com/community/plugin/965300293958451734/icon","thumbnailUrl":"https://www.figma.com/community/plugin/965300293958451734/thumbnail"}
