{"id":"1106150502096734838","name":"World Café","lastUpdateDate":"2022-05-11T09:27:11.130Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856356112/1503b39c-ffcd-458e-9e83-eb2a892df543-cover.png","description":"<p>Let people explore different approaches in a short period of time.</p><p><br></p><h2><strong>Summary</strong></h2><p>World Café is an exercise for at least twelve people. In a relaxed atmosphere, smaller groups of four to six participants visit table stations where they discuss certain topics. Each table is hosted by a topic moderator who briefly updates new groups about what already has been discussed. After a predefined interval, the groups move to the next table. This way each participant can contribute to all topics while being more and more mindfully enriched through all of the input from the other topics and participants.</p><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>Prepare a relaxed atmosphere for the participants. Make sure there is sufficient hydration available and no loud music playing in the background.</li><li>Provide separate tables for all topics that are far enough apart so that the people sitting or standing at them are not distracted by the volume of their conversation.</li><li>Define discussion topics, write them on paper and put them on the separate desks.</li><li>Form groups and designate one host for each table. Start a timer for each round, e.g. 15 min per round.</li><li>After each round, all groups move to the next table while the hosts stay and keep the conversations at their table going.</li><li>After one or two rotations, or after each group has been on every table, the session ends.</li><li>The moderators present the outcome of the discussions.</li><li>The hosts bring together the results of their tables and present them to the entire group if applicable.</li></ol>","url":"https://www.figma.com/community/file/1106150502096734838"}
