{"id":"1108288430738564592","name":"necco memo - Sticky notes","lastUpdateDate":"2022-05-18T10:23:18.899Z","publisherHandle":"necco","publisherImage":"https://s3-alpha.figma.com/profile/e4e781f0-8458-4f16-bb6f-ab60bf1abf32","publisherId":"905362796694354047","publisherName":"necco","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1883669561/644ff343-0276-44e3-90f7-e0bf2df4a6f0-cover.png","description":"<p>色とアイコンを選択して使えるメモです。</p><p>タイトルと本文が入力でき、本文は箇条書きを標準としています。</p><p>箇条書きなしの文章、数字のリストにも変更できるので、自由にお使いください。</p><p>テキストの長さに合わせてメモの高さも変わります。</p><p><br></p><p>チームで作業する場合、メンバーのアイコンを設定しておくと誰が何を書いたかわかりやすいです。</p><p>黄色はデザインに関する内容、青は仕様、赤は修正指示など、色別でカテゴリーを設定しておくのもオススメです。</p><p><br></p><p>necco memoの使用例は以下の記事で紹介しているので、よければ参考にしてみてください。</p><p><a href=\"https://necco.inc/note/10754\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Figmaでのコミュニケーションをスムーズにする「necco memo」を作りました。作り方、実際の使用例など。</a></p><p><br></p><p>---</p><p><br></p><p>necco memo is a sticky note for Figma. You can quickly leave sticky notes on your Figma files by selecting paper colors and icons. Memos will have a title and body text area; the body content will be a bullet list style by default settings. You can change the bullet list to the numbered list or the simple text area. Feel free to use it as you like. The height of the memo adjusts according to the length of the text.</p><p><br></p><p>When working in a team, you can set icons for each member to make it easier to see who wrote what. We also recommend defining categories by color: yellow for design feedback, blue for specifications, and red for correction instructions.</p><p><br></p><p>Examples of the use of \"necco memo\" can be found in the following article.</p><p><br></p><p>Thanks.</p><p><br></p><p><a href=\"https://necco.inc/note/10754\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">We created \"necco memo\" to facilitate communication in Figma. How to make it, examples of actual use, etc.</a></p>","url":"https://www.figma.com/community/file/1108288430738564592"}
