{"id":"1077604512049165603","name":"PERSONAL FolioKit [Basic v1.0]","lastUpdateDate":"2022-02-21T14:55:36.717Z","publisherHandle":"uxabbii","publisherImage":"https://www.gravatar.com/avatar/aef1caf59c68deeb253b3aa8c5d7fa51?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"1057375734782269335","publisherName":"Abdullah","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1578068684/c72afbeb-d348-4d97-95b4-4727a3ddf5cc-cover.png","description":"<h2><strong>The perfectly designed templates for your portfolio website</strong></h2><p><br></p><p>Personal FolioKit is a free portfolio kit that allows users to build their own portfolio websites using pre-built templates, saving both time and effort.</p><p><br></p><p><br></p><h2><strong>Save time and energy</strong></h2><p><br></p><p>Tired of wasting time creating a minimalistic and powerful portfolio and experimenting with several designs to find which one suits you the best? Personal FolioKit [Basic Version] comes with all the foundations and editable starter templates you will need to start building your portfolio right away in minutes.</p><p><br></p><p><strong>What’s inside?</strong></p><p><br></p><ul><li><strong>4x ready-to-use and editable templates</strong> with 4-5 sections, including a hero section, an about me section, a services section, a portfolio section, testimonials, and a footer section<strong>.</strong></li><li><strong>Over 80 global styles</strong> to choose from, including a scalable typeface system, a practical color system, layout grids, shadows, etc.</li><li><strong>25+ basic components with 100% auto-layout </strong>that you need to get started including links, buttons, tabs, checkboxes, UI cards, etc.&nbsp;</li><li><strong>200+ outlined icons</strong> for key navigation and marketing sections like services and portfolio from a collection of heroicons.</li></ul><p><br></p><p><br></p><h2><strong>Design quickly and efficiently</strong></h2><p><br></p><p>We understand that you have already invested hundreds of hours in creating projects for your portfolio and case studies, and you are eager to launch it as soon as possible. With PERSONAL FolioKit, all you have to do is to add your content, personal and project images, and your design is all ready - it's that easy. We</p><p>have done all the hard work and kept things simple for you, so you don't need any design or tool experience.</p><p><br></p><p><strong>This portfolio kit is perfect for:</strong></p><p><br></p><p><strong>Beginners &amp; Design Students - </strong>Want to learn all the basics and how portfolios are made? To understand how to lay the foundation and create a clean, strong portfolio website for yourself.</p><p><br></p><p><strong>UX/UI Designers -</strong> Preparing for a design job? Quickly launch your portfolio website using pre-built templates.</p><p><br></p><p><strong>Artists -</strong> Want to showcase your work and start generating income? Design a simple and engaging website and start receiving orders from all over the world!</p><p><br></p><p><br></p><h2><strong>Need help?</strong></h2><p><br></p><p>Don’t know where to start? Have any questions related to the portfolio kit? We are always looking forward to hearing from our users and providing them with the best support. You can email us at <a href=\"mailto:pahmed980@gmail.com\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">pahmed980@gmail.com</a> and we will be happy to assist you.&nbsp;</p><p><br></p>","url":"https://www.figma.com/community/file/1077604512049165603"}
