{"id":"910626526043566308","name":"Glyphy","lastUpdateDate":"2020-11-20T07:03:33.736Z","publisherHandle":"adispezio","publisherImage":"https://s3-alpha.figma.com/profile/245618ff-d88d-4f11-8576-6e35153256e0","publisherId":"3035911","publisherName":"Anthony DiSpezio","description":"<p>Create 3D anaglyphs from your layers! This plugin uses the order of your layers to apply a 3D effect. You can adjust the depth – how far \"in\" and \"out\" – using the slider.</p><p><br></p><p><strong>You will need red/cyan Anaglyph glasses to see the result in 3D! </strong>You can buy pairs online or check in the back of 3d puzzle books or comics.</p><p><br></p><p><strong>Tips</strong></p><p>The plugin must be run on a single frame containing layers (each layer represents a depth in 3D)</p><p><br></p><p>Use your full screen and increase the brightness for the best possible effect.</p><p><br></p><p>If the effect doesn't look right, it might be too much depth - try reducing the depth with the sliders.</p><p><br></p><p>Fewer layers or groups will result in a more pronounced effect. If there's too many layers, you may not notice the effect (or it'll look really cool - depends on the content).</p><p><br></p><p>Due to the blend modes applied, masks and other advanced effects may not produce the result you expected - try flattening masks or turning off layer blend modes.</p><p><br></p><p>Extended use of the glasses can be jarring or even cause headaches. If the glasses make you feel uncomfortable at all, <strong>take them off immediately.</strong></p><p><br></p><p><strong>FAQ</strong></p><p><em>The 3D effect looks backwards!</em></p><p>It's possible your layers are in reverse order (or maybe you have your glasses on backwards?) You can push the sliders to the opposite ends to reverse the effect.</p><p><br></p><p><em>Why is the width of the 3D image width a little smaller?</em></p><p>To create the 3D effect, layers must be moved to the right and left, this means a small portion of the edge of the image won't be in 3D - you can turn off clipping if you want to see the full image.</p><p><br></p><p><strong>Next Release</strong></p><ul><li>Open source the code</li><li>Allow customization of colors</li><li>Stereograms for VR headsets and Cardboard</li></ul>","url":"https://www.figma.com/community/plugin/910626526043566308","iconUrl":"https://www.figma.com/community/plugin/910626526043566308/icon","thumbnailUrl":"https://www.figma.com/community/plugin/910626526043566308/thumbnail"}
