{"id":"1092746187165628077","name":"Академия Роскосмоса","lastUpdateDate":"2022-04-04T09:43:13.383Z","publisherHandle":"sun_halo","publisherImage":"https://s3-alpha.figma.com/profile/86587666-9c8c-4a5e-a456-57dd7efb9f13","publisherId":"1101335","publisherName":"Петро","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1725022545/9065c19b-c856-4c93-9286-8ee33b84e5f6-cover.png","description":"<p><em>Був в мене в житті такий зашквар як робота з проектом академії росскосмоса. Росіяни \"дивовижні\" в своєму рівні свідомості люди. А в рамках данного проекту — космічні долб**би.&nbsp;</em></p><p><br></p><p><em>Проект вже два роки як вісить в підвішеному положені, через тупу коммунікацію з казково-всратою верхушкою на чолі з рогозіним, самим казковим із всіх.&nbsp;</em></p><p><br></p><p><em>Сьогодні річниця заснування НАТО і командор російського космоса не зміг не привітати хлопців зі святом. А я вирішив опублікувати цей проект для всіх, користуйтесь!)</em></p><p><br></p><p><em>Твітер данного персонажа забавляє весь світ. Цікаво що вони там курять? Ніби як хочуть перші колонізувати Марс. Можемо всі дружньо побажати їм удачі гарного просування в слід за російським воєнним корабльом.</em></p><p><br></p><p><em>Публікую його в тому виді на якому й зупинилися. Можливо UI з проекту комусь ще пригодиться!</em></p><p><br></p><h2><strong>Слава Україні! </strong></h2><p>-------------------------------------------</p><p><em>I had such a hard time in my life as working with the project of the Russian Space Academy. Russians are \"amazing\" people in their level of consciousness. And in the framework of this project - space dolb ** bi.</em></p><p><br></p><p><em>For two years now, the project has been hanging in a suspended position, due to stupid communication with a fabulously fucking top, led by Rogozin, the most fabulous of all.</em></p><p><br></p><p><em>Today marks the anniversary of NATO's founding and the commander of Russian space could not help but congratulate the boys on the holiday. And I decided to publish this project for everyone, enjoy!)</em></p><p><br></p><p><em>This character's Twitter entertains the whole world. I wonder what they smoke there? As if the first ones want to colonize Mars. We can all wish them good luck in advancing in the wake of the Russian warship.</em></p><p><br></p><p><em>I publish it in the form in which we stopped. Maybe the UI from the project will be useful to someone else! </em></p>","url":"https://www.figma.com/community/file/1092746187165628077"}
