{"id":"809865700885504168","name":"❖ Material Theming +  Android 11","lastUpdateDate":"2021-01-15T08:35:05.803Z","publisherHandle":"pratti","publisherImage":"https://s3-alpha.figma.com/profile/c6e97e73-6037-4904-b3b1-3a6c76889d61","publisherId":"5362","publisherName":"Eduardo Pratti","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/625044248/1208389d-df48-46c5-8b04-3141b59b9388-cover.png","description":"<p><strong>Material You update coming soon!</strong></p><h2>The most powerful Material Design UI Kit</h2><p>This template is designed to be an exact replica of the real world Material Design library by Google, and allows for the most comprehensive theming capabilities of any Material UI kit out there.</p><p><br></p><h2>Full Material Theming support</h2><p><br></p><h2>＋ THEMING: SHAPE</h2><p>Cut and rounded corners for all themeable components that can be independently customized across the entire system.</p><p><br></p><h2>＋ THEMING: TYPOGRAPHY</h2><p>Customize all default text styles and add your own. All text styles are applied just like they are in production.</p><p><br></p><h2>＋ THEMING: COLOR</h2><p>Change and tweak color styles named after real tokens used by Material Design to theme components and states.</p><p><br></p><h2>Features:</h2><ul><li><strong>AUTO LAYOUT: </strong>With the exception of a few components, Auto Layout V3 is fully supported, making components responsive and themeable at the same time.</li><li><strong>AUTO TINT [Exclusive]:</strong> System bars change automatically between dark and light mode depending on the background.</li><li><strong>VARIANTS: </strong>This template contains more than 500 variants, allowing for easy customization.</li><li><strong>CODE SAMPLES:</strong> Bridge the gap between design and development with real world documentation on how to implement your changes.</li><li><strong>GUIDES:</strong> This template contains several guides explaining a range of topics, from how Material works to how you can best use these components to your advantage.</li></ul>","url":"https://www.figma.com/community/file/809865700885504168"}
