{"id":"1117053084906718662","name":"Detox Week - Social Pack","lastUpdateDate":"2022-06-10T11:30:09.484Z","publisherHandle":"amirmehmood","publisherImage":"https://www.gravatar.com/avatar/06dbd8e953a99a638abb26c0e9f71add?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"1108255488761950522","publisherName":"Amir Mahmood","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1971786257/b1a3871c-0003-41ce-9fdb-2bdaa36863c4-cover.png","description":"<h2>Detox Week - Social Pack</h2><p>Bikini Bods, here we go! Green Lights for the Detox season! 🙂</p><p>Not an easy approach to weight loss and healthy living lifestyle, BUT at least these juicy and deliciously crafted 4×4 Social Posts Templates will inspire you enough and keep you motivated along the way!</p><p>Summer cannot start without a proper cleanse, right?</p><p>There are 30 Social Media Design Options to choose from and apply to your social media strategy, whether you are a great nutritionist or fitness trainer, a lifestyle blogger, an influencer, a spiritual traveler or a creative entrepreneur.</p><p>Take these health-infused squared posts with you anytime and don’t forget to share your weight-loss plans and intentions!</p><p>And remember: #progressnotperfection !</p><p>Love-Love-Love you!</p><p>SOFTWARE: Yes, you’ll need Photoshop CS6 or higher and a basic knowledge of it. The Quick Guide included in the pack will surely help you out!</p><p>FEATURES:</p><p>– Retina Ready – Yoga Inspired graphics on all HiDPI screen.</p><p>– Google Fonts &amp; Free Fonts&nbsp;</p><p>– All images included – Courtesy of Unsplash.</p><p>– Smart Objects- Easy click-drag-drop-save maneuver for photo replacements.</p><p>– Highly Organized – Highlighted layers and group of layers.</p><p>– Printing Options – Can be exported and ready for print, too, if treated as cards.</p><p>WHAT YOU’LL GET:</p><p>– 30 Photoshop PSD Templates (for CS6+)</p><p>– 30 JPEG Previews for fast document management and ready-to-use intentions.</p><p>– All images in the previews, thanks to Unsplash!</p><p>– PDF Help Guide that will assist you with easy photo replacements tips + free fonts sources.</p><p>SECONDARY USAGE: social media posts, blogs, blog banners, marketing campaigns, branding, wallart, logos, quotes, blogs, website. Actually any place you love!</p>","url":"https://www.figma.com/community/file/1117053084906718662"}
