{"id":"883575758221192875","name":"HCI IPB 2020/2021","lastUpdateDate":"2020-10-23T05:20:09.958Z","publisherHandle":"yasminsalamah","publisherImage":"https://s3-alpha.figma.com/profile/5a51dd51-fcff-4184-8ead-ed009d47a200","publisherId":"2577374","publisherName":"Yasmin Salamah","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/511262341/9c9bf0c9-f01c-4cdb-855a-ed2944a14bd2-cover.png","description":"<h2>This is HCI Project's Template from HCI IPB 2020/2021</h2><h2><br></h2><p>You can check out our design briefs here <a href=\"https://sites.google.com/apps.ipb.ac.id/imk2021?pli=1&amp;authuser=1\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Reimagine Experience</a></p><p><br></p><p>You can use this file to start your HCI Research from making your first empathy map to final presentation. Just duplicate this file then edit this with your teammates as you please. Each corresponding file is used as a roadmap for your research and submission.</p><p>&nbsp;</p><p><strong>For public use outside this course</strong>, This is a community file that you can use for your own HCI Research. Packed with empathy map, how might we, user persona, user journey and others templates.</p><p><br></p><p>------------------------------------------------------------------------------------------------------------------------</p><p><br></p><h2>Ini adalah Template Proyek Praktikum IMK 2020/2021</h2><h2><br></h2><p>Kamu dapat menggunakan template ini untuk memulai proyek mata kuliah ini bersama temanmu. Tinggal duplicate dan mulailah berkerja sesukamu. Setiap files digunakan sebagai pedoman langkah untuk riset dan submisi tugasmu.</p><p><br></p><p><strong>Untuk Penggunaan Publik diluar Course, </strong>Ini adalah file komunitas yang dapat kamu gunakan untuk HCI Researchmu sendiri. Dilengkapi dengan empathy map, how might we, user persona, user journey dll. Kamu dapat menggunakan ini untuk memulai membangun portofolio mu dalam product design. Selamat berkerja~</p>","url":"https://www.figma.com/community/file/883575758221192875"}
