{"id":"1084037200316416947","name":"Business Model Canvas (BMC)","lastUpdateDate":"2022-03-11T08:56:49.144Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1641006922/db224cd8-bda7-4c01-a6cd-25a6983d55f1-cover.png","description":"<p>Structure and plan business models.</p><p><br></p><h2>Summary</h2><p>The Business Model Canvas helps with the structured planning of business models. It can support at the development of new business models as well as at the optimization of existing ones. The Business Model Canvas consists of the following 9 sections:</p><ol><li><strong>Customer segments:</strong>&nbsp;For whom is the business model intended to create added value? Define the target group or your potential customers.</li><li><strong>Value proposition:</strong>&nbsp;What problem is solved for the customer? What added value does the product offer? Optionally, use the Customer Profile &amp; Value Proposition worksheet.</li><li><strong>Channels:</strong>&nbsp;How is the company in contact with the customer? Which touch points are particularly suitable and why?</li><li><strong>Customer relationships:</strong>&nbsp;How is the target group reached? How are new customers acquired and existing ones retained?</li><li><strong>Revenue streams:</strong>&nbsp;How is revenue generated? What are the different sources of revenue and what is their relevance?</li><li><strong>Key resources:</strong>&nbsp;In order to provide a service, various resources are required. Which resources are indispensable for maintaining the value proposition?</li><li><strong>Key activities:</strong>&nbsp;Which activities are necessary to enable customer value?</li><li><strong>Key partners:</strong>&nbsp;Which key partners are required? Are there strategic partners who enrich the business model?</li><li><strong>Cost structure:</strong>&nbsp;Within the framework of a business model, costs are incurred in various ways. Which expenses are important to consider?</li></ol><p><br></p><h2>Step-by-step</h2><ol><li>It is best to go through the BMC as a team to incorporate as many thoughts and approaches as possible. It also helps the team to get on the same page and provide clarity. Invite the team to a meeting and prepare the BMC, printing it out in A3 size or larger at best. Ideally, everyone involved in the meeting has post-it's and a pen in front of them so that everyone can participate in filling the framework.</li><li>Start with the customer segments, because they should be the focus of any development.</li><li>Optional: To delve deeper into the value proposition of the business model, the Customer Profile &amp; Value Proposition worksheet can be used. This extends the two particularly important areas of “customer segments” and “value proposition”. The customer segments, which are called customer profile here, describe the jobs (functional, social, or emotional) that the customer wants to complete, as well as what pains and gains there are. In contrast, the products (or services) of the value proposition are described. In addition, the way in which these products act as pain relievers for the customers is recorded. Finally, the so-called “gain creators” are discussed, which show how gains are created for the customer.</li><li>Once the BMC (and optionally the Customer Profile &amp; Value Proposition worksheet) is completed, they should always be visible to all team members. This allows for recalling the jointly discussed values at any time.</li></ol>","url":"https://www.figma.com/community/file/1084037200316416947"}
