{"id":"814345141907543603","name":"SVG Export","lastUpdateDate":"2021-02-07T00:49:11.815Z","publisherHandle":"Hamish","publisherImage":"https://s3-alpha.figma.com/profile/f28a06ef-4058-411f-85ae-647bc4be6297","publisherId":"555","publisherName":"Hamish","description":"<p>Save time exporting sets of SVGs by creating and assigning presets to optimize your exports. Works great for making icon libraries use clean and consistent SVG code. Optimization uses svgo (<a href=\"https://github.com/svg/svgo\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://github.com/svg/svgo</a>) under the hood.</p><p><br></p><ul><li>Reduce SVG file sizes</li><li>See how options affect the code and appearance of icons in real time</li><li>Use currentColor css property for icons that automatically inherit text color</li><li>Use layer names as classes</li><li>Create and manage presets for different types e.g. single color icons, illustrations, layers for animation</li><li>Export to a <code>.zip</code> file containing all of your selected layers</li><li>Anyone on your team can see and modify presets on a file</li></ul><p><br></p><h2>Comes with 3 pre-made presets</h2><ul><li><strong>Default</strong>: Just reduces file size, shouldn't break anything.</li><li><strong>Monochrome</strong>: Strips out all fills and strokes, uses currentColor as fill on the SVG element.</li><li><strong>Layer Names -&gt; Classes</strong>: Uses your layer names in Figma as classes in the SVG code.</li></ul><p><br></p><h2>Creating your own presets</h2><ul><li>Click <code>Edit presets</code></li><li>Click the plus button in the top right</li><li>Name and configure the options for your preset</li></ul><p><br></p><h2><strong>Sharing presets</strong></h2><p>By default, all presets on a file can be seen and used by anyone with access to the file. Presets are saved on the file, so don't carry across if you create or edit a different file. To keep your presets, click the <code>...</code> more icon in the presets panel and export your presets from one file, open up your new file, and choose the import presets option from the same menu.</p>","url":"https://www.figma.com/community/plugin/814345141907543603","iconUrl":"https://www.figma.com/community/plugin/814345141907543603/icon","thumbnailUrl":"https://www.figma.com/community/plugin/814345141907543603/thumbnail"}
