{"id":"1046106377087666849","name":"Semantic Versioning","lastUpdateDate":"2022-01-18T19:43:54.467Z","publisherHandle":"florian_neumann","publisherImage":"https://www.gravatar.com/avatar/c3f1feb22f5529dda45c4815c90c6a88?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_f_v2.png","publisherId":"1021775861120328923","publisherName":"Florian Neumann","description":"<p>Simplified <a href=\"https://semver.org/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Semantic Versioning</a> for your Figma Nodes without external dependencies and consumable via API.</p><h2><br></h2><h2>Introduction</h2><p>Usually the design work is embedded in a wholesome work process where any design is part of a more complex product. This plugin intents to help you keeping track of changes to your design by simply attaching a version number to your nodes.</p><p><br></p><p>The version number might be used to indicate the expected backend work triggered by the current design changes.</p><p><br></p><p>And it also allows you to reference the version in other tools and assets like issue trackers and documentation.</p><p><br></p><p>This plugin has&nbsp;<strong>no</strong>&nbsp;external dependencies, the version information is saved in the current document.</p><p><br></p><p><em>Be aware the meaning of the word \"backend\" depends highly on your project setup. In a progressive web app the \"backend\" is usually a front-end implementation whereas backend in a classical server-based webpage will be the actual server-side webapp implementation.</em></p><h2><br></h2><h2>How to use this Plugin?</h2><p>Select one or more nodes and run the plugin.</p><p>If you select multiple nodes you will get a list of the selected nodes with their current version status read from the internal plugin data.</p><p><br></p><p>If you select a single node you will get an interface to change the current version of that node according to the implemented version workflow.</p><h2><br></h2><h2>How to use the Version Workflow?</h2><p>The version number consist of three to four numerical parts:</p><p><br></p><pre class=\"ql-syntax\" spellcheck=\"false\">MAJOR.MINOR.PATCH(-rfc.RFC)\n</pre><p><br></p><p>The Rfc-part in brackets is optional and depends on the \"requests for comments\" setting.</p><p><br></p><p>The numbers are supposed to increment only. Goal of providing the version numbers is to allow automagical dependency checking by dependent systems.</p><p><br></p><p><strong>MAJOR</strong></p><p>The MAJOR-release number increase marks a&nbsp;backward-incompatible&nbsp;change of your design.</p><p><br></p><p>Imagine you changed a frame containing a form by removing an input. As you might assume this will break the current implementation of the app using this design because the app actually works with that input and might expect a value attached to it.</p><p><br></p><p>Propagating this change will likely break the backend-implementation. You communicate this by increasing the major release number by one actually saying this is a backward-incompatible change. And you expect it to break the current implementation.</p><p><br></p><p><strong>MINOR</strong></p><p>The MINOR-release number increase marks a&nbsp;backward-compatible&nbsp;change of your design, usually by adding a feature.</p><p><br></p><p>Imagine you extended the functionality of a frame by changing the design to display an additional input element. While this will require backend work to make the input actually work, rolling out the design won't break the application. So that is a backward compatible change of the current design.</p><p><br></p><p>Increasing the MINOR release version communicates you added a change which might require backend work but won't break the current backend implementation.</p><p><br></p><p><strong>PATCH</strong></p><p>The PATCH-release number increase marks a simple fix of your design which does not require any backend work.</p><p><br></p><p>Let's say you adjust some colors or got a ticket telling you a responsiveness feature isn't working as expected. By fixing this you correct the intentional implementation of the current design.</p><p><br></p><p>By using the PATCH version number you communicate there is no change in the backend-interface of your design and it won't require any backend changes.</p><p><br></p><p><strong>RFC</strong></p><p>Depending on your surrounding development process you might not be able to decide on your own when a design is ready to release. In this case you may enable the \"request for comments\"-based workflow.</p><p><br></p><p>The Rfc-workflow adds a&nbsp;<code>-rfc.1</code>-label to the version reflecting the current iteration in your approval process.</p><p><br></p><p>Let's say you make a first draft of a form, since it's a minor change, you choose to add a minor-change and because you have the rfc-workflow enabled you're only minor release option (given your current version is&nbsp;<code>1.0.0</code>) is&nbsp;<code>1.1.0-rfc.1</code>. This communicates you drafted a first version of the intended minor change.</p><p>Your team then discusses your draft and gives you some feedback which requires changes. After these changes you increase the Rfc number resulting in&nbsp;<code>1.1.0-rfc.2</code>. After another discussion with your team all are fine with the changes and you release the design to&nbsp;<code>1.1.0</code>.</p><h2><br></h2><h2>How to use the Settings?</h2><p>The settings are saved per document. That said you will have to adjust the settings once per document.</p><p><br></p><p><strong>Use \"request for comments\"</strong></p><p>Checking this option enables a \"pre-release\" path for your versioning which adds the&nbsp;<code>-rfc.&lt;&lt;number&gt;&gt;</code>&nbsp;counter to the version.</p><p><br></p><p>Using this feature allows you to mark your changes as a \"proposal\" depending on the workflow your design work is embedded in.</p><p><br></p><p>Unchecking this option changes only the available options for you next version change and does&nbsp;not&nbsp;automatically change any saved versions in the document.</p><p><br></p><p><strong>Use version appendix at Node names</strong></p><p>Checking this option enables&nbsp;<code>@</code>-prefixed version appendices for node names. When you save a version on a node, an&nbsp;<code>@</code>-symbol will be added to node name (if it not already exists) and the saved version is appended to the name.</p><p><br></p><p>This feature also adds two more version options \"From Appendix\" and \"To Appendix\" to the user interface (if the version appendix and the internal version of that node differ) allowing you to f.e. manually set or remove the version. Please keep in mind that&nbsp;<code>0.x</code>&nbsp;versions are not supported by this plugin.</p><p><br></p><p>Unchecking this option does currently not remove any version appendices. If you want to remove any version appendices from your nodes you will have to do this manually at the moment.</p><h2><br></h2><h2>API</h2><p>Purpose of this interface is to provide external access to the stored version number (and future properties to possibly come).</p><p><br></p><p>Currently all relevant data is stored as \"shared plugin data\" to allow other plugins consuming the data. All following described fields are part of stable API of this plugin and should be safe to rely on.</p><p><br></p><p><strong>sharedPluginData: version</strong></p><p><br></p><ul><li>Type:&nbsp;<code>string</code>&nbsp;– SemVer-compatible string</li></ul><p><br></p><p>The version is stored as SemVer-compatible string matching the following regular expression:</p><p><br></p><pre class=\"ql-syntax\" spellcheck=\"false\">/\\d+\\.\\d+\\.\\d+(-rfc\\.\\d+)?/i\n</pre><p><br></p><p><strong><em>Example</em></strong></p><p>This example shows how to extract the stored version information from a nopde programatically</p><p>Access the stored property using the&nbsp;<code><a href=\"https://www.figma.com/developers/api#get-files-endpoint\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">GET file nodes</a></code>:</p><p><br></p><pre class=\"ql-syntax\" spellcheck=\"false\">curl -H 'X-FIGMA-TOKEN: &lt;&lt;YOUR_FIGMA_TOKEN&gt;&gt;' 'https://api.figma.com/v1/files/&lt;&lt;YOUR_FIGMA_FILE_ID&gt;&gt;/nodes?ids=&lt;&lt;YOUR_FIGMA_NODE_ID&gt;&gt;&amp;plugin_data=shared'\n</pre><p><br></p><p>Results in:</p><pre class=\"ql-syntax\" spellcheck=\"false\">{\n  \"name\": \"My Fancy Document Title\",\n  ...\n  \"nodes\": {\n    \"108:3\": {\n      \"document\": {\n        \"id\": \"108:3\",\n        \"name\": \"Frame 1@2.0.0-rfc.1\",\n        \"sharedPluginData\": {\n          \"com.github.florianb.figma_semantic_versioning\": {\n            \"version\": \"2.0.0-rfc.1\"\n          }\n        }\n        ...\n      }\n    }\n  }\n}\n</pre><p><em>Please Note: i omitted unnecessary outputs from the result.</em></p><p><br></p><p>As you can see the actual version of the node appears twice, so you might be tempted to use the versions extracted from the node names (which would allow you to use the \"cheaper\"&nbsp;<code>GET file</code>&nbsp;endpoint). But be aware the authorative \"version\" is the one stored in the&nbsp;<code>sharedPluginData</code>&nbsp;section.</p><p><br></p><p>The reason is the user might have renamed the Node changing or removing the version. And there is no way to track this change without the stored plugin data.</p><h2><br></h2><h2>Contribute</h2><p>Thank you for reading so far, any help is welcome. May it be constructive feedback or a Pull Request. We are happy to hear from you.</p><p><br></p><p>License MIT 2022 Florian Neumann.</p>","url":"https://www.figma.com/community/plugin/1046106377087666849","iconUrl":"https://www.figma.com/community/plugin/1046106377087666849/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1046106377087666849/thumbnail"}
