{"id":"1034960139249970136","name":"Lilt Figma Connector","lastUpdateDate":"2021-10-27T00:05:07.884Z","publisherHandle":"lilt","publisherImage":"https://s3-alpha.figma.com/profile/32d5fa4d-3cf8-4a0d-a889-af2fdca9e95d","publisherId":"1022185066796948781","publisherName":"Figma Lilt","description":"<p>Lilt allows you to experiment, iterate, and optimize designs for your customers around the world:</p><ul><li>Iteratively test design spacing, layout, and format across languages</li><li>Design a UX that accommodates (and optimizes for!) multiple languages</li><li>Build a smooth user experience, no matter your customer locale</li></ul><p><br></p><p>What is Lilt?</p><p>Lilt is the modern language services and technology provider. We provide end-to-end, fully managed translation services for enterprise organizations worldwide.</p><p>Lilt combines world-class professional translators, an all-star service team, and adaptive neural machine translation technology to give organizations everything they need to scale their content localization, go-to-market faster than ever, and improve the global customer experience. For more information about working with Lilt, please reach out to <a href=\"mailto:sales@lilt.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">sales@lilt.com</a>.</p><p><br></p><p><br></p><p>How does the Lilt Figma plugin work?</p><p>The Lilt Figma plugin makes it easy to design great customer experiences across any language, right from within Figma. The Lilt Figma plugin offers a dual translation approach, offering the user the flexibility to experiment, iterate, and finalize designs that have been optimized for multiple languages.</p><p>Users can choose Instant Translation, in which translated content is populated from a custom machine translation engine, or Verified Translation, in which content is translated by a human translator with the assistance of the Lilt Platform.</p><p><br></p><p>The Lilt Figma plugin enables you to:</p><ol><li>Design in your base language.</li><li>Test your design by language with Instant Translate.</li><li>Iterate with Instant Translate until satisfied.</li><li>Send your design for Verified Translation when you have finalized your design.</li></ol><p><br></p><p>Key features and functionality include:</p><p>Choosing your preferred translation method</p><p>Sending Figma files to Lilt for localization</p><p>Applying translation memories for each locale</p><p>Receiving completed translations directly in your Figma instance</p><p><br></p><p>For rapid iteration, Instant Translation provides a machine translated version of your design right in Figma within seconds. Once design has been finalized, Verified Translations sends your designs to Lilt, where human linguists translate, review, and approve your newly localized designs before sending them back to your Figma instance.</p><p><br></p><p>An overview video of the <a href=\"https://www.notion.so/4eaac6d6c2d84be9aa6e99d41cbed882\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Lilt Figma plugin can be seen here</a>.</p><p><br></p><p>How to launch this plugin:</p><p>Launch the plugin:</p><ol><li>Open your Figma account.</li><li>Go to the Plugins section and choose Lilt.</li><li>In Figma, launch the Lilt plugin and navigate to Settings.</li><li>Enter your Lilt API key</li><li>Enter the Lilt API URL</li><li>Click \"Save Settings\" to conclude the setup process.</li></ol><p><br></p><p>When the setup is complete, start using the plugin by pushing your Figma strings to the Lokalise project so translators can start working on them right away.</p><p><br></p><p>For more information, visit the <a href=\"https://support.lilt.com/hc/en-us/articles/4407545041815-Figma-\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Lilt knowledgebase here</a>.</p><p><br></p><p>To use this plugin, your company must be a Lilt customer.</p>","url":"https://www.figma.com/community/plugin/1034960139249970136","iconUrl":"https://www.figma.com/community/plugin/1034960139249970136/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1034960139249970136/thumbnail"}
