{"id":"773378597413161605","name":"Smart Text","lastUpdateDate":"2019-11-15T15:06:40.246Z","publisherHandle":"mirkosantangelo","publisherImage":"https://s3-alpha.figma.com/profile/2bcfa2d6-53a7-4ffd-b687-7b1570e203b3","publisherId":"206939","publisherName":"Mirko Santangelo","description":"With Smart text you can create custom text expressions with special tokens connected to the properties of your layers. ￼\nTokens grant you access to layer’s properties, such as size, position, transforms, colors￼, fonts, styles, names, effects and much more. \n\nAfter you make changes on the connected layers, the plugin will update the expressions content with up-to-date data from the layers.\n\nDocumenting design has never been easier: Create and maintain automatic documentations, style-guides, brand manuals, dev specs or any design templates, right in Figma.\n\n——————————————————\n￼￼￼￼\nHOW TO CREATE SMART EXPRESSIONS\n\n1. Access the plugin and select the Insert Tab.\n2. Select at least one layer to connect on the canvas. Plugin will detect your selection and will show the name of the selected layer, or ‘Mixed’ if more than one layer is selected. \n3. Add tokens on the expression input by clicking the items in the Tokens list. The plugin will give you a live preview of the result for the first selected item. \n4. Create a custom expression by mixing plain text and tokens inside the Expression field.\n5. Click Insert to add a text layer containing the expression, on top of each selected layer.\n\nNote: Editing the content or tokens of an expression after the insertion is not currently supported. You’ll have to add a new expression with desired values.\n\n——————————————————\n￼￼￼￼\nHOW TO SYNC SMART EXPRESSIONS\n\n1. Access the plugin and select the Resolve Tab.\n2. Select a scope from the Picker. You can choose to resolve the current Selection, Current Page or the Entire Document.\n3. Click Resolve to proceed. The plugin will detect all available expressions in the Scope and update the content based on the current layer properties. \n\nNote: Expressions connected to missing or deleted layers will be ignored and tagged as Broken. Reconnection is not supported currently. \n\n——————————————————\n\nHOW TO CUSTOMIZE TOKENS OUTPUT VALUE\n\nSome tokens allow their output value to be customized. These tokens use square-brackets in their name. You can customize their output by changing the value inside. \n\nColors: [HEX] -> [RGB]\nDate: [MM.DD.YYYY] -> [hh.mm.ss]\n\n---\n\nAvailable Color Outputs (case-insensitive)\nHEX, RGB, CSS, HSL\n\nAvailable Date Output (case-sensitive)\nSee full list of formats here: https://devhints.io/moment","url":"https://www.figma.com/community/plugin/773378597413161605","iconUrl":"https://www.figma.com/community/plugin/773378597413161605/icon","thumbnailUrl":"https://www.figma.com/community/plugin/773378597413161605/thumbnail"}
