{"id":"1083402318007626350","name":"Import Miro Board","lastUpdateDate":"2022-03-20T00:36:09.332Z","publisherHandle":"pygma","publisherImage":"https://s3-alpha.figma.com/profile/28fec52c-0b39-4a3b-91b3-8b86246025ab","publisherId":"954695657282969674","publisherName":"Pygma","description":"<p>Import Miro boards into FigJam.</p><p><br></p><p>This plugin allows you to connect your Miro account in order to import boards from Miro into FigJam. There is coverage of the most commonly used elements in Miro - text, notes, shapes, frames - but not all cases are covered.</p><p><br></p><p>If you have any issues with the conversion (elements not appearing or significantly different from how they appear in Miro, please leave a comment below or reach out on emile@pygma.app and I will try to fix it ASAP).</p><p><br></p><p><strong>This is a paid plugin</strong> - the first two imports are free, after that you will have to buy credits. Pricing is as follows, one credit = one import from Miro:</p><ul><li>10 credits - $20</li><li>50 credits - $75</li><li>100 credits - $125</li></ul><p><br></p><p><strong>How to use:</strong></p><ol><li>Create a blank file in FigJam ready to import boards into.</li><li>Open the plugin and login with Miro. Your Miro boards will be loaded once you have finished authentication.</li><li>Choose a board and click the \"Import\" button. Make sure that the canvas you are pasting into is empty.</li></ol><p><br></p><p><strong>List of Miro items not currently supported:</strong></p><ul><li>Cards (this will be done soon)</li><li>Tables (this will be done soon)</li><li>Images, embeds and previews (this is due to issues with Miro's API not exposing this information, if you are willing to share your board we may be able to figure another way of fetching this info).</li><li>Kanban, mindmaps (these are not exposed by Miro's API and unlikely to be possible any time soon)</li></ul><p><br></p><p>Reach out or leave a comment if one of the unsupported is a higher priority for you and you are a paying customer (or willing to become a paying customer once it is supported).</p>","url":"https://www.figma.com/community/plugin/1083402318007626350","iconUrl":"https://www.figma.com/community/plugin/1083402318007626350/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1083402318007626350/thumbnail"}
