{"id":"1050099709991781675","name":"Preply - Mobile UX Writer Test Task","lastUpdateDate":"2021-12-07T17:21:20.891Z","publisherHandle":"noahfultonbeale","publisherImage":"https://s3-alpha.figma.com/profile/1141d64e-a495-4156-9adc-6135f59ce5a4","publisherId":"871133","publisherName":"Noah Fulton Beale","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1360868586/f641baa4-11d7-4cf9-a9f0-34a0623a05cf-cover.png","description":"<h2>Background:</h2><p>Product stakeholders and the Mobile Acquisition team app want to increase the rate at which users who download the app convert to students taking a trial lesson. They think the Preply app is missing instant gratification that some competitors provide.</p><p><br></p><p>They believe that matching students with a tutor and giving them a short free lesson during their first time using the app will encourage students to become regular, paying customers and take more lessons.</p><p><br></p><h2>Your challenge:&nbsp;</h2><p>Create wireframes with mid-fi copy for an instant lessons flow, starting after the student chooses the language they’re learning:</p><ul><li>Setting expectations that they will connect with a tutor for a short trial lesson</li><li>Leading them to enter their payment info and start a free trial</li><li>Connecting them with the tutor via video call</li></ul><p><br></p><p>Together with your proposed solution, please give a brief explanation of what went into it:</p><ol><li>The thinking and reasoning behind your choices</li><li>References or competitor benchmarking</li><li>How you would measure the impact of the solution</li><li>Any tech limitations that you considered in your solution</li></ol><p><br></p><p>The designer on the team has gathered some mockups of the flow that new students now experience, along with some assets that show a rough outline of the instant experience we’d like to provide. <a href=\"https://www.figma.com/file/F07WVQLPjjsdgwLe7BLO5N/Preply---Mobile-UX-Writer-Test-Task?node-id=0%3A1\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">See them in Figma</a> or view the attached PNGs.&nbsp;</p><p><br></p><h2>More details:</h2><p>What we’re offering students:</p><ul><li>Trial period (1 day): one free 15-min lesson, 1-on-1 with a tutor. They can connect instantly after they provide their payment info.</li><li>Subscription (4 weeks): one weekly 30-min lesson, 1-on-1 with a tutor. $5 per lesson billed every 4 weeks ($20). Can be cancelled any time.</li></ul><p><br></p><p>About our audience:</p><ul><li>We serve language learners from around the world. They have a variety of goals, but share a desire to speak confidently. Some of the top reasons for learning on Preply are for career/business, moving or traveling to a new country, learning conversational skills, preparing for a language exam, and lessons for kids.</li></ul><p><br></p><p>About our brand:</p><ul><li>Preply is positioning itself as an <em>effective, motivating </em>and <em>human</em> solution for learning languages. We add value to the learning process as a personal language coach.</li></ul><p><br></p><p>About our tone, voice and style:</p><ul><li>Preply voice is <em>friendly, trustworthy, confident, motivational </em>and <em>optimistic</em> but not formal, pushy, serious, disrespectful or bland. Our tone changes depending on the situation, but it's generally informal.&nbsp;</li><li>Many of our customers use our product in a language they don’t speak natively. To help them understand our writing, we aim for simplicity and clarity. </li></ul><p><br></p>","url":"https://www.figma.com/community/file/1050099709991781675"}
