{"id":"1066666291568880125","name":"Font Awesome 6 Icon Set - Free","lastUpdateDate":"2022-01-22T11:09:42.265Z","publisherHandle":"qvsoft","publisherImage":"https://s3-alpha.figma.com/profile/9b64b3b8-d49f-4fb9-88de-8ddecc2680d8","publisherId":"891168103555422752","publisherName":"Vinh Bui","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1481562743/9a4304e7-c92c-4124-b4f6-4fcbea21a0c6-cover.png","description":"<p>The next generation of the web’s favorite icon library + toolkit is now available!</p><p>Font Awesome Kits are the easiest way to get Font Awesome icons into your projects.</p><p><br></p><p>File contains <strong>1,734</strong> Free Font Awesome 6 Icons: https://fontawesome.com/v6.0/icons?m=free</p><p><br></p><p>More details here: https://fontawesome.com/v6.0</p><p><br></p><h2>Accessibility-Minded</h2><p>Font Awesome loves screen readers! With our auto-accessibility feature, it’s super simple to do the right thing for your use</p><p><br></p><h2>Desktop-Friendly</h2><p>Font Awesome is fantastic to work with on the desktop, especially with all-new ligatures. Try it in your next design or presentation!</p><p><br></p><h2>Tried &amp; Tested</h2><p>We've stress-tested them, so that your icons and styling work and display perfectly in all modern browsers.</p><p><br></p><h2>Pixel-Perfect Rendering</h2><p>Our icons are meticulously designed on a grid that helps them render perfectly and makes them legible at any pixel or font-size.</p><p><br></p><h2>Basic Styling Included</h2><p>Size your icons in relation to your UI. rotate, align, mirror, pull and stack them with ease too thanks to our bundled styling.</p><p><br></p><h2>Power Transforms</h2><p>Go further - Shrink, grow, and rotate your icons on a granular scale. Layer or mask multiple icons together with pinpoint accuracy. Or make quick work of counters and badges.</p><p><br></p><h2>Manage &amp; Use Your Way</h2><p>Use Font Awesome how you want: via our CDN, Download Font Awesome to host yourself, or install the latest via npm. We've got component packages and CSS-processors too.</p><p><br></p><h2>With Way More on the Way!</h2><p>We're not done yet. Native app support, more category packs, sharp icons, and more are in the hopper with Version 6.</p>","url":"https://www.figma.com/community/file/1066666291568880125"}
