{"id":"731176732337510831","name":"Themer","lastUpdateDate":"2020-05-07T01:19:38.961Z","publisherHandle":"tom","publisherImage":"https://s3-alpha.figma.com/profile/8ecd165d-35c1-4b1e-a353-0d97280df139","publisherId":"35","publisherName":"Tom Lowry","description":"Themer enables you to create and swap themes from your *published* styles in your team library. Use it for color, text and effect styles.\n\nHow does it work?\nThemer associates published styles with a theme name. When you have multiple themes, Themer will swap styles that match across themes: which means you need two styles with the same names in each theme.\n\nIn order for Themer to be used across your team, generic information about your styles is shared on a external service (jsonbin.io). You will need an account with an API key to get started (You can easily sign in with Google, GutHub or Twitter).\n\nWatch the setup video on YouTube:\nhttps://www.youtube.com/watch?v=aM8SkksBy3Y&feature=youtu.be\n\n1. Insert your API key from JSONbin\n\n2. Create your first theme, giving it a unique name, and then choose where you want to pull the styles from (all local styles, styles used on the page, or a selection).\n\n*Tip*: If all of your styles exist within one document, you can also prefix your style names with 'theme1/' or 'theme2/' and set Themer to generate multiuple themes at once.\n\n3. With your themes created, you can now apply them to a selection or the entire page. Remember, your design must make use of the same styles from one of the themes to work.\n\nPrivacy:\nThemer stores information about your styles at a service external to Figma. For each theme, we store the name of the theme, the name of the style, the type of style (color, text, effect), and a unique key required to import your styles into a document from your team library. No other data from your file is sent to Jsonbin. Your unique API key is storred locally as well, so if you use Themer across devices, between team members, or between Figma Desktop and Figma in the browser, you will need to re-enter your API key and your Bin URL so that everyone/everywhere has access to the same list of Themes.\n\nRemember to publish your styles before creating a Theme :)\n\nRoadmap:\n• Currently Themer does not yet work text boxes which contan multiple text styles, the plan is to enable this in the near future","url":"https://www.figma.com/community/plugin/731176732337510831","iconUrl":"https://www.figma.com/community/plugin/731176732337510831/icon","thumbnailUrl":"https://www.figma.com/community/plugin/731176732337510831/thumbnail"}
