{"id":"1067861418103711637","name":"32 Little Big Updates","lastUpdateDate":"2022-01-26T06:19:30.607Z","publisherHandle":"feedlike","publisherImage":"https://s3-alpha.figma.com/profile/23beaea0-b7b8-4fd0-b9aa-f3c7c04a441d","publisherId":"111503","publisherName":"Feedlike – Product Designer","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1492369588/60385ac7-7e75-4297-a846-9e5dbb2b16c5-cover.png","description":"<p>Когда вы работаете в Figma и FigJam, улучшения качества могут оказать большое влияние на ваш рабочий процесс.</p><p><br></p><p><br></p><p>Благодаря всем вашим отзывам, у нас есть 32 маленьких больших обновлений, которые помогут вам оставаться в курсе событий!</p><p><br></p><h2>Список обновлений:</h2><p>1. Теперь мы поддерживаем загрузку HEIC в Figma и FigJam, поэтому вы можете легко загружать фотографии с iPhone.</p><p>2. Не позволяйте нам замедлять работу — мы внесли исправления, благодаря которым редактирование текста в Figma и FigJam стало в 10 раз быстрее.</p><p>3. Акценты заставляют мир вращаться, поэтому мы рады поддержать акцентное меню macOS в Figma и FigJam. Чтобы активировать, просто нажмите и удерживайте букву, на которую хотите сделать ударение, и выберите.</p><p>4. Маркеры списка останутся согласованными, даже если вы используете смешанные стили текста в Figma и FigJam.</p><p>5. Используйте клавиши Home и End в Figma и FigJam, чтобы быстро перейти к началу и концу текстовой области.</p><p>6. Мы удалили страницу предварительного согласия для внешних ссылок в Figma и FigJam, чтобы вы могли оставаться в курсе событий.</p><p>7. Получайте удовольствие от более широкого спектра возможностей дизайна, теперь, когда вы можете выбирать разные цвета для заливки областей векторной сети.</p><p>8. В настольном приложении Figma ⌘L (Ctrl+L для Windows) скопирует ссылки на файл, а также на выбранные кадры.</p><p>9. Иногда вы просто хотите скрыть наш пользовательский интерфейс — мы это поняли! Мы представили способ переименовывать элементы с помощью ⌘R (Ctrl+R для Windows), когда пользовательский интерфейс скрыт.</p><p>10. Скоро: при вставке скриншотов Retina в Chrome теперь должны использоваться правильные размеры.</p><p>11. Вы можете нажать ⌘ (Ctrl в Windows) и щелкнуть, чтобы выбрать кадры верхнего уровня. Раньше единственным способом выбрать непустой фрейм верхнего уровня с холста был щелчок по его имени.</p><p>12. Вставляйте компоненты (Shift+I) и меняйте местами экземпляры, используя дополнительные функции поиска, чтобы быстро найти то, что вам нужно в вашей дизайн-системе.</p><p>13. Публикация стала намного проще: опубликуйте любой компонент, просто щелкнув правой кнопкой мыши.</p><p>14. При публикации вы также можете выполнять поиск по компонентам.</p><p>15. Избавьтесь от необходимости заходить в файлы и прокручивать библиотеки — опубликованные файлы имеют отдельный узнаваемый значок.</p><p>16. Доберитесь до сути проблемы, перейдя к недопустимым компонентам из модального окна публикации.</p><p>17. В модальном окне публикации вы также можете выбрать, какие компоненты следует скрыть или показать в списке ресурсов.</p><p>18. Приятно знать, какие изменения не были опубликованы, но еще лучше иметь возможность просто опубликовать их на месте… и теперь вы можете это сделать.</p><p>19. Вы всегда можете нажать «Вернуться к экземпляру» при выборе основного компонента.</p><p>20. Связывайтесь напрямую с библиотеками из настроек подписки организации.</p><p>21. Теперь работает экспорт SVG на родительский объект.</p><p>22. Получите больше от своих фигур FigJam с гибкими параметрами изменения размера.</p><p>23. Выберите любой элемент на FigJam и щелкните правой кнопкой мыши, чтобы скопировать прямую ссылку на него.</p><p>24. Теперь вы можете перетаскивать штампы FigJam из колеса.</p><p>25. Еще небольшие, но важные обновления: цвет красной формы FigJam меньше оранжевого и больше красного.</p><p>26. Выделение текста на синем фоне теперь более заметно в FigJam.</p><p>27. В быстрых действиях или ⌘+/ (Ctrl+/ для Windows) теперь есть опция «Показать или скрыть пользовательский интерфейс FigJam».</p><p>28. Вы также можете использовать ярлык быстрых действий (⌘+/ или Ctrl+/ для Windows) для поиска параметра «Разблокировать все объекты».</p><p>29. Кто сказал, что в жизни нет коротких путей? Наведите указатель мыши на встроенную панель инструментов FigJam, чтобы отобразить дополнительные сочетания клавиш.</p><p>30. Создайте новую строку в тексте коннектора, просто нажав Return или Enter (до этого было Shift+Return/Enter).</p><p>31. Объекты будут продолжать привязываться к сетке при перетаскивании.</p><p>32. И, наконец, напоминание о том, что вы можете добавлять командные библиотеки в свой файл FigJam, и теперь мы отдали приоритет этим библиотекам в модальном окне для быстрого доступа.</p><p><br></p><p><br></p><h2><strong>Не забывайте вступать в официальные сообщества Friends of Figma Moscow:</strong></h2><p>👉 <a href=\"https://friends.figma.com/moscow/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://friends.figma.com/moscow/</a></p><p>👉 <a href=\"https://t.me/fofmoscow\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://t.me/fofmoscow</a></p><p>👉 <a href=\"https://www.facebook.com/fofmoscow\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://www.facebook.com/fofmoscow</a></p><p>👉 <a href=\"https://www.instagram.com/fofmoscow\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://www.instagram.com/fofmoscow</a></p><p><br></p><h2><strong>Записи с митапов:</strong></h2><p><a href=\"https://youtube.com/playlist?list=PLjHZTpGXixJIUQRva81r0CO6Y8r0H-6pg\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://youtube.com/playlist?list=PLjHZTpGXixJIUQRva81r0CO6Y8r0H-6pg</a></p>","url":"https://www.figma.com/community/file/1067861418103711637"}
