{"id":"995043407357458639","name":"PT Tunas Sawa Erma Group","lastUpdateDate":"2021-07-08T19:07:15.566Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968352632/59c008fc-c760-4311-9bf3-6662450a141b-cover.png","description":"<p><strong><em>Tunas Sawa Erma Group</em></strong> merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang bisnis perkebunan dan pengolahan minyak kelapa sawit bersama dengan bersama dengan kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang sepenuhnya bergerak didalam bidang budidaya kelapa sawit dan mengolah minyak sawit mentah (Crude Palm Oil/CPO) dan juga berlokasi di Papua. Sejak tahun 1995, Tunas Sawa Erma Group mengawali bisnis kelapa sawit di Papua atas keinginan Pemerintah Daerah. Kondisi infrastruktur saat itu senantiasa minim, namun Tunas Sawa Erma Group mampu berkembang baik dan termasuk jadi pihak pertama yang berkontribusi didalam pembangunan jalur Trans-Papua.</p><p><br></p><p>Sesuai bersama dengan bersama dengan visi dan misi untuk jadi perusahaan global, Tunas Sawa Erma Group punya komitmen pada kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang sudah berlangsung dan tertuang secara sadar di web formal perusahaan. Areal konsesi kita tidak berlokasi di lahan gambut. Selain itu, TSE Group termasuk menciptakan sistem dan lingkungan kerja yang menunjang pengembangan sumber daya manusia lewat program seleksi dan pelatihan dan juga pembangunan berkelanjutan. Saat ini perusahaan termasuk sudah punya tim Sustainability.</p><p><br></p><p>Kami termasuk mengapresiasi kontribusi para karyawan yang senantiasa berkembang bersama dengan bersama dengan perusahaan. Atas dedikasinya, Tunas Sawa Erma Group sudah mempromosikan 70% berasal berasal dari karyawan jadi karyawan tetap. Kemajuan wanita termasuk jadi bagian berasal berasal dari perhatian kami. Sebanyak 20% berasal berasal dari total karyawan adalah perempuan dan kita senantiasa menunjang untuk meraih potensi paling baik mereka.​</p><p><br></p><p>Tak cuma itu, Tunas Sawa Erma Group Sebagai perusahaan termasuk senantiasa pelihara hubungan yang cocok dan saling membangun bersama dengan bersama dengan Pemerintah Daerah maupun masyarakat setempat, dan juga senantiasa aktif didalam aktivitas pengembangan ekonomi dan kesejahteraan masyarakat Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang sudah beroperasi yaitu milik PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.&nbsp;</p>","url":"https://www.figma.com/community/file/995043407357458639"}
