{"id":"1030790287382118338","name":"Supersearch","lastUpdateDate":"2021-11-11T16:22:03.858Z","publisherHandle":"pygma","publisherImage":"https://s3-alpha.figma.com/profile/28fec52c-0b39-4a3b-91b3-8b86246025ab","publisherId":"954695657282969674","publisherName":"Pygma","description":"<p>Fast search across all of your Figma files.</p><p><br></p><p>This is different from all other Figma search plugins in that it allows you to search across all of your files at once (Figma and FigJam). The search is fast regardless of the size of your files.</p><p><br></p><p>After searching, click on the result to go to that node if it is in the same file. If it is in a different file, the link to that node will be copied to the clipboard and you can then paste the URL in the browser or use File &gt; Open File URL From Clipboard in the desktop app.</p><p><br></p><h2><strong> FAQ</strong></h2><p><br></p><p><strong>Q: How is this different from all the other search plugins?</strong></p><p><strong>A: </strong>This creates an external search index which allows you to search across all of your files not just the current one. It's also much faster and you won't have the experience of the plugin freezing on larger files.</p><p><br></p><p><strong>Q: Do I have to pay for this?</strong></p><p><strong>A: </strong>Yes, it's $5 per user per month after a 7 day free trial (no card required). The cost of storage for the search indexes is significant, there is no way this could be made free.</p><p><br></p><p><strong>Q: Does this work on FigJam and Figma?</strong></p><p><strong>A: </strong>Yes.</p><p><br></p><p><strong>Q: How do I set this up?</strong></p><p><strong>A: </strong>You need to sign in with Figma and provide your Figma team links to allow the plugin to access the contents of your files and create a search index for you. This process can take 5-15 minutes depending on the number and size of your files. Keep in mind this means that some of the information in your Figma files will be stored on an external server.</p><p><br></p><p><strong>Q: Is our data secure?</strong></p><p><strong>A: </strong>Yes, indexes are created separately for each team and cannot be accessed publicly. However, if it is against your company policy to allow any of this data to be stored externally then this plugin cannot be used.</p><p><br></p><p><strong>Q: How do I get my team links to set up the index?</strong></p><p><strong>A:</strong></p><ol><li>Go to the home page in Figma (in a web browser, not the desktop app).</li><li>Click on the name of your team.</li><li>Copy and paste the URL into the input that appears when you open the plugin. (The URL should look something like: https://www.figma.com/files/team/12345678/Team.)</li><li>Repeat the above steps for each team you want to be able to search across.</li></ol><p><br></p><p><strong>Q: How do I invite other team members to use the same search?</strong></p><p><strong>A: </strong>Click on the settings icon and then on \"Generate invite code\". Give this code to your team members and ask them to submit it when they install the plugin. The code will be valid for 72 hours.</p>","url":"https://www.figma.com/community/plugin/1030790287382118338","iconUrl":"https://www.figma.com/community/plugin/1030790287382118338/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1030790287382118338/thumbnail"}
