{"id":"741940457537193498","name":"Airtable to Figma","lastUpdateDate":"2020-11-29T20:44:50.358Z","publisherHandle":"thomasgh","publisherImage":"https://s3-alpha.figma.com/profile/ce3106e2-375d-483d-b386-a986e1efa7b6","publisherId":"669615","publisherName":"Thomas Ghysels","description":"<p>Airtable &amp; Figma, kinda sounds like an unusual marriage, right? Sure, until you need to design an entire data table, or a dozen different cards of the same variety, at which point you’ll be wishing for an easier way to go about it. Luckily, now there is! This plugin allows you to effortlessly pull text and images from an Airtable database and inject them straight into your Figma components. Using the plugin is child’s play. First, you build your component in Figma, business as usual. Then, you load up the Airtable 2 Figma plugin, and map the Airtable data fields to the right layers in Figma. Finally, choose the layout you want your component to be laid out as and voilà, you just saved yourself a couple hundred clicks! You now have a nice set of data directly inserted&nbsp;into your designs.</p><p><br></p><p>Learn more at: https://figma.bothrs.com</p><p><br></p><p>This plugin is not under active maintenance or support, but you can discuss things at https://github.com/thgh/Airtable-to-Figma</p><p><br></p><p>Take a gander at the data types we can import directly from Airtable into Figma:</p><p><br></p><p>1. Single line text</p><p>2. Long text</p><p>3. Phone number</p><p>4. Email</p><p>5. Numeric</p><p>6. Image</p><p><br></p><p>Here’s a sample database (about cats) for you to experiment with: https://airtable.com/shr0hyEnBae0AKKfQ</p><p><br></p><p>Next, follow these steps, or watch a tutorial video over at https://figma.bothrs.com</p><p><br></p><p>1. Go to https://airtable.com and build or select your own table</p><p>2. In your Airtable of choice, click ‘Share’</p><p>3. Scroll down and click ‘Create a shared view’</p><p>4. Click ‘Share the current view’</p><p>5. Next, click ‘Create a shareable grid view’.</p><p>6. Then, copy the link and paste it in the plugin window.</p><p>7. Assign Airtable columns to text nodes or images.</p><p>8. Select the view you want to use and configure the rest</p><p>9. Done! For every row in your table, an instance will be created.</p><p><br></p><p>Sounds pretty cool, right?</p><p><br></p><p>Missing a particular feature? Hit us up at https://github.com/thgh/Airtable-to-Figma/issues</p>","url":"https://www.figma.com/community/plugin/741940457537193498","iconUrl":"https://www.figma.com/community/plugin/741940457537193498/icon","thumbnailUrl":"https://www.figma.com/community/plugin/741940457537193498/thumbnail"}
