{"id":"1102187573752238174","name":"Retrospective in the Island of Golocans","lastUpdateDate":"2022-05-22T10:45:15.967Z","publisherHandle":"clydedz","publisherImage":"https://s3-alpha.figma.com/profile/24d9faeb-986c-4e9d-abb6-e78f3753d60e","publisherId":"956795281648080877","publisherName":"Clyde D'Souza","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1897752171/fad507e6-cde8-4cb5-ac96-1737629436cb-cover.png","description":"<p>The Island of Golocans has four very unique characteristics. The West has an abundance of sweet fruits, green hills and plenty of trees for some shade during peak summer. Apparently, the North of this island has some hidden gold coins near a lighthouse. In this region, one might spot plenty of starfish, too. The East coast is notorious for invading pirates - not all of them make it through the rough seas, though. The few that make it have to then climb up very uncomfortable rocks and only then will they be able to enter this island. Finally, the South Island, which is also known as Golifish, is connected with a wooden bridge. This region is very popular with voyagers who often come here and leave notes in glass bottles for future readers. They often also leave items of significance, like a compass, for guiding their journey to this island.&nbsp;</p><p><br></p><p>When performing a retrospective on the Island of Golocans, remember to cover all four directions:</p><ul><li>Sweet fruits! What went well during the last sprint? Add a post-it note with your thoughts and celebrate your wins.</li><li>Hidden gold! Give your team a shout-out for the amazing work they've been putting in, the nuggets of information they provide, and for just being an awesome person to work with.&nbsp;</li><li>Pirates on the shore! This doesn't sound good, does it? Recall what didn't go well in the last sprint and write them down on each post-it note.</li><li>Message in a bottle! Record action points for the future. If you've thought of actionable items you and your teammates could work on to ensure that things can be better in the next sprint, make a note of them. If you have general ideas that can be implemented in the next sprint, make a note of them, too!&nbsp;</li></ul><p>Have a pleasant time exploring this island!</p>","url":"https://www.figma.com/community/file/1102187573752238174"}
