{"id":"803370930903876544","name":"AD Compressor","lastUpdateDate":"2021-07-02T20:58:14.998Z","publisherHandle":"wei","publisherImage":"https://s3-alpha.figma.com/profile/a1fae4ca-9872-4cab-b52c-985c962868cd","publisherId":"2062376","publisherName":"Wei Zhong","description":"<p>If you are designing and developing Google static banner ads, you must make sure all the image file sizes meet the ≤150kB specification.</p><p><br></p><p>With AD Compressor, you can compress multiple display banner ads with a click. The plugin is completely FREE for use as long as your compression usage is available.</p><p><br></p><p>HOW TO USE</p><p><br></p><p>1. Install `AD Compressor` and run it inside of a project</p><p>2. Enter and verify your Tinify API(require for the first time — browser, application or machine)</p><p>3. Select frames or objects you want to compress(by default, ONLY the existing &amp; visible FRAME(s) would be automatically selected.)</p><p>4. When all the frames are ready, you can hit `COMPRESS` button to compress all images are over 150kB(default)</p><p>5. OPTIONAL: if you would like to give a nice formatted prefix for each image, you can use the `OUTPUT PREFIX` input field</p><p>6. Once the compression is done, you can `DOWNLOAD` all the final outputs within a ZIP</p><p><br></p><p>NOTES</p><p><br></p><p>- This plugin would only compress if the image is over than the compression setting(default 150kB), any file sizes are lower than this setting would not run compression(The idea is to make the image size smaller but keep the best quality).</p><p><br></p><p>- By default, ONLY the existing FRAME(s) would be automatically selected. If you want to compress anything that is not within a frame, you would need to select individually or select multiples at one time.</p><p><br></p><p>- Recently, the plugin has integrated with a free server-side compression(Tinify API — TinyPNG) which could provide a better image quality.</p><p><br></p><p>- All Responsive ADs(sizes are up to 5 MB) or images are over to 5 MB would skip compressing</p><p><br></p><p>Built with love by the ©SearchKings team.</p>","url":"https://www.figma.com/community/plugin/803370930903876544","iconUrl":"https://www.figma.com/community/plugin/803370930903876544/icon","thumbnailUrl":"https://www.figma.com/community/plugin/803370930903876544/thumbnail"}
