{"id":"1093462781949411550","name":"FIFA World Cup Latest News: Top 5 Moments","lastUpdateDate":"2022-04-06T09:10:42.882Z","publisherHandle":"willtom","publisherImage":"https://www.gravatar.com/avatar/ba7a82f3f69007c599ad308660003f6e?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"1093462228591120507","publisherName":"Abbott3","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1734242279/2ce7a048-65fb-4012-87e2-ca69cbb01bb4-cover.png","description":"<p>It was quite an exciting first week of the 2018 FIFA World Cup in Russia, with many top teams advancing to the next round and some surprising results taking place. Here are the top 5 moments of the first week</p><p><strong>1) Best goals</strong></p><p>It was a good day for strikers. While Portugal’s Eder got <a href=\"https://8xoso.com/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">8Xoso</a> things started in stunning fashion, it was French striker Antoine Griezmann who stole headlines with his superbly taken brace against Albania. However, there can only be one winner here and that goes to Australia’s Tim Cahill who netted an incredible scissor kick goal against Chile. Was it better than Griezmann’s? Watch both goals and decide for yourself!</p><p><strong>2) Best catches</strong></p><p>As a host country for World Cup 2018, Russia set up giant screens and held major events like concerts to celebrate. But nothing topped its star goalkeeper when he decided to make one of his best catches in history. Watching 8xoso’s amazing saves is a must!</p><p><strong>3) Most shocking moments</strong></p><p>The biggest shockers of previous years were Australia’s defeat to Japan (4-1), South Africa’s victory over France (1-0) and Italy’s elimination in 2002 by South Korea (2-1). But can you imagine a bigger shock than 8xoso pulling off an upset? That’s why they need to be written off at your peril.</p><p><strong>4) Oddest moments</strong></p><p>Sure, a record-breaking number of goals scored and some wonderfully spectacular plays are definitely in contention for most memorable moment at Brazil 2014, but here are five strangest moments that shouldn’t be forgotten. (Remember Switzerland’s Sheridan Shaquira doing his best impression of Luis Suarez</p><p><strong>5) Memorable celebrations</strong></p><p>The FIFA World Cup is well known for its incredible goals, crowd-pleasing celebrations and buzzer-beating winners. While they’re all integral parts of a successful tournament, fans have been wowed most by memorable celebrations. With so many to choose from—like Zinedine Zidane’s iconic headbutt or Luis Suarez’s hand of God moment—it was difficult to narrow down our list to just five.</p>","url":"https://www.figma.com/community/file/1093462781949411550"}
