{"id":"846896630095645141","name":"Playground: visualizando CSS Flexbox usando o Figma","lastUpdateDate":"2022-02-17T03:01:02.975Z","publisherHandle":"victoriamolgado","publisherImage":"https://s3-alpha.figma.com/profile/369a0e8b-2043-45a2-98fe-2af9371a3b8f","publisherId":"67273","publisherName":"Victória Molgado","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1564380694/082e5dec-c44d-4d61-bae5-ee7e28e41fdd-cover.png","description":"<p>Motivação</p><p>HMTL e CSS não necessariamente são difíceis, mas usá-los de maneira otimizada pode causar uma grande mudança de paradigma na forma de pensar de designers.</p><p><br></p><p>Demorei anos para entrar no ritmo dessas ferramentas e mesmo hoje, depois de ter feito meu portfólio e colaborado com algumas páginas em projetos da empresa em que trabalho, sinto pouco domínio sobre como pensar CSS — como resolver problemas gráficos com essa abstração?</p><p><br></p><p>A proposta</p><p>Uma forma de aprendizado por associação: usar uma ferramenta para aprender outra.</p><p><br></p><p>Quando descobri como o Auto Layout do Figma funcionava, vi a possibilidade de estudar CSS Flexbox de uma maneira diferente: associar as regras desse jeito de escrever CSS com a interface de uma ferramenta de prototipagem que, por natureza, é familiar para designers.</p><p><br></p><p>Essa extrapolação serviu para que eu visualizasse melhor como Flexbox funciona e me ocorreu que talvez também seja útil para outros designers visualizarem CSS Flexbox enquanto estão projetando, ou ter uma fonte de consulta mais familiar para quando forem trabalhar com CSS.</p><p><br></p><p>Confira a motivação completa e um pouco da história do Flexbox neste artigo:</p><p><br></p><p><a href=\"https://medium.com/@victriamolgado/css-flexbox-para-quem-n%C3%A3o-sabe-css-usando-o-figma-para-entender-os-princ%C3%ADpios-3869e920a0c6\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://medium.com/@victriamolgado/css-flexbox-para-quem-n%C3%A3o-sabe-css-usando-o-figma-para-entender-os-princ%C3%ADpios-3869e920a0c6</a></p>","url":"https://www.figma.com/community/file/846896630095645141"}
