{"id":"1080312232443992632","name":"p5.js Pad - Code Art Editor","lastUpdateDate":"2022-03-01T02:59:40.846Z","publisherHandle":"hydrosquall","publisherImage":"https://s3-alpha.figma.com/profile/b79da424-940e-48ea-9788-5ca0246d5736","publisherId":"929101598752418604","publisherName":"Cameron Yick","description":"<p><br></p><p><code>p5.js is a JavaScript library for creative coding, with a focus on making coding accessible and inclusive for artists, designers, educators, beginners, and anyone else! p5.js is free and open-source because we believe software, and the tools to learn it, should be accessible to everyone.</code>- <a href=\"https://p5js.org/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">P5 Homepage</a></p><p><br></p><h2><strong>Main Features</strong></h2><p><br></p><ul><li>Write p5.js sketches, press \"play\" to see output</li><li>Save pictures of your work to the Figjam canvas</li><li>Full-featured code editor - undo, syntax highlighting, error detection, renaming variables, etc all work. Provides line numbers to help if your code has an error.</li></ul><p><br></p><h2>Why</h2><p><br></p><p>I have a <a href=\"https://www.serendipidata.com/posts/animating-gifs-of-project-progress\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">long-standing interest</a> in keeping track of the evolution of visual designs - what were the twists and turns explored, the dead ends, the roads almost taken? I want to know them and see them.</p><p><br></p><p>Taking screenshots of how art looked at different snapshots is a good start, but what if you could quickly restore and modify the code that produced a picture?</p><p><br></p><p>p5.js is one of the most popular and welcoming libraries for computational creativity. I adapted the code editing experience of the<a href=\"https://editor.p5js.org/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"> p5 web editor</a> to work within in the Figjam environment, and support exporting images.</p><p><br></p><h2>Advanced features</h2><p><br></p><ul><li>Keyboard shortcuts: cmd+enter to play your code</li><li>Built in color swatch picker (copies colors to clipboard)</li><li>\"Tidy\" formats your code (indentation, spaces)</li><li>\"autorun\" in settings rerun your code on every keystroke (only use for basic</li><li>Press F1 for a variety of Monaco special features, include high contrast mode for visual accessibility</li></ul><p><br></p><h2>Acknowledgements</h2><p><br></p><ul><li>This builds on the work of several open source projects, including jshint, Monaco editor, dom-to-image, and of course, the p5.js library</li><li>The architecture for this widget is based on a combination of the <a href=\"https://editor.p5js.org/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">p5 web editor</a> (led by Cassie Tarakajian) and Live Code Block by Cole Bemis.</li></ul>","url":"https://www.figma.com/community/widget/1080312232443992632","iconUrl":"https://www.figma.com/community/widget/1080312232443992632/icon","thumbnailUrl":"https://www.figma.com/community/widget/1080312232443992632/thumbnail"}
