{"id":"1039957324840667051","name":"Vimeo Record","lastUpdateDate":"2021-12-07T16:18:50.820Z","publisherHandle":"2609bee5_500d_4","publisherImage":"https://s3-alpha.figma.com/profile/9906a6e6-89b7-4436-bd17-2af677bf6a7d","publisherId":"984548592423782910","publisherName":"Vimeo","description":"<h2><strong>Bring excitement back to virtual collaboration with video messaging</strong></h2><p><br></p><p>The Vimeo Record plugin allows you to record your screen, webcam, or both directly from the files you’re collaborating on in Figma and FigJam. This means that you can spend less time typing out your feedback, and more time capturing ideas right as inspiration strikes.</p><p><br></p><p>To leave live feedback in FigJam, simply record your comments in the file of choice, then watch your video preview unfurl alongside your work. When working on a project in Figma Design, you can embed your video as a thumbnail directly on the Figma canvas. Your collaborators can then watch your comments, ideas, or accolades via simple playback within your whiteboard or canvas.</p><p><br></p><p><strong>Here’s how your team can use Vimeo Record to work better together:</strong></p><p><br></p><ul><li><strong>Project onboarding</strong>: Record a short welcome video to review goals, progress, and next steps so new team members can get up to speed quickly without the need for another meeting or lengthy email.</li><li><strong>Design feedback</strong>: Highlight specific visual elements while narrating your feedback to keep your ideas in context.</li><li><strong>Async ideation</strong>: Share your ideas at the moment inspiration strikes to add more engaging context to your projects -- then let your team watch and respond with comments when it’s convenient for them.</li></ul><p><br></p><p><strong>How to get started:</strong></p><ol><li>Download the Vimeo Record plugin</li><li>Connect Vimeo to your Figma account</li><li>Select recording modes</li><li>Create your video</li><li>Add video to canvas or share link to it with your team</li><li><a href=\"https://vimeo.zendesk.com/hc/en-us/articles/4415753338509\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Check this How-to article for more details</a></li><li><a href=\"https://vimeo.com/record?utm_campaign=screen_recorder&amp;utm_content=figma_community_page_cta&amp;vcid=\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Install Vimeo Record Chrome Extension to record videos wherever you go</a></li></ol>","url":"https://www.figma.com/community/plugin/1039957324840667051","iconUrl":"https://www.figma.com/community/plugin/1039957324840667051/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1039957324840667051/thumbnail"}
