{"id":"1063494652261429841","name":"Upspeed - Convert designs to Jetpack Compose (Alpha)","lastUpdateDate":"2022-01-31T03:49:05.497Z","publisherHandle":"upspeed","publisherImage":"https://www.gravatar.com/avatar/b37d05c0cbb9228b0f7e7dad40fc3f51?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_u_v2.png","publisherId":"1063491293567223841","publisherName":"Upspeed.io","description":"<p><strong>Figma to mobile code in one click.</strong></p><p><br></p><p>Spending too much time building UI ? Having a hard time reducing the inconsistency between design and development ? Don't have time to get up to speed with Jetpack Compose ? Upspeed's Figma plugin can help you quickly translate your Figma UI elements to secure, production ready code.</p><p><br></p><p>What sets us apart is that the code we generate is as if you have another developer working with you. Upspeed uses the right UI constructs based on characteristics of the UI element, relationship with elements around it and generates secure, optimized code that can be imported into your application. Since you control the code, make any additional modifications as needed.</p><p><br></p><p>Our mission is to help individuals and teams build faster and use their valuable time creating unique value instead.</p><p><br></p><p>With Upspeed, you can today translate your Figma components into corresponding Jetpack Composables. Support for composables and full screen support is in the works!</p><p><br></p><p><strong>How does it work?</strong></p><ol><li>Install the Plugin</li><li>Open your Figma file. Right click on the workspace, and choose Upspeed from your list of plugins</li><li>Select the component you want to translate</li><li>Update the type of element from our dropdown list</li><li>Click 'Generate'</li><li>'Copy to Clipboard' to copy the code into your IDE</li></ol><p><br></p><p><strong>Best practices</strong></p><p>Figma components enable you to create elements you can reuse across your designs. They help to create and manage consistent design across your project. Use Upspeed's Figma plugin to select and translate those reusable elements that can be used to build your UI quickly and in a consistent manner.</p><p><br></p><p><strong>Questions?</strong></p><p>We value your feedback! Let us know what else you would like to see in this application. Email us at support@upspeeed.io or submit your feedback <a href=\"https://upspeed.io/feedback\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">here</a>.</p><p><br></p><p>Check out our <a href=\"https://upspeed.io/resources\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Help Center</a> to get started. Report an issue <a href=\"https://upspeed.io/reportissue\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">here</a>.</p>","url":"https://www.figma.com/community/plugin/1063494652261429841","iconUrl":"https://www.figma.com/community/plugin/1063494652261429841/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1063494652261429841/thumbnail"}
