{"id":"838959511417581040","name":"Blush","lastUpdateDate":"2021-07-28T19:11:21.829Z","publisherHandle":"blush","publisherImage":"https://s3-alpha.figma.com/profile/d7e7cc19-34ce-4a84-a271-2a8dd87c9e1c","publisherId":"894281236677779372","publisherName":"Blush","description":"<p>Create and customize illustrations in your designs with Blush. Just choose a collection, pick a composition, and place it on the canvas. You can keep playing with the variations in the illustration to create something unique that fits your brand.</p><p><br></p><p>MIX-AND-MATCH</p><p>Blush works with mixable elements, so you can customize every variablee of an illustration to create your own unique compositions. It's like playing with legos, made of vectors.</p><p><br></p><p>RANDOM</p><p>If you’re feeling lucky, just click the Random button to shuffle the components in a composition. Embrace the chaos! (controlled chaos)</p><p><br></p><p>ARTISTS</p><p>You'll have access to gorgeous illustrations by artists from around the globe. We're collaborating with some of the most talented illustrators to keep creating collections with unique styles every week.</p><p><br></p><p>FREE LICENSE</p><p>We have a forever-free plan that allows you to use any illustration for personal and commercial purposes. Just create an account to start designing stuff! Worry-free!</p><p><br></p><p>SVG &amp; HI-RES</p><p>If you need SVG, more control over the layers, color filters, print-level resolution, and other advanced functionality, subscribe to our paid plan. Your support will help bring more amazing illustrators to Blush (and support our caffeine addiction.)</p><p><br></p><p>We can’t wait to see what you create with Blush!</p><p><br></p><p>Share your creations with the hashtag #madewithblush</p>","url":"https://www.figma.com/community/plugin/838959511417581040","iconUrl":"https://www.figma.com/community/plugin/838959511417581040/icon","thumbnailUrl":"https://www.figma.com/community/plugin/838959511417581040/thumbnail"}
