{"id":"1030968261424288884","name":"Commentful Feedback Workflow","lastUpdateDate":"2022-03-28T23:13:08.878Z","publisherHandle":"hypermatic","publisherImage":"https://s3-alpha.figma.com/profile/93d3bf6b-4d42-4ae7-8029-9f094113198f","publisherId":"247","publisherName":"Hypermatic","description":"<p>Supercharge your Figma comments and gather external feedback from stakeholders.</p><p><br></p><h2>Features</h2><p><br></p><ul><li>Organize Figma comments with custom statuses on a kanban board.</li><li>Supercharge your Figma comments by adding tags, due dates and todos.</li><li>See all todos assigned to you (and your own private todos) in one place.</li><li>Easily filter your Figma comments by frames, dates, status, users, tags.</li><li>Instantly search for Figma comments with autocomplete results.</li><li>Add markdown formatting, links and lists to your Figma comments.</li><li>Gather external design feedback from anyone outside of your Figma file.</li><li>Automatically apply external text and image feedback in Figma with one click.</li><li>Export your Figma comments, todos and external feedback to a spreadsheet.</li></ul><p><br></p><h2>To use Commentful</h2><p><br></p><ol><li>Install and run the “Commentful Feedback Process” plugin.</li><li>Paste in your Figma API Token and Figma File URL to link your Figma comments.</li><li>Click the \"Figma Comments\" tab to organize and supercharge your Figma comments.</li><li>Click the \"My Todos\" tab to see and check-off any assigned or private todo lists.</li><li>Click the \"Reviews\" tab to create shareable review URLs and view incoming feedback.</li></ol><p><br></p><h2>Documentation</h2><p><br></p><p>For Commentful documentation, visit <a href=\"https://docs.hypermatic.com/commentful\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://docs.hypermatic.com/commentful</a></p><p><br></p><h2>License</h2><p><br></p><p>After you've tried using Commentful 20 times, you'll be asked to enter your license key. Your license key will allow you or your team to have unlimited use of Commentful.</p><p><br></p><p>To purchase a license for you or your team, please visit <a href=\"https://hypermatic.com/commentful\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://hypermatic.com/commentful</a></p>","url":"https://www.figma.com/community/plugin/1030968261424288884","iconUrl":"https://www.figma.com/community/plugin/1030968261424288884/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1030968261424288884/thumbnail"}
