{"id":"1032634079536376448","name":"POEditor","lastUpdateDate":"2021-11-05T13:48:10.743Z","publisherHandle":"poeditor","publisherImage":"https://s3-alpha.figma.com/profile/3f5aaa81-ef60-4080-8ea5-b957a4e053f1","publisherId":"1030024715512774230","publisherName":"POEditor","description":"<p><strong>What is POEditor?</strong></p><p><br></p><p>POEditor is a highly scalable online translation platform and localization management system, designed to bring together developers, product managers, translators, designers and copywriters in their effort of making multilingual software, and to automate the localization workflow.</p><p><br></p><p>Trusted by companies like Bosch, Adidas and Ubisoft, POEditor brings transparency to the localization process, boosting productivity and collaboration between product, design and localization teams and helping avoid possible localization bugs.</p><p><br></p><p>For more information on the POEditor platform, please visit: <a href=\"https://poeditor.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://poeditor.com/</a></p><p><br></p><p><strong>How Figma and POEditor work together</strong></p><p><br></p><p>To connect Figma to a POEditor account, enter the API key of that POEditor account in the Figma plugin.</p><p><br></p><p>You’ll be able to create new projects on that account using the plugin, or work with projects which already exist in POEditor.</p><p><br></p><p>The POEditor plugin for Figma works both ways, so you can send texts from Figma files to POEditor translation projects and fetch translations from POEditor to Figma.</p><p><br></p><p>In POEditor, multiple translation options are available:&nbsp;</p><ul><li>assigning your own translators to specific languages, by adding them as contributors</li><li>crowdsourcing translations from your community, using public projects</li><li>ordering human translation services from integrated language service providers</li><li>using machine translation APIs from DeepL, Google or Bing</li></ul>","url":"https://www.figma.com/community/plugin/1032634079536376448","iconUrl":"https://www.figma.com/community/plugin/1032634079536376448/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1032634079536376448/thumbnail"}
