{"id":"974496433337884240","name":"CoShuffler","lastUpdateDate":"2021-10-08T03:50:50.974Z","publisherHandle":"ndrewgood","publisherImage":"https://s3-alpha.figma.com/profile/b4fab510-f5ec-4d1e-bcf6-e88c16290e96","publisherId":"1066332","publisherName":"Andrew Goodridge","description":"<p><strong>A tool for randomly assigning colors to a selection of objects from a chosen color palette!</strong></p><p><br></p><h2><strong>Usage</strong></h2><p>Quickly apply an assortment of colors to large selection of objects.</p><ul><li>Create cool, complex patterns for backgrounds!</li><li>Make color iterations of logos, buttons, etc!</li><li>Mock up data visualizations without the hassle!</li></ul><p><br></p><h2><strong>Instructions:</strong></h2><ol><li>Install CoShuffler by pressing the \"Install\" button in the top-right corner of this page.</li><li>In your figma file, open the CoShuffler by right clicking on the canvas -&gt; Plugins -&gt; CoShuffler</li><li><strong>Set your palette:</strong> Select a group of objects which contain your desired color palette, and then click \"Set colors\".</li><li><strong>Select your objects: </strong>Once your palette is set, select one or more objects that you want to shuffle</li><li><strong>Start Shuffling:</strong> Click \"GO!\" to start shuffling between colors in your palette!</li><li>(Optional) On the \"info\" page, choose whether to enable or disable strokes and fills from being adjusted by the CoShuffler.</li></ol><p><br></p><h2><strong>Constraints:</strong></h2><ul><li>Currently, <strong>CoShuffler will ignore groups, frames, and components</strong>. If you want to shuffle objects in groups, either directly select the objects or ungroup them.</li><li>Image and gradient fills will be ignored.</li><li>If your object has multiple fills, CoShuffler will only change the top fill. It won't affect opacity settings of fills either.</li></ul><p><br></p><p><strong>This plugin was made for fun in my free time, if you want to see more of my work, check my website: </strong><a href=\"https://ndrewgood.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">ndrewgood.com </a></p><p><br></p><p><strong>If you have any complaints, concerns, or want to share what you're making with CoShuffler, you can reach me via </strong><a href=\"mailto:hey@ndrewgood.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">email</a> or <a href=\"http://instagram.com/ndrewgood\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Instagram</a>. Cheers, and happy shuffling! 🥳</p>","url":"https://www.figma.com/community/plugin/974496433337884240","iconUrl":"https://www.figma.com/community/plugin/974496433337884240/icon","thumbnailUrl":"https://www.figma.com/community/plugin/974496433337884240/thumbnail"}
