{"id":"825603645067095312","name":"Text From Image","lastUpdateDate":"2020-04-17T07:21:18.652Z","publisherHandle":"mkwng","publisherImage":"https://s3-alpha.figma.com/profile/f83c8170-5438-4f70-be64-4910b4e134ab","publisherId":"306","publisherName":"Michael Wang","description":"Use OCR to copy text from an image fill.\n\nEver wish you could quickly grab some text from a static image? This plugin makes it easy with the magic of optical character recognition.\n\nKNOWN PROBLEMS\n* If you attempt to run the plugin on a static image larger than 1MB with a free API key, it will silently fail. Working on an error message right now.\n* Current workaround: resize the image to a smaller size, copy as PNG, paste it back onto the cavnas, rerun the plugin on the new, smaller image.\n* Alternatively, you can upgrade your API key to the paid tier at OCR.Space.\n\nHOW IT WORKS\n* This plugin takes advantage of the free API offered by OCR.Space (https://ocr.space). You'll need to acquire your own free API key here: https://ocr.space/OCRAPI#free\n* Copy your API key and paste it into the plugin.\n* Once your key is saved, select a layer with a static image as a fill, and run the plugin\n* After a brief delay, the text will be copied to your clipboard, ready to be pasted.\n\nLIMITATIONS\n* You can only select one layer at a time currently\n* If an image has more than one image fill, it will only work for the top one\n* As a quirk of how the plugin was made, you will briefly see a non-interactive window pop up. This allows for content to be added to your clipboard.\n* In addition, the same limitations that apply to OCR.Space's API free tier applies obviously to this plugin, such as file size limit, and rate limiting. See full info here: https://ocr.space/OCRAPI\n\nThis plugin is 100% open source. Feel free to open issues or pull requests at https://github.com/mkwng/Text-From-Image","url":"https://www.figma.com/community/plugin/825603645067095312","iconUrl":"https://www.figma.com/community/plugin/825603645067095312/icon","thumbnailUrl":"https://www.figma.com/community/plugin/825603645067095312/thumbnail"}
