{"id":"893914045094807058","name":"Multipaste","lastUpdateDate":"2021-06-23T20:15:02.110Z","publisherHandle":"marceloblaz","publisherImage":"https://s3-alpha.figma.com/profile/5a589092-2752-4a24-bf47-cc5a4c58ac5e","publisherId":"137309","publisherName":"Marcelo Brasileiro","description":"<h1>Multipaste</h1><p>🏴󠁧󠁢󠁥󠁮󠁧󠁿🇺🇸Multipaste is a Figma plugin that allows for copy and pasting elements to many frames at once. No more pasting frame-by-frame! Use this plugin to boost your workflow.</p><p>__</p><p>🇧🇷Multipaste é um plugin do Figma que permite copiar e colar elementos para vários frames de uma só vez. Chega de colar frame pro frame! Use esse plugin para acelerar seu trabalho.</p><p><br></p><p>Video demo: <a href=\"https://twitter.com/marceloblaz/status/1313321776865259520\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://twitter.com/marceloblaz/status/1313321776865259520</a></p><p><br></p><h2>Shortcut (for mac)</h2><p>A simpler way to use plugins is by creating shortcuts. To create a shortcut, click on Figma at your system's navbar, then 'Services', 'Services Preferences', 'App shortcuts' and add a new shortcut for Figma. If you wish to use Multipaste with a shortcut, here is my suggested path:</p><p><br></p><p><em>For copying</em></p><p>Menu title: Plugins-&gt;Multipaste-&gt;Copy (⌃⌘C)</p><p><br></p><p><em>For pasting</em></p><p>Menu title: Plugins-&gt;Multipaste-&gt;Paste (⌃⌘V)</p><p><br></p><p><em>If you wish, you can also create a shortcut for clearing plugin cache by following the same procedure. Just switch the command and choose a shortcut.</em></p><p><br></p><p><br></p><p><strong>What can this plugin do?</strong></p><ul><li>Copying multiple nodes, either nested in frames or in the page itself, at once and then pasting all of them into multiple frames or groups at once;</li><li>If any of the copied nodes is a component, it will create an instance of it and paste the instance, not duplicate the component;</li><li>Nodes that were copied from another frame will maintain its position in the new frame;</li><li>Nodes that weren't in a frame when copied will be placed in the center of the frames they get pasted into (same behaviour Figma already implements for copy/pasting).</li><li><strong>NEW </strong>Multiple users may use the plugin within the same file without worrying about crossing plugin data.</li></ul><p><br></p><p><br></p><p><strong>What can't this plugin do?</strong></p><ul><li>This plugin won't work properly if you delete a copied node before pasting it first. It will still work for nodes that weren't deleted though.</li><li>This plugin doesn't access your system's clipboard, so you may not use regular copy/pasting commands to make it work;</li><li>This plugin doesn't allow pasting across different files.</li></ul><p><br></p><p>Give feedback: <a href=\"https://forms.gle/azUS6mqaBypTTQG99\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://forms.gle/azUS6mqaBypTTQG99</a></p>","url":"https://www.figma.com/community/plugin/893914045094807058","iconUrl":"https://www.figma.com/community/plugin/893914045094807058/icon","thumbnailUrl":"https://www.figma.com/community/plugin/893914045094807058/thumbnail"}
