{"id":"995501500470656623","name":"Topo","lastUpdateDate":"2021-07-10T03:54:19.804Z","publisherHandle":"santiagomoreno","publisherImage":"https://s3-alpha.figma.com/profile/736d3579-c3ea-4314-9f52-ac263dde8eb5","publisherId":"570857","publisherName":"Santiago Moreno","description":"<p><strong>Review and report instances and components from Figma.</strong></p><p><br></p><p>Topo is a Figma Plugin that will allow you report and comment on specific components and post it to any Slack channel or endpoint you want.</p><p><br></p><p>You can try Topo for free for up to 3 component reports. Once you buy a license you're entitled to a lifetime license key and updates, while supporting and contributing to build better features and more plugins and tools.</p><p><br></p><p><a href=\"https://santiagomoreno.gumroad.com/l/figma-topo\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Get lifetime license</a></p><p><br></p><p>General usage:</p><ul><li>Add Topo integration for Slack</li><li>With Topo opened, select an Instance or Component you want to review or report in your Figma file.</li><li>Hit 'Report'.</li><li>Check the Slack channel and keep track of what's being reported and resolved.</li></ul><p><br></p><p><strong>Crafted for design system and library management teams</strong></p><p>Allow everyone to report component errors, bugs or issues in a single channel, integrated with the tools you use everyday. Keep track of what’s being resolved.</p><p><br></p><p><strong>No need to stop designing</strong></p><p>Stop jumping into calls and sending messages that get lost in the discussion. Report without leaving Figma.</p><p><br></p><p><strong>Connect your own endpoint for integration with other tools</strong></p><p>If you don’t want to use the default Slack app, you can send the reported data to any custom endpoint. Maybe your own API to create JIRA tickets?</p>","url":"https://www.figma.com/community/plugin/995501500470656623","iconUrl":"https://www.figma.com/community/plugin/995501500470656623/icon","thumbnailUrl":"https://www.figma.com/community/plugin/995501500470656623/thumbnail"}
