{"id":"818840482503404814","name":"Lokalise","lastUpdateDate":"2021-11-04T09:13:41.315Z","publisherHandle":"0a1c6df9_419a_4","publisherImage":"https://s3-alpha.figma.com/profile/4c5dd5e1-2a16-40e2-a2df-1f4640c4893f","publisherId":"870953351105553343","publisherName":"Lokalise","description":"<p>What is Lokalise?</p><p><br></p><p>All-in-one localization and translation management platform that allows developers, designers, translators, and product managers to work seamlessly together and deliver digital products into multiple international markets faster and in a more efficient manner.</p><p><br></p><p>How does Figma + Lokalise work?</p><p><br></p><p>Lokalise enables you to design a product or a website for a global audience right away. Use the Figma plugin to quickly include translated content in your designs without going back and forth with product managers, translators and developers.</p><p><br></p><p>This Figma plugin allows you to:</p><p><br></p><p>- Push texts from Figma to Lokalise</p><p>- Set key names (unique identifiers that are used for representing text in code and your design) or use any of the patterns for automatic naming</p><p>- Match Figma texts to existing Lokalise keys (and existing translations)</p><p>- Pull translated texts from Lokalise to Figma</p><p>- Seamlessly switch languages in Figma and check if your design works in other languages</p><p><br></p><p>Launch the plugin</p><p><br></p><p>1. Open your Figma project</p><p>2. Go to the Plugins section and choose Lokalise</p><p>3. Connect your Lokalise account</p><p>4. Allow Figma to access your Lokalise workspace.</p><p>5. Go back to Figma and select one of the existing Lokalise projects or create a new one. You can also set the default key naming pattern and the default platform for the newly created keys (this applies to the keys this Figma plugin will create in Lokalise).</p><p>6. Click Finish Setup.</p><p><br></p><p>When the setup is complete. Start using the plugin by pushing your Figma strings to the Lokalise project so translators can start working on them right away.</p><p><br></p><p>For more information (with screenshots) check out the detailed documentation page</p><p><a href=\"https://docs.lokalise.com/en/articles/3732824-figma\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://docs.lokalise.com/en/articles/3732824-figma</a></p><p><br></p><p>This plugin requires a paid Lokalise account (14-day free trial).</p>","url":"https://www.figma.com/community/plugin/818840482503404814","iconUrl":"https://www.figma.com/community/plugin/818840482503404814/icon","thumbnailUrl":"https://www.figma.com/community/plugin/818840482503404814/thumbnail"}
