{"id":"1084032849269981099","name":"Knowns and Unknowns Framework","lastUpdateDate":"2022-03-29T14:35:08.100Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1704031566/2d73b08f-aa83-465a-909e-faec3b952d6d-cover.png","description":"<p><strong>Define the level of awareness and understanding of an idea.</strong></p><p><br></p><h2>Summary</h2><p>The Knowns and Unknowns Framework helps classify concepts and open questions. The matrix consists of 4 categories: “Known Unknowns”, “Known Knowns”, “Unknown Unknowns” and “Unknown Knowns”. If a concept is in the area of “knowns”, there should already be enough research or data that can be trusted. It is an easy one to build on. For everything that does not fall into this area, however, it is called: time for validation!</p><p><br></p><h2>Step-by-step</h2><ol><li>What is the topic I want to analyze with the help of the Knowns and Unknowns Framework? Is it a product idea, a concept, or a problem that needs to be solved?</li><li>Think about whether the concept or problem that you are trying to solve is in the realm of the known or unknown.</li></ol><ul><li><strong>Known Unknowns:</strong>&nbsp;This includes any subject that you are aware exists, but don't know anything about.</li><li><strong>Known Knowns:</strong>&nbsp;Things that we both understand and are aware of.</li><li><strong>Unknown Unknowns:</strong>&nbsp;Things of which we are not aware, and of which we know nothing. This is where a team often stands at the beginning of a new project. E.g., a certain user group is restricted in their everyday life by a condition of which the team, the UX researcher, and others were not aware. To get to the bottom of the problem, more research is needed. Only then an \"unknown unknown” subject can become a \"known unknown” subject.</li><li><strong>Unknown Knowns:</strong>&nbsp;Everything that is understood, but of which one isn't aware of.</li></ul><p>3. Internalize the positioning of the upcoming tasks and make sure that they are processed according to their urgency and importance. If you want to have the to-dos in front of your eyes at all times, print out the matrix and hang it in the workspace. This way, completed tasks can be removed and new tasks can be added and arranged.</p>","url":"https://www.figma.com/community/file/1084032849269981099"}
