{"id":"961732653399887186","name":"Clean handoff","lastUpdateDate":"2021-04-11T04:34:20.474Z","publisherHandle":"Samihammami","publisherImage":"https://s3-alpha.figma.com/profile/58658fd9-d216-4857-ab79-7cc985d1ccea","publisherId":"931359986453909226","publisherName":"Samy Hammami","description":"<p><strong>Optimize your handoff design workflow with version controlling and structured Figma project using the “Clean handoff” free Figma plugin.&nbsp;</strong></p><p><br></p><p>Coordinating between the Design and Development departments while working simultaneously on Figma projects can be a hassle, for the most part, it can take a while for both teams to find an organized path to achieving the ultimate goal from my own experience.&nbsp;</p><p>So how about a new Figma plugin to ameliorate the whole Design/Implementation process?</p><p><br></p><p>The process goes as follows; Designers design mockups (high fidelity) on Figma and then hand them to the Frontend team for implementation. Here’s the pain in this process; edits can still occur from the Design team. Not often, but it can happen. It could be simply by mistake or intentional. Either way, changes have been made while the Developers are working on the same Figma page and specifically on the same Frame.&nbsp;</p><p><br></p><p>Following this encounter, my goal was to generate a sustainable and efficient solution for all who might be facing this type of problem on Figma.</p><p><br></p><p><strong>I then developed a new Figma Plugin that would help teams have:</strong></p><p><br></p><ol><li>Better structures for Figma projects</li><li>Version control system for a better trackability</li><li>Improved workflow between Developers and Designers</li></ol><p><br></p><h2><strong>Easy to use:</strong></h2><p><strong>[First feature] </strong>Generate a structured Figma project by clicking the first option.&nbsp;</p><p><strong>[Second feature] </strong>Open the handoff design modal and follow the steps:</p><ul><li>Select any frames you want for handoff designs (Default: all frames selected).</li><li>Select “Create new page” or handoff frames to an existing page.</li><li>Add a handoff design version number (Required for handoff to a new page) with the option of locking selected frames (toggle).</li><li>Add related Link e.g. asana task, Jira ticket, or Github PR link ... (Optional)</li><li>Add a short description about changes done (Optional)</li><li>Hit the “Handoff designs” button, and the plugin will take it from there 🎉✨ .</li></ul><p><br></p><p>Start improving your workflow today.</p><p><br></p><p>Contributing to the community is such an incredible feeling ♥️, I am happy to receive your feedback to improve this plugin. So&nbsp;<strong>Figmers</strong>, feel free to share your thoughts.</p>","url":"https://www.figma.com/community/plugin/961732653399887186","iconUrl":"https://www.figma.com/community/plugin/961732653399887186/icon","thumbnailUrl":"https://www.figma.com/community/plugin/961732653399887186/thumbnail"}
