{"id":"804111521375743796","name":"Figma File Template","lastUpdateDate":"2021-08-26T07:52:30.177Z","publisherHandle":"AdamPrzewoski","publisherImage":"https://s3-alpha.figma.com/profile/ae72b460-876c-4e4f-a097-a694fa27c749","publisherId":"396965","publisherName":"Adam Przewoski","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1080840389/89b1ce7e-e4e5-49f5-add7-24181e8215d5-cover.png","description":"Figma File Template is a ready-made document aiming to help you collaborate with developers, stakeholders, or other designers working on the same project. The file content is based on my own experience of working with Figma in a team.\n\nThe document contains a \"Start Here\" welcome page, which includes:\n\n1. 🎓Quick Figma Tutorial\nThe prototype included within the \"Start Here\" page is covering 6 quick tips on getting started with Figma and it's been built based on the most frequently asked questions from developers inspecting designs in Figma. Each Figma Tip is illustrated with an animated GIF so it's easier to understand and follow along.\n\n2. 📝Project Card\nThis frame can be filled with the most important information about the designs, such as the name of the designer/designers, contact information, date finished, Jira links, additional documentation/specification links, etc. Project Card has been designed using Figma's Auto-Layout so that you don't need to worry about resizing or moving elements around. The form and all of its input boxes are going to adjust themselves automatically. 🤩\n\n3. 📢Project Feedback Form\nThis frame lets you gather the overall feedback from other designers, developers, QAs, stakeholders and others assigned to the project. Using Figma's comments, all you need to do is leave a comment in one of the two corresponding boxes — \"Went well\" or \"To improve\".\n\n4. 🖼Project Figma Thumbnail (Designer Only)\nThe last frame lets you customize the thumbnail of your file. The frame placed inside has already been set as a Thumbnail so that every change you're going to make inside is going to be reflected in the list of your files.\n\n---\n\nThis is the very first version of Figma File Template and I can't wait to hear your thoughts, suggestions, and ideas on what else is there that can be improved. Let me know if you think there's something else worth including!\n\nFind me at Twitter — @adamprzewoski","url":"https://www.figma.com/community/file/804111521375743796"}
