{"id":"1023544779842748848","name":"Propose Design Solutions in small team","lastUpdateDate":"2021-09-25T10:41:32.173Z","publisherHandle":"UXchange","publisherImage":"https://s3-alpha.figma.com/profile/1a2a01cb-ea40-44f4-9dd8-4d47a7dd63f6","publisherId":"115088","publisherName":"UX Change","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1156848337/cbdfa7bf-15de-4487-ae60-c01333c674b0-cover.png","description":"<p>Work as a Designer in a small startup? early-stage startup? and you are a sole designer? It's not easy I know, to propose your design. There is no particular framework or ideal design process, or peer support from other designers (because you're the only one let say). Even small startups often have a messy agile environment with uncertain sprint weeks. That makes us even harder to propose our design, unlike in large tech, where designers have a place, a team, and a certain time to show our design solution, even budget!</p><p><br></p><p>But here I'll try to help you, including an early-career designer to propose your design in a small startup, where people are busy with the product and timeline rather than to realize where and when we can put the design part on our product sprint.</p><p><br></p><p>This is based on my experience working both in small and large tech are huge differences. People just write articles about what are the differences between junior and senior designers, and it can be true (mostly are accurate, tough) but we are all -despite junior or senior- facing different problems with different company sizes.</p><p><br></p><p>Company size can affect the culture, design maturity levels, how to solve any problem included design, how to treat design and designers, etc. So hopefully, this can help you and your team to propose your design. This is not presentation content. Although you may present this to your team, but my intention here is so your team can read or see your solution in detail until -hopefully- they can reflect on our solution. So keep it simple and keep it short.</p><p><br></p><p>By. Windyasari Septriani</p><p><a href=\"https://www.linkedin.com/in/windyasari/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Linkedin</a></p><p><a href=\"https://dribbble.com/windyvintage\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Dribbble</a></p><p><a href=\"https://www.instagram.com/tanyajawab_ux/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Instagram</a></p>","url":"https://www.figma.com/community/file/1023544779842748848"}
