{"id":"923456175939828427","name":"Tooltip with Border + Magic Tail","lastUpdateDate":"2020-12-23T06:13:55.122Z","publisherHandle":"k_mao","publisherImage":"https://s3-alpha.figma.com/profile/2487b231-f157-4226-8768-cde714486611","publisherId":"6855","publisherName":"Kevin Mao","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/601638208/8df1e8d2-3bec-4d55-b67a-e6d299b98f47-cover.png","description":"<h1><strong>Features</strong></h1><ul><li>Auto Layout that works with a border around the whole tooltip</li><li>Dark mode, rounded, &amp; angular Variants</li><li>12 preset tail positions</li><li>Tail position freely adjustable to any pixel position (inspired by Chudo Loo’s <a href=\"https://www.figma.com/community/file/832936778494194740/Resizable-Auto-Layout-Spacer\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Resizable Auto Layout Spacer</a>)</li></ul><p><br></p><p>Tooltips with tails, borders, and Auto Layout are not straightforward to create, because you can’t put a single continuous stroke around multiple non-rectangular layers nested in Auto Layout. Simpler hacks are not possible because Auto Layout forces a layer z-index order. So I made this.</p><p><br></p><h1><strong>Usage tips</strong></h1><p>To adjust the position of the Tail, adjust the padding of the Tail Position layer. For up and down-pointing tooltips, adjust left/right padding. For left and right-pointing tooltips, adjust top/bottom padding.</p><p><br></p><p>You can play with the width of Tail Anchor to adjust the Tail’s minimum distance from the corners.</p><p><br></p><p>To edit the main frame’s padding of all the Variants at the same time, select the top-level component frame and press Return.</p><p><br></p><h2><strong>How this tooltip is built</strong></h2><ol><li>The Tail is 2 vector shapes so that it can have a fill and part of a border.</li><li>The Tail is offset to be outside a Tail Anchor to make it look like it’s part of the main frame.</li><li>Using a 0.01px layer size hack enables Tail Anchor to take up 0px of space.</li><li>Tail Anchor is nested in Tail Position, which has Auto Layout applied so that its padding controls Tail Anchor’s position.</li><li>Tail Position is nested in the main frame, ensuring that it’s always on top of the main frame’s stroke.</li><li>The main frame has Auto Layout applied to ensure the text controls the tooltip size.</li></ol>","url":"https://www.figma.com/community/file/923456175939828427"}
