{"id":"1061266188986408584","name":"Etech - Teacher Dashboard Design Template","lastUpdateDate":"2022-01-07T12:52:56.946Z","publisherHandle":"Madbrains","publisherImage":"https://s3-alpha.figma.com/profile/26d742f4-0e24-4b03-af78-873a7e00fd3c","publisherId":"2216963","publisherName":"Mad Brains","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1437223273/0b23686b-7ad8-4330-a807-744e1256782e-cover.png","description":"<p>It’s not easy to track all the activities that happen on your e-learning sites and it is complex to understand all the data available. The dashboard is the admin panel and is the perfect solution to save you up from these situations.</p><p><br></p><p>Skilify dashboard is a unique dashboard template designed keeping in mind the latest trends and with an aim to simplify it for teachers to understands how their courses are performing and understand all the data in an effective way using the interactive dashboards.</p><p><br></p><p>This dashboard is designed based on extensive UX Research in order to provide the best experience for teachers that helps them to boosts the conversions and increase the course completion rate as well as make necessary improvements.</p><p><br></p><p>This App is the best fit for anyone that has their own online learning platform or planning to launch the same.</p><p><br></p><p>This e-learning site dashboard design features a unique design. The Application is designed in the adobe Xd software and is prototype ready so you can feel the website even before getting it developed and provide you with all you will need in order to get your e-learning website dashboard built.</p><p><br></p><p>We also provide additional support for various other software such as Figma, photoshop, sketch and will also help you to customize the whole design as per your needs with some extra charges. You can buy from <a href=\"https://ui8.net/the-madbrains/products/etech---teacher-dashboard-design-template?status=6\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">here</a> </p>","url":"https://www.figma.com/community/file/1061266188986408584"}
