{"id":"968845058432754722","name":"Component architecture guidance quiz","lastUpdateDate":"2021-04-27T12:13:23.747Z","publisherHandle":"alicepackard","publisherImage":"https://s3-alpha.figma.com/profile/d71ca245-392c-49e6-92a4-54c49714a7e3","publisherId":"106052","publisherName":"Alice Packard","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/814920310/43e72386-2c41-4c1d-bc45-cd9b29312a51-cover.png","description":"<p>Sometimes when you’re making a component that uses many nested instances within it <em>and</em> you know it will have many variables (into the thousands), it becomes daunting to think about the possibility of getting something wrong. You don’t want to put in all the work of creating hundreds and hundreds of variants only to realize you’ve forgotten something, or should’ve approached one piece of the component differently, such as componentizing text alignment in your buttons.</p><p><br></p><p>On the flip side, there’s also concern about over-engineering what ought to be a simple object. We know that the more layers you have in a file, the more memory it consumes, and that can lead to sub-par file performance. Plus, when it comes to things like text alignment, color, corner radius, and auto-layout resizing rules, those things can still be manipulated as overrides within component instances... do the benefits of controlling those things as variants outweigh the cost of all the layers that need to be created to support them? There is a tension between building components that are robust <em>and</em> layer-efficient.</p><p><br></p><p>But are there clear circumstances when it’s <em>better</em> to create variants which adjust characteristics that can be handled by overrides? Or times when it’s more appropriate to have fewer variants and encourage component users to use overrides to adjust things?</p><p><br></p><p>Because of the number of tradeoffs at play with any decision here, I decided to make an interactive quiz built in Figma to help folks decide how to approach the architecture of their components. While you could use this quiz with your entire component library in mind, I'd also recommend narrowing your view to a single component or closely related group of components (such as form elements). You may find mixed-methods approach may serve your component library well!</p>","url":"https://www.figma.com/community/file/968845058432754722"}
