{"id":"1006862490310794670","name":"Biggest Design UI Kit & Design System by Apsolior","lastUpdateDate":"2021-08-10T09:52:04.444Z","publisherHandle":"ljubisakukulj","publisherImage":"https://s3-alpha.figma.com/profile/13218888-16f8-4a6b-bfbf-1a6f91c7cd5d","publisherId":"973900878829685584","publisherName":"Ljubiša Kukulj","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1041020819/2315cc5f-b13f-4d75-9372-2cd91195fc40-cover.png","description":"<p>*** About the project ***</p><p><br></p><p>Ultimate Design UI Kit &amp; Design System is created to make the design process easier for both designers &amp; developers. At this project, I focused on all the elements you can use for your websites, online products, smartphone apps, console apps, or any other digital product.</p><p><br></p><p>*** What is included ***</p><p><br></p><p>This is a kit created by atom methodology so it basically contains everything you need for a successful start of any project as a UX/UI Designer, Product Designer, or even a Front-End Developer. A quick list of things included inside can be seen here:</p><p>- Full typography set of 10 most used fonts (Roboto, Inter, Nunito Sans, Montserrat, Open Sans, Lora, Prata, Lato, Oswald, and Poppins) with all sizes + CSS parts of code for import.</p><p>- Full-color set backed up by Tailwind CSS.</p><p>- Complete set of avatars, badges, banners, buttons, cards, checkboxes, radio buttons, toggle buttons, input fields, tooltips, and table elements with all sizes, states, and color combinations.</p><p><br></p><p>*** Future plan ***</p><p>The development of this design system and UI kit is not done yet, but I wanted people to start using it and connect with the logic behind it. In the next 2.0 version my plan is to add these things:</p><p>- Make a full typography set of all 10 most used fonts with all sizes, states, and color combinations + rules (Weights, distances, paragraph chunks, and more...).</p><p>- Complete set of layouts (grids, breakpoints, spacings).</p><p>- Complete set of essential iconography in two styles, solid and outlined.</p><p>- Few more versions of avatars, badges, banners, buttons, cards, checkboxes, radio buttons, toggle buttons, input fields, tooltips, and table elements with all sizes, states, and color combinations.</p><p>- Add new elements: carousels, dropdowns, lists, indicators, modals, and tabs with all sizes, states, and color combinations.</p><p>- Over 500 ready-to-go UI elements suitable for pages such as our team, services, product, contact, upload, landing pages, footers, headers, and more...</p><p><br></p><p>*** How to use ***</p><p><br></p><p>All the elements I did are ready to be implemented in your design system or design kit. Just delete the additional pages you do not need, set up the team library assets and you are good to go.</p><p><br></p><p>*** How to download ***</p><p><br></p><p>Dribbble Account:&nbsp;https://dribbble.com/ljkukulj</p><p>Figma Community:&nbsp;https://www.figma.com/@ljubisakukulj</p><p>Website (Soon - In V2.0)</p><p><br></p><p>*** Copyright licence ***</p><p><br></p><p>You can use a “Biggest Design UI Kit &amp; Design System by Apsolior” for any personal or business project. If you however decide that it is a good idea to sell my product online without me knowing it think again :). You can customize the template to any degree (adding, altering, or removing text, images, graphics, layout, design, etc.) to fit your project's needs.</p><p><br></p><p>*** Important notice ***</p><p><br></p><p>“Biggest Design UI Kit &amp; Design System by Apsolior” is in beta release, and it is going to be free until the 1st of December, 2021. After that date, the full &amp; completed version will be released and the price of the template is going to be 19$ per license.</p>","url":"https://www.figma.com/community/file/1006862490310794670"}
