{"id":"1049710666643539175","name":"locize","lastUpdateDate":"2021-12-06T18:40:03.920Z","publisherHandle":"locize","publisherImage":"https://www.gravatar.com/avatar/9886f9711fd3d3220fe71955930502a9?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_l_v2.png","publisherId":"1049708892918874855","publisherName":"locize","description":"<p><strong>What is locize?</strong></p><p><strong>﻿</strong></p><p>locize is a new online service that offers true continuous localization. The translations are managed in your locize project and published from there to the locize CDN to be consumed from your application. The localization team can take care of the translations from the first day and keep up with changes with ease. The processes are separated. Translations can be updated without the need to release an update of your app. locize is bridging the gap between translation and development!</p><p><br></p><p><strong>Best for</strong></p><p><br></p><p><em>All involved in the software localization process: Developers, Designers, Team Leads, Heads of Engineering, Translation/Localization team, Product Managers, Project Leaders, Marketing, etc...</em></p><p>&nbsp;</p><p>For more information please visit: <a href=\"https://locize.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://locize.com</a></p><p>&nbsp;</p><p><strong>Why connect locize and Figma?</strong></p><p>&nbsp;</p><p>Bridging the gap between translation and design with locize, a modern and affordable localization-management-platform. It makes your website, app, game or whatever your project is, global, vibrant, and more engaging especially when unleashing the continuous localization capabilities.</p><p><br></p><p>Pushing texts from Figma to locize. Send first text content from within Figma to locize in seconds so that your Translators can start their work right away.</p><p>&nbsp;</p><p>Try your designs in a different language by fetching other translations directly into Figma. Preview your designs in all your languages before handoff to Developers.</p><p>&nbsp;</p><p>Increase your overall translation quality and reduce feedback loops.</p><p><br></p><p><strong>How to set up</strong></p><p>For more information and to learn how to install the plugin visit <a href=\"https://docs.locize.com/more/figma-plugin\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://docs.locize.com/more/figma-plugin</a></p><p>Don’t have a locize account? Try it for free! <a href=\"https://www.locize.app/register\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://www.locize.app/register</a></p>","url":"https://www.figma.com/community/plugin/1049710666643539175","iconUrl":"https://www.figma.com/community/plugin/1049710666643539175/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1049710666643539175/thumbnail"}
