{"id":"837733390949354788","name":"Label Maker","lastUpdateDate":"2020-05-11T09:27:22.906Z","publisherHandle":"gusso","publisherImage":"https://s3-alpha.figma.com/profile/b0bd1742-6627-4396-9009-5e038f1b1f2e","publisherId":"138","publisherName":"Henrique Gusso","description":"Create labels permanently linked with your layers' names. Push updates from either direction, and never again copy and paste names manually to identify things on your canvas.\n\n⠀\nHow to use\n—————\n⒈ Select one or multiple layers\n⒉ Go to the plugin menu and select Label Maker ▸ From Layer Name\n\nThat's it! One label for each selected layer is now created. The menu commands are used for both creating and updating labels, and layers can only have one label in the document at a time. \n\n⠀\nWhat you can do\n——————––––\n• Push and pull the latest names using sidebar shortcuts or the Figma menu\n• Find the layer linked to the current selection, even across different pages\n• Click on any label and restore its master component to edit label styles across your file\n• Leverage Figma's quick switch between text objects to rename several labels in a row, then propagate all changes to the layers' names\n\n⠀\nFAQ\n——\n• I don't see sidebar shortcuts on my layer!\nThat could be either because you didn't run the plugin from the menu on that layer at least once, or because you're using an instance of a component. Figma doesn't support registering sidebar shortcuts in instances yet, but the plugin still works from the menu.\n\n• Can I run it via a keyboard shortcut?\nFor many workflows, relying on Figma's native ⌘＋⌥＋P (Run Last Plugin) should speed things up enough. The plugin's commands don't distinguish between creation and update exactly so that the only shortcut we have is as smart as it can be. If you still want to register them permanently on your Mac, you can create custom shortcuts in macOS: https://support.apple.com/en-gb/guide/mac-help/mchlp2271/mac","url":"https://www.figma.com/community/plugin/837733390949354788","iconUrl":"https://www.figma.com/community/plugin/837733390949354788/icon","thumbnailUrl":"https://www.figma.com/community/plugin/837733390949354788/thumbnail"}
