{"id":"734548932196004433","name":"Paddet","lastUpdateDate":"2019-08-24T10:08:58.118Z","publisherHandle":"liam","publisherImage":"https://s3-alpha.figma.com/profile/b86d0720-9e9d-4575-b11e-920166073176","publisherId":"74154","publisherName":"Liam Martens","description":"Paddet is a small tool that will help you automatically apply padding to frames. A few options will also be available to you to optimize how Paddet updates your paddings. The last used settings are saved for each frame so you can easily let paddy automagically update your paddings on the fly without having to check your settings again.\n\nFAQ\n* Can I use it on component instances?\nYes you can! Do keep in mind it will firstly apply the padding to your master component and update the selected instances afterwards. Another important note to mention is that whenever your master component updates all your instances will be affected as well, however paddy will not automatically update your instances for their respective content. If this is something you want you need to use the :paddet-autoupdate flag on the instance name\n\n* What does the :paddet-autoupdate flag do in the name of an instance?\nIf a component instance has this flag in it's name Paddet wil update the instance for it's content whenever Paddet is used on the master component.\n\n* What does using :paddet-ignore in my layer name do?\nThis flag will ensure Paddet does not take into account that layer when it is calculating the width and height of the current content. This is especially useful when you have a seperate layer for your background as you do not want this layer to be taken into account as actual content.\n\n* What does using :paddet-resize in my layer name do?\nUsing the resize flag will tell Paddet to resize it along with your frame.  As with the ignore flag, this is useful when you have a background layer.\n\n* Can I combine the ignore and resize flags?\nYes you can.\n\n* Will Paddet remember my settings?\nYes, whenever you update a frame with Paddet it will save your last used settings for that specific frame. This way you can use the \"Auto update padding\" option to easily re-update your paddings without having to open the complete plugin.","url":"https://www.figma.com/community/plugin/734548932196004433","iconUrl":"https://www.figma.com/community/plugin/734548932196004433/icon","thumbnailUrl":"https://www.figma.com/community/plugin/734548932196004433/thumbnail"}
