{"id":"1085487165591767870","name":"Spades online","lastUpdateDate":"2022-03-15T08:58:27.748Z","publisherHandle":"spadesonline","publisherImage":"https://www.gravatar.com/avatar/e32802649c920bf3c46de65abc96fdb8?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_d_v2.png","publisherId":"1085485731107520903","publisherName":"Dimitry","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1652631821/849cde24-1d48-4e93-9030-1dc7c90927be-cover.png","description":"<p>Spades is a trick-taking card game devised in the United States in the 1930s. It can be played as either a partnership or solo/\"cutthroat\" game. The object is to take the number of tricks (also known as \"books\") that were bid before play of the hand began. Spades is a descendant of the Whist family of card games, which also includes Bridge, Hearts, and Oh Hell. Its major difference as compared to other Whist variants is that, instead of trump being decided by the highest bidder or at random, the Spade suit always trumps, hence the name.</p><p><a href=\"https://spadesonline.io/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Spades online</a> is a free card game that you can play with friends. No download is required.</p><p>Spades necessitates just the right number of brain cells.</p><p>Whist-type card games, such as Spades and Hearts, are wistful in nature, as the name implies and is the etymological root. There is plenty of strategy to be had in bidding and bags, but the gameplay itself flows quite nicely, unlike stutter-start games like Poker or mental drudgery like Solitaire and Shanghai. You can also play free Spades games to get started before worrying about whether you need to start thinking about your bets more carefully.</p><p>Whist-type games keep cards being played until the deck is depleted, which is why many people find playing Spades online to be a breath of fresh air, whereas other competitive card games are far more stressful.</p><p><br></p>","url":"https://www.figma.com/community/file/1085487165591767870"}
