{"id":"970224423155271169","name":"UX Heuristic Evaluation Template","lastUpdateDate":"2021-05-02T05:06:45.637Z","publisherHandle":"nige","publisherImage":"https://s3-alpha.figma.com/profile/2d509ddb-0351-46da-8521-7143aa95b20b","publisherId":"1662142","publisherName":"Nigel","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/824481938/f70a385f-2cd3-4ac0-8d11-1d301f85c946-cover.png","description":"<h1>UX Heuristic Evaluation Template</h1><h2>With auto-layout, components and variants.</h2><p><a href=\"https://www.nngroup.com/topic/heuristic-evaluation/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Heuristic evaluation</a>&nbsp;(Nielsen and Molich, 1990; Nielsen 1994) is a <a href=\"http://www.nngroup.com/books/usability-engineering/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> usability engineering</a> method for finding the usability problems in a user interface design so that they can be attended to as part of an iterative design process. Heuristic evaluation involves having a small set of evaluators examine the interface and judge its compliance with recognized usability principles (the \"heuristics\").</p><p><br></p><p>Once you understand these 10 important usability heuristics, you can use them to help you find flaws in your website or product's interface. This template helps you record and communicate those findings.</p><p><br></p><p>Learn more about the 10 usability heuristics at the <a href=\"https://www.nngroup.com/articles/ten-usability-heuristics/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Nielsen Norman Group website</a>.</p><p><br></p><h2>Add your info, change components and variants to suit, and you're done!</h2><p>This template makes powerful use of auto-layout, as well as components and variants - to make it easy to create a beautifully presented heuristic evaluation report.</p><p><br></p><p>All you need to do is add the findings from your evaluation, and edit the various components with variants to suit your needs.</p><p><br></p><h2>Feedback and suggestions welcome</h2><p>You are welcome to share, modify and remix this template however you wish. Do make sure you're familiar with the creative commons license around proper attribution and additional restrictions though!</p><p><br></p><p>I'd also love to know how else this template might be used and how it could be improved so more people can make use of it. This wouldn't be a true UX project without encouraging feedback and suggestions! So, if you're having trouble with the template, or if you've got suggestions for anything to add or change, let me know in the comments and I'll take it on board to keep improving this template.</p><p><br></p><p>If you <em>really </em>like my work, you could <a href=\"http://buymeacoff.ee/nige\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">buy me a coffee</a>.</p><p><br></p><p><strong>This is a remix</strong></p><p>This template is a remix of the wonderful <a href=\"https://www.figma.com/@kapil?fuid=718734308755829471\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Heuristic Evaluation Template</a> by <a href=\"https://www.figma.com/@kapil?fuid=718734308755829471\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">kapil</a>. I've just changed and added a few more things (like auto layout, images, and individual rows for multiple issues) that I found to be very useful in my work. Thank you Kapil for the amazing inspiration and starting point.</p>","url":"https://www.figma.com/community/file/970224423155271169"}
