{"id":"1059529402849710140","name":"The DAO Planning Canvas","lastUpdateDate":"2022-01-02T17:51:34.849Z","publisherHandle":"aaronbatcheldr","publisherImage":"https://s3-alpha.figma.com/profile/1c32d52d-34f9-4b6e-94f5-3a159e009441","publisherId":"3535156","publisherName":"Aaron Batchelder","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1424051200/0e008b82-d0dc-40cf-9593-cb9f76dce9b1-cover.png","description":"<p>The \"Decentralized Autonomous Organization\" (DAO) Planning Canvas (DPC). Inspired by the Business Model Canvas, and Lean Canvas, the DPC is a framework for methodically planning the various unique aspects of starting a DAO.</p><p><br></p><p>Where the Business Model Canvas and Lean Canvas often have 9 sections, the DAO Planning Canvas has 12. A few sections that lacked relevancy were removed, some section names were tweaked (e.g., Channels -→ Building Hype), and new DAO-specific sections were added; <em>Mission, Community, Community Experience, Treasury, Governance, Organizational Structure, and Content Management.</em></p><p><br></p><p>Here’s a closer look at the full list of sections with a tl;dr for the high-level intention of each.</p><p><br></p><ol><li><strong>Mission</strong>: Why does this DAO exist?</li><li><strong>Unique Niche</strong>: How is it different from other similar DAO communities?</li><li><strong>Key Metrics</strong>: How will you know if the DAO is succeeding?</li><li><strong>Community Planning</strong>: What type of community are you building?</li><li><strong>Community Experience</strong>: What are the values and the CX of the community?</li><li><strong>Treasury</strong>: How will you finance and collectively manage the DAO’s war chest?</li><li><strong>Revenue Streams</strong>: How will you maintain financial health over time?</li><li><strong>Governance</strong>: How will the community gather consensus?</li><li><strong>Organizational Structure</strong>: Will it be fully decentralized or have some hierarchy?</li><li><strong>Building Hype</strong>: How will you find and connect with the right community members?</li><li><strong>Operational Costs</strong>: What’s the expected run rate to sustain operations?</li><li><strong>Content Management</strong>: Where will you house content for the community?</li></ol><p><br></p><p>Each section of the DPC has a unique purpose. But not every section will be applicable to every DAO. For example, a collectible-based DAO (think NFT) may care less about recurring revenue, whereas an education DAO may find that to be an important priority. Or, a DAO with a flat, fully decentralized organizational structure may omit certain prompts around DAO leadership/compensation tools, whereas another may have a dedicated leadership team in place.</p><p><br></p><p>In the community-centric spirit of web3, I’ve published the DPC as a free and remix-friendly community project here on Figma. Please feel free to duplicate it and make it your own!</p><p><br></p><p>If you do remix it, consider sharing it on Twitter and tagging me at <a href=\"https://twitter.com/AaronBatcheldr\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">@aaronbatcheldr</a>! I’d love to see how it evolves.</p><p><br></p><p><br></p>","url":"https://www.figma.com/community/file/1059529402849710140"}
