{"id":"1010600568078816938","name":"Breeze Booth: Template + How-To","lastUpdateDate":"2021-08-20T17:28:57.604Z","publisherHandle":"danh","publisherImage":"https://s3-alpha.figma.com/profile/e0aee9c5-a9d8-4fe5-8c99-669dda822ddd","publisherId":"950895","publisherName":"Dan Humphreys","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1068488018/0f7103e7-613d-49ba-9d20-99a1f631c917-cover.png","description":"<p>We've seen some templates that aren't.. as creative as they could be! So we made this - the definitive guide (definitely not the definitive guide) to how to make a great setup for your Breeze Booth - whether that's an Everybooth or not.</p><p><br></p><p>Transcript of contents:</p><pre class=\"ql-syntax\" spellcheck=\"false\">If you’ve never used Figma before and don’t want to dive straight in, here’s some short guides:\nhttps://www.youtube.com/watch?v=jk1T0CdLxwU\nhttps://help.figma.com/hc/en-us/categories/360002051613-Getting-Started\nhttps://uxplanet.org/figma-all-you-need-to-know-156b52b88e54\nhttps://trydesignlab.com/figma-101-course/introduction-to-figma/\n\nEdit the ‘MAIN’ frame (above)\nThis is the background of all the screens - it’ll automatically change them.\n\nSelect all (CTRL/CMD + A) and change the colours on the right. \nA few colours are used for everything - the buttons, the Kiosk icons, etc.\nYou can find the colours under ‘Selection Colors’ in the pane on the right.\n\nTo change the font, click on a text on a screen (for example, ‘Email Successful!’ on email_success and go to Edit - Select Same Font.\nThis selects all the same font and you can change them in the Text panel. You can change text colour while you’re here too.\nFigma automatically includes all Google Fonts. If you want to use a font that isn’t from Google Fonts: https://go.pixelflow.xyz/figmafonts\n\nThe ‘overlay’ frame is the photo layout\nYou can edit that however you want! Apply it in Breeze as an overlay.\nIf you want to learn what all of the rest of the screens mean (advanced mode!), they’re in the Breeze DSLR Remote Pro documentation (page 108!).\n\nExport!\nSelect all again (CTRL/CMD + A) and find ‘Export’ in the right pane. Press ‘ADD’ and make sure one says JPG and one says PNG. \nMake sure ‘Suffix’ is empty, and that they both say ‘1x’. It’s easier than just exporting the specific PNGs and specific JPGs.\nThis will also export this ‘How to use’ frame - you can press Shift and click on this frame while everything is selected to ignore it.\n\nCopy into your Breeze configuration\nDo this how you would any other set of screens. If you want to use the Kiosk icons, that’s covered in the Kiosk manual (page 23!).\n\nProfit!\n</pre><p><br></p>","url":"https://www.figma.com/community/file/1010600568078816938"}
