{"id":"1084045144455926718","name":"Wow-How-Now Matrix","lastUpdateDate":"2022-03-11T09:28:23.196Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1641147797/57819db8-4b28-4322-9d5a-d9eb4b2b18da-cover.png","description":"<p>Evaluate originality and feasibility of ideas.</p><p><br></p><h2>Summary</h2><p>With the help of the Wow-How-Now matrix, ideas can be evaluated at an early stage. Rank the ideas on the chart in the areas of innovation and feasibility/implementation to decide which ideas deserve to move to the next stage of the process and which ideas have no future.</p><p><br></p><h2>Step-by-step</h2><ol><li>Every good workshop starts with planning. To quickly evaluate ideas, you will need the Wow-How-Now worksheet or a flipchart/whiteboard, or software that digitally provides the worksheet. Then schedule a meeting.</li><li>Have all the ideas ready and arrange them one by one on the matrix. How innovative is the idea? How easy is it to implement? Discuss!</li></ol><ul><li><strong>WOW:</strong>&nbsp;Ideas that are particularly innovative and at the same time easy to implement. They mean low risk and high chances of success.?</li><li><strong>HOW:</strong>&nbsp;This is also a particularly innovative idea. But at the same time, it is also classified as rather difficult to implement. It can mean high costs and a lot of work and is therefore comparatively risky.</li><li><strong>NOW:</strong>&nbsp;All ideas and concepts that fall under the “Now” section are not particularly innovative, but a good start to quickly implement the first version of an idea. They represent a minimal viable product.</li><li><strong>CIAO:</strong>&nbsp;These ideas and concepts can be banished immediately, as they are neither innovative nor easy to implement. The chances of success are low, the cost and time factor high.</li></ul><p>3. Say goodbye to ideas that are neither innovative nor easy to implement. This creates more time to focus on ideas that offer more potential.</p>","url":"https://www.figma.com/community/file/1084045144455926718"}
