{"id":"1105303539734444295","name":"party invite","lastUpdateDate":"2022-05-09T01:21:39.554Z","publisherHandle":"brotherdorkins","publisherImage":"https://www.gravatar.com/avatar/cd78574df157aa1ee0f80c481e5dd96d?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_j_v2.png","publisherId":"974417238005455792","publisherName":"Justin","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1845809380/689f27a8-61a0-4265-916e-da6f86608e70-cover.png","description":"<p>https://www.youtube.com/watch?v=9jlaZL7CWHY</p><p><br></p><p>0:00</p><p>Guys, I don't know if I'm feeling this flyer idea.</p><p>0:03</p><p>Really? It's perfect, dude.</p><p>0:04</p><p>How else are three guys in their late 20s supposed to make friends?</p><p>0:06</p><p>There's no system in place. A flyer does all the work. It does the work for us, man.</p><p>0:09</p><p>All right, read back what we got so far because I don't... Okay.</p><p>0:12</p><p>\"What up? We're three cool guys looking for other cool guys...</p><p>0:15</p><p>who wanna hang out in our party mansion. \"</p><p>0:17</p><p>It sounds a little gay.</p><p>0:19</p><p>Yeah. It does sound gay. Right?</p><p>0:20</p><p>You know what? Write, um, \"nothing sexual. \" Good. Okay.</p><p>0:23</p><p>\"We're three cool guys looking for other cool guys who wanna hang out in our party mansion.\"</p><p>0:27</p><p>\"Nothing sexual.\"</p><p>0:29</p><p>Good, good. And add, \"Fighters welcome.\"</p><p>0:30</p><p>'Cause, you know, we want some tough dudes and some big dudes.</p><p>0:33</p><p>I don't want a bunch of tough guys in here wanting to fight me.</p><p>0:35</p><p>No, I didn't mean that. But it would be good to have extra protection.</p><p>0:37</p><p>Yeah. Extra protection and... All right.</p><p>0:39</p><p>Well, uh, put \"fitness encouraged.\"</p><p>0:41</p><p>Beautiful. That sounds confusing.</p><p>0:43</p><p>Do you think so? I'll put, \"Dudes in good shape.\"</p><p>0:44</p><p>Oh, there you go! That solves it. Nice.</p><p>0:46</p><p>I like dudes in good shape. There we go.</p><p>0:47</p><p>Okay. But we also need a guy who's funny and fat. We need a funny fat guy.</p><p>0:50</p><p>We need a funny fat guy. Because every crew has a funny fat guy.</p><p>0:52</p><p>Well, no. I'm the funny fat guy. So don't worry about that.</p><p>0:54</p><p>You're not fat, dude. Yeah. You're also not funny.</p><p>0:56</p><p>I want somebody who does observational humor.</p><p>0:58</p><p>Oh, you know what? That would be good. Observational humor is cool.</p><p>1:01</p><p>You know what, guys? I'm just gonna put \"nothing sexual\" again just to reiterate.</p><p>1:04</p><p>Underline that. Please, please.</p><p>1:05</p><p>Okay, clarity. Smart. Be very clear with that.</p><p>1:06</p><p>And I'm thinking that the flyer should be in the shape of a beer mug.</p><p>1:10</p><p>Hmm... Too complicated. Yeah. Uh...</p><p>1:12</p><p>What about a... bicep?</p><p>1:13</p><p>Bicep. Yeah! A bicep. Bicep's good.</p><p>1:15</p><p>A bicep would really do it. All right, let's go with a bicep.</p><p>1:17</p><p>K, read, read. Okay. Yeah, what do we got? Here we go.</p><p>1:18</p><p>\"What up? We're three cool guys looking for other cool guys...</p><p>1:21</p><p>\"who wanna hang out in our party mansion.</p><p>1:23</p><p>\"Nothing sexual. Dudes in good shape encouraged.</p><p>1:26</p><p>\"If you're fat, you should be able to find humor in the little things.</p><p>1:30</p><p>Again, nothing sexual.\" Underlined. Underlined. Okay.</p><p>1:33</p><p>Great. I have no problem with that.</p><p>1:35</p><p>No. Let's go meet some men.</p><p>1:43</p><p>Lookin' good, bro. Lookin' very good.</p><p>1:46</p><p>I'm sorry? Oh, your pants. Nice cut.</p><p>1:49</p><p>You know, that vertical line on the side gives your body good length.</p><p>1:53</p><p>Do you work here? What... Nah.</p><p>1:56</p><p>I'm just looking to meet some... some new guys.</p><p>1:58</p><p>I saw you from across the way. And I thought, yeah.</p><p>2:00</p><p>This guy's got a good sense of style. He's about the same age.</p><p>2:03</p><p>Got a nice crop of blond hair. We could definitely use a blond in the crew.</p><p>2:06</p><p>Mix things up a little bit. Here. Why don't you just, uh...</p><p>2:09</p><p>take a look at that flyer there.</p><p>2:11</p><p>Is this a penis?</p><p>2:13</p><p>A... penis? No. It's a...</p><p>2:15</p><p>It's a bicep. Oh.</p><p>2:19</p><p>Yeah, yeah. Oh, right. \"Party mansion.\"</p><p>2:22</p><p>Exactly. Yeah. Cool. Yeah, I'll swing by.</p><p>2:25</p><p>You'll swing by? Yeah, sure.</p><p>2:27</p><p>Okay, yeah. Just come by the address. We'll be there partying.</p><p>2:29</p><p>Sure. Yeah, at the party mansion. You're gonna be perfect, man.</p><p>2:32</p><p>Yeah. Nice.</p><p>2:33</p><p>See ya there.</p><p>2:34</p><p>Oh, I should give him more for his friends.</p><p>2:36</p><p>Yeah.</p><p>2:38</p><p>Oh, son of a bitch!</p><p>2:41</p><p>Penis? No. It's a... a bicep. Bro.</p><p>2:44</p><p>I just had the most perfect blond guy slip right through my fingers.</p><p>2:48</p><p>I mean, I had him in the palm of my hand, and then he was gone.</p><p>2:51</p><p>You know what I mean? I mean, this guy would've been perfect for you.</p><p>2:54</p><p>What's up with this beefcake? Is he coming to the party or what?</p><p>2:56</p><p>Big time. Great.</p><p>2:58</p><p>Nah, he didn't read the flyer. No, I read the flyer.</p><p>3:00</p><p>He didn't understand it. I understood it... perfectly.</p><p>3:03</p><p>Oh! Okay.</p><p>3:05</p><p>Okay, we need to take a second look at this flyer. Uh, yeah, dude.</p><p>3:08</p><p>Guys! Check out who I just met buying a crossbow.</p><p>3:11</p><p>This dude is the shit. I shall use this crossbow to pierce my broken heart.</p><p>3:16</p><p>Yeah.</p><p>3:18</p><p>All right, dude.</p><p>3:23</p><p>Dude, isn't that guy awesome or what? He's like a poet.</p><p>3:25</p><p>That guy's not awesome. No.</p><p>3:27</p><p>Dude, do you know how hard it is to find...</p><p>3:29</p><p>a passionate guy like that these days... they don't make 'em anymore.</p><p>3:32</p><p>You should've seen how passionate he got when I showed him the dick flyer.</p><p>3:35</p><p>You knew? You knew that it was a dick?</p><p>3:37</p><p>Well, yeah. I thought we changed it. I thought you guys were changing it.</p><p>3:40</p><p>It was always... it was always meant to be a bicep. It was a bicep, bro.</p><p>3:42</p><p>Well, then why did you cut it like... 'Cause it looks totally like a dick.</p><p>3:45</p><p>I thought, all right, let's go with the dick thing. It's more masculine anyway.</p><p>3:48</p><p>Good point. I mean, shit...</p><p>3:49</p><p>If you want it to be a bicep, it needs more veins.</p>","url":"https://www.figma.com/community/file/1105303539734444295"}
