{"id":"835574038378259608","name":"Hadisler","lastUpdateDate":"2020-05-20T16:47:46.935Z","publisherHandle":"ahmet","publisherImage":"https://s3-alpha.figma.com/profile/ab60cbef-e87b-42ed-89d0-a7910e5ffba6","publisherId":"1734942","publisherName":"Ahmet Çadırcı","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/331966030/012756bc-2d5f-4eef-8114-15c0b2a437c2-cover","description":"Sevgili Peygamberimiz mübarek sözleriyle, yaşayan sünnetiyle, çağları aşan örnekliğiyle her zaman müminlere yol gösterdi.\n\nİslam’ın nasıl yaşanacağını; bir dinin hayatın bütününe nasıl nüfuz edebileceğini; hayata sevginin, şefkatin, merhametin, iyiliğin, insanlığın nasıl katılacağını; adaletle merhametin, tevazuyla asaletin, doğrulukla istikametin aynı bedende çelişmeden kendisine nasıl yer bulabileceğini o öğretti. \n\nHakkı, hakikati, göremediğimiz gerçekleri, gözümüzden kaçan incelikleri, her yönüyle hayatı ve hatta daha da sonrasını anlamlandırmayı o öğretti.\n\nBizi aydınlatan, arındıran, besleyen, tebessümle güzelleştiren, tefekkürle hafifleten, hayâyla süsleyen, namazla yücelten, iman, ihsan ve istikamet üzere kendimize yol çizmeyi öğreten o idi.\n\nBütün bunları ve daha nice güzellikleri onun mübarek ağzından dinlemek, onun ashabının nasibiydi. Sonrasında izinin tozuna ulaşabilmek için nice insanlar hayatlarını onun yoluna vakfetti. Gecelerini, gündüzlerini, gözlerinin nurunu, ömür sermayelerini aşkla onun yolunda tüketti. Alimler, durmak bilmeden kıtaları aşıp onun bir sözünün izini sürdü. Yüzyıllar boyu hadis meclislerinde hep onun sözleri dinlendi. Ciltler dolusu telif ve tasnif ortaya kondu. Kalemler en güzel şekilde onu yazdı, kelamlar hep onu anlattı.\n\n“Benden bir söz işitip onu öğrenen ve başkalarına da aktaran kişinin Allah yüzünü ağartsın…” (Tirmizî, İlim, 7) kelamını işittiğinden beri yüzler bu vesileyle aydınlanma telaşına düştü. \n\nve mina’llâhi’ttevfîk…\n\n---\n\nKaynak: \n\n01. https://hadis.diyanet.gov.tr/\n02. https://bit.ly/2VSOKsl","url":"https://www.figma.com/community/file/835574038378259608"}
