{"id":"773469727625059982","name":"Tempura Generator","lastUpdateDate":"2021-10-12T13:49:47.528Z","publisherHandle":"498037","publisherImage":"https://www.gravatar.com/avatar/f334e802041befcf718a51f376af7f51?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"498037","publisherName":"Alex Tosatto","description":"<p>Download local styles as swift code, and save time.</p><p><br></p><p>A lifesaver for developers.</p><p>Tempura Generator lets you download local styles as swift code—no more time wasted with annoying typos and boring repetition. Just plug in and play.</p><p>When styling specific labels with local styles, Tempura Generator generates the code for the label, so you can paste it immediately into the scene you’re developing.</p><p><br></p><p>INSTRUCTIONS</p><p><br></p><p>* To download the Color Style catalog, select the Color Style header and click Download Archive. Unzip the downloaded Archive, and copy and paste its contents into the project. You can then access these colors and use them by typing &lt;&gt;</p><p><br></p><p>* The same procedure applies for text styles. Select Text Styles, Download File, and copy and paste it into the project. You can then access these text styles by typing &lt;&gt;</p><p><br></p><p>* You can generate a code to compose a label inside the UI of a scene by doing the following: Select the label you want to code, then select Code Header in the plugin, make your choices, and click Copy Style.</p><p><br></p><p>WHY USE TEMPURA GENERATOR?</p><p><br></p><p>Developers are always seeking out ways to save time. Tempura Generator delivers, big-time. As soon as the styles are added to the project, anyone in the team can use it immediately. So if you’re looking for ways to make your team more efficient, Tempura Generator is a must-have.</p><p><br></p><p>For example, if the designer changes the accent color from red to yellow, you don’t need to manually make these changes everywhere. Simply re-download the archive, paste its contents into the project, and it will immediately update all the instances of red, with the new yellow.</p>","url":"https://www.figma.com/community/plugin/773469727625059982","iconUrl":"https://www.figma.com/community/plugin/773469727625059982/icon","thumbnailUrl":"https://www.figma.com/community/plugin/773469727625059982/thumbnail"}
