{"id":"1034385618480624222","name":"Google One Tap Sign-In Component v1.2","lastUpdateDate":"2021-11-05T19:23:25.098Z","publisherHandle":"undecoab","publisherImage":"https://s3-alpha.figma.com/profile/3823fdf5-c544-4de8-b414-fe51e023b488","publisherId":"984548846127314903","publisherName":"Undeco","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1269718900/d21b75ea-17b6-4236-9569-17bc8d8a28a9-cover.png","description":"<p><strong>Update 1.2 - Verification</strong></p><ul><li>Updated button to be an interactive component with hover effect. The color is color-picked from a screenshot, might not be 100% exact Google blue etc</li></ul><p><br></p><ul><li>Added more variants of the final component: Verification</li></ul><p><br></p><ul><li>// When clicking “Continue” the compoment now smart animates to the Verification state</li></ul><p><br></p><ul><li>// After timed delays, the animations continue, and the final step is the component reducings it’s opacity to 0%.</li></ul><p><br></p><ul><li>// After clicking Continue, there’s no need to do anything, just wait for the animation to conclude.</li></ul><p><br></p><p>~ DISCLAIMERS ~</p><ul><li>At the moment, there is no animation for the portrait circle spinning while verifying, might or might not add that in the future, as it’s quite complicated to have it look good.</li></ul><p><br></p><ul><li>The animation between the component states introduces some minor artifacts, which is unfortunate for the time being. When this update was made, I didn’t have enough time to iterate, might fix this with an update in the future.</li></ul><p><br></p><p>~~~~~~~~~~~~~~~~~~~~~~~~~</p><p><br></p><p><strong>Update 1.1</strong></p><ul><li>Added consent sub-component for consent *</li></ul><p><br></p><ul><li>Updated spacing on the bottom section to match the real component better</li></ul><p><br></p><p>*Use the interactive switch on the component to toggle the consent</p><p><br></p><p>~~~~~~~~~~~~~~~~~~~~~~~~~</p><p><br></p><p><strong>Update 1.0</strong></p><p><br></p><p>This is a sign-in Figma component for the Google One Tap Sign-In experience.</p><p><br></p><p><strong>Font </strong>Product Sans</p><p><br></p><p>The whole layout is not pixel perfect, but rather created by comparison and eye, so there might be minor discrepancies in the smaller details.</p><p><br></p><p>Colors are colorpicked, so might not match the exact Google colors.</p>","url":"https://www.figma.com/community/file/1034385618480624222"}
