{"id":"748533339900865323","name":"Contrast","lastUpdateDate":"2021-07-29T15:20:05.682Z","publisherHandle":"6bf381fd_7d7d_4","publisherImage":"https://s3-alpha.figma.com/profile/f8c1486a-9388-4517-a742-ca19c1415766","publisherId":"984548590427335154","publisherName":"Maark","description":"<p>Contrast makes it easy to check the contrast ratios of colors as you work. Select a layer and Contrast will immediately look for the color directly behind your selection and serve up the contrast ratio along with passing and failing levels from the Web Content Accessibility Guidelines (WCAG). If Contrast cannot find the background color, add another layer to your selection, and Contrast will compare them both.</p><p><br></p><p>Are you looking to give everything a once-over before finishing? Scan entire pages to generate a report of all text-based contrast issues. Step through them and fix issues as needed.</p><p><br></p><ul><li>Select elements to automatically find the color behind them</li><li>Scan entire pages to see all text-layer color issues</li><li>Works on any element, not just text</li><li>Extremely fast and responsive—keep it open as you work</li><li>Supports image and gradient backgrounds with Smart Sampling</li><li>Supports solid, transparent, blended fills, layered fills, and backgrounds</li><li>Live updates as you change the color, opacity, or blend of the selected element</li></ul><p><br></p><h2>Smart Sampling</h2><p>Contrast can compare an element’s color with the colors it finds in gradients and images in the background. It does this by taking a sampling of colors from the area directly behind the element and calculating the contrast ratio for each color. Contrast considers a color passing if all colors in the sample pass.</p><p><br></p><h2>Bugs</h2><p>If you have a situation where Contrast is not finding the right background, please let us know! Send us an example test case in Figma along with a short description of what you were expecting, and we’ll have a look.</p><p><br></p><h2>Known Issues</h2><ul><li>Element strokes are not yet supported</li></ul><p><br></p><h2>Smart Sampling Technique</h2><p>Contrast uses <a href=\"https://github.com/leeoniya/RgbQuant.js/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">RGBQuant</a> to analyze the selection of pixels behind an element. It looks for colors (pixels) that are represented two or more times within each sub-region (64x64) of the area tested. This method gives the best balance of speed and results. The time it takes Contrast to sample and analyze the colors is proportional to the size of the layer you are testing. I.e., Larger layers, in terms of area, will take longer than smaller areas. Sampling can temporarily block the interface in the same way that exporting a frame might—this shouldn’t be very noticeable for smaller layers.</p><p><br></p><h2>Credits</h2><p>Contrast was made by the Maark design team.</p>","url":"https://www.figma.com/community/plugin/748533339900865323","iconUrl":"https://www.figma.com/community/plugin/748533339900865323/icon","thumbnailUrl":"https://www.figma.com/community/plugin/748533339900865323/thumbnail"}
