{"id":"1091712683693829044","name":"Lingohub","lastUpdateDate":"2022-04-06T12:39:32.015Z","publisherHandle":"lingohub","publisherImage":null,"publisherId":"1091706002698476085","publisherName":"Lingohub","description":"<p>All your texts in one place - Localize your Figma projects with Lingohub!</p><p>&nbsp;</p><p>With Lingohub you localize your projects in no time! Whether they are web or mobile apps, games, or websites. We provide you with continuous translation management and a workflow that is smoothly integrated into your product development process.</p><p>&nbsp;</p><p>With our Figma plugin you can easily <strong>push </strong>your text segments <strong>straight from Figma to Lingohub</strong>. After your translation has been completed, simply <strong>pull </strong>the texts <strong>directly </strong>from Lingohub. Just like that you can view your localized design in Figma.</p><p>&nbsp;</p><p>Your translators<strong> </strong>have an added benefit<strong> </strong>too, as they are able to check the context<strong> </strong>of each text segment while translating. <strong>Screenshots </strong>of your design are <strong>automatically uploaded </strong>to Lingohub. The days of manually uploading screenshots are over.</p><p>&nbsp;</p><p>What can you do with Lingohub?</p><ul><li>Push and pull your text segments directly from Figma to Lingohub and vice-versa.</li><li>Different teams working together on localization.</li><li>Automate your software localization.</li><li>Translate with our powerful editor.</li><li>A translation tool you can depend on: term base, translation memory, quality checks, ...</li></ul><p>&nbsp;</p><p>For more information on how to use our Figma plugin, visit our Help Center article https://help.lingohub.com/en/.</p><p>&nbsp;</p><p>To use the Figma plugin a paid account is required. We provide you with a 14-day free trial<strong> </strong>where all features are available for you to try. If you need help, feel free to contact our https://lingohub.com/support at any time. Or schedule a free https://lingohub.com/demo and learn all about Lingohub.</p>","url":"https://www.figma.com/community/plugin/1091712683693829044","iconUrl":"https://www.figma.com/community/plugin/1091712683693829044/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1091712683693829044/thumbnail"}
