{"id":"818613147082270958","name":"Sitemap","lastUpdateDate":"2021-02-17T11:15:33.448Z","publisherHandle":"fabien","publisherImage":"https://s3-alpha.figma.com/profile/d86ee50a-f0c1-455c-809f-198339d43057","publisherId":"383","publisherName":"Fabien","description":"<p>Create maps of your site. Crawl links. Recursive &amp; fast.</p><p><br></p><p>________</p><p><br></p><p>🌐 How does it work ?</p><p><br></p><p>• type/paste your site url</p><p>• click on \"Create Map\"</p><p>• a Sitemap is displayed on your main canvas, listing all links found in the html source of</p><p><br></p><p>• for further exploration : select a group with a link, and click on \"Create map\" again. A new map is then created, with all the links found in this new page.</p><p>• Links that are found on both pages are shown with a reduced opacity, so you can easily spot \"new\" links, that are present only on the sub page.</p><p><br></p><p>________</p><p><br></p><p>🧰 Options</p><p><br></p><p>• you can sort urls alphabetically or by url length</p><p>• you can choose to only display links that contain a specific word/url (using \"Contains..\")</p><p>• .. or you can exclude links based on a word/url (using \"Without..\")</p><p>• you can also search for specific word/url (by selecting one or multiple frames, typing the word then click \"search\")</p><p>• not necessary, but I suggest you choose an empty page, with a background color set to #3C6DD3, when you use this plugin</p><p><br></p><p>________</p><p><br></p><p>📸 Screenshots (option)</p><p><br></p><p>• you can automatically display screenshots of the given urls</p><p>• to do so, this plugin uses free api API Flash</p><p>• please note that I am not affiliated with API Flash</p><p><br></p><p>In order to use the screenshot option, you will need to get a free account on <a href=\"https://apiflash.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://apiflash.com/</a> (free up to 100 screenshots per month). Then, just paste your API key inside the right input, then select \"With screenshots\"</p><p><br></p><p>________</p><p><br></p><p>🗒️ Notes</p><p><br></p><p>This plugin is a WIP. Besides, it may not be as efficient as dedicated SEO tools, but can be useful (I hope!) to get a quick view of how your site is organised. If you find bugs, or if you find this plugin usefull and have suggestions on how to improve it, please feel free to contact me.</p><p><br></p><p>NB : this plugin uses <a href=\"http://cors-anywhere.herokuapp.com\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">cors-anywhere.herokuapp.com</a>, which can sometimes affect its responsiveness.</p>","url":"https://www.figma.com/community/plugin/818613147082270958","iconUrl":"https://www.figma.com/community/plugin/818613147082270958/icon","thumbnailUrl":"https://www.figma.com/community/plugin/818613147082270958/thumbnail"}
