{"id":"744725347356614754","name":"Dominant Color Toolkit 🎨","lastUpdateDate":"2021-10-15T22:49:50.442Z","publisherHandle":"brian","publisherImage":"https://s3-alpha.figma.com/profile/1b76627d-3cc9-4292-849e-7b9460c380d6","publisherId":"22538","publisherName":"Brian Lovin","description":"<p>Generate a palette from an image to magically populate your designs.</p><p><br></p><p>This plugin provides two core functions:</p><p><br></p><p>1. Generate utility palette: extracts the dominant color from an image, suggests high-contrast text colors, and includes additional complementary palette information.</p><p>2. Smart populate: takes your selection and intelligently sets layer fills and text colors based on nearby images.</p><p><br></p><p>Generating a dominant color palette</p><p><br></p><p>1. Select one or more layers in Figma that contain image fills.</p><p>1. Run the plugin Menu &gt; Dominant Color Toolkit 🎨 and your palette will be generated.</p><p><br></p><p>Note: To prevent overlapping frames from appearing in your designs, align your images 500px apart.</p><p><br></p><p>Smart populate</p><p><br></p><p>1. Select any frame, component, or instance</p><p>2. Menu &gt; Dominant Color Toolkit 🎨</p><p>3. Command + Shift + P to re-run</p><p><br></p><p>How does Smart Populate work?</p><p>- If you selected one or more frames which contain an image, shapes, and text, the plugin will use the first image it finds to automatically fill the shapes with the computed dominant color and set text layers to have a high-contrast fill against that dominant color.</p><p>- If you selected an image along with shapes and text layers, the plugin will use the selected image to populate selected shapes with the computed dominant color and set text layers to use the high-contrast fill color.</p><p>- If you selected shapes and text, but no image, the plugin will traverse outwards in your frame until it finds an image fill. This image will will then be used to populate the shapes and text with the dominant color and high-contrast text colors.</p><p><br></p><p>Note: This plugin supports both image fills and background fills, using the first valid fill it can find. As a result, a frame with a background fill that has children shape and text layers will populate successfully!</p><p><br></p><p>Secret options: If you'd like to text layers to the dominant color rather than high-contrast color, simply include the text \"dominant\" anywhere in the layer name!</p><p><br></p><p>This plugin is open source, contributions welcome: <a href=\"https://github.com/brianlovin/figma-dominant-color-toolkit\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://github.com/brianlovin/figma-dominant-color-toolkit</a></p><p><br></p><p>Credits</p><p><br></p><p>color-thief (<a href=\"https://github.com/lokesh/color-thief\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://github.com/lokesh/color-thief</a>) for finding dominant colors and generating palettes</p>","url":"https://www.figma.com/community/plugin/744725347356614754","iconUrl":"https://www.figma.com/community/plugin/744725347356614754/icon","thumbnailUrl":"https://www.figma.com/community/plugin/744725347356614754/thumbnail"}
