{"id":"913828647221574819","name":"Friday Design System Kit 1.1.1","lastUpdateDate":"2020-11-27T20:27:24.354Z","publisherHandle":"mobilelive","publisherImage":"https://s3-alpha.figma.com/profile/31d3a8be-1693-4ed4-8f1f-f0ed20f54583","publisherId":"1791","publisherName":"MobileLIVE Inc","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/564852109/5eee73d4-830b-42cd-b924-680a55f50e7d-cover.png","description":"<p><strong>Friday Design System (FDS</strong>) is a Design System accelerator to help you accelerate the development and design efforts for a faster time to market. It comprises open-source libraries and components that take away the pain of setting a Design System from scratch.</p><p><br></p><p>FDS is specifically architected to support <strong>multi-brand experiences</strong> for e-commerce and digital enterprise applications. Our team has vast experience implementing customer journeys for Telecom and BFSI sectors and we have leveraged our knowledge to ensure FDS provides components, API platforms and other core components to <strong>accelerate implementation of digital customer journeys</strong> for multi-branded experiences with <strong>cross-platform support </strong>in <strong>multiple development frameworks e.g React &amp; Angular</strong>.</p><p><br></p><p>FDS is a comprehensive design system that allows you to start building multi-branded experiences. Our team has laid out foundation pieces like documentation, processes, structure, metrics, and distribution models. All the components have been fully tested and accessibility guidelines have been taken into consideration.</p><p><br></p><p><strong>Friday Design System Includes:&nbsp;</strong></p><p><br></p><p><strong>Design Kit</strong>: - A kit of flexible, consistent and accessible <strong>components</strong> designed and maintained in Figma. It also provides best practices and guidelines for using each component along with different supported <strong>variants</strong>.</p><p><br></p><p><strong>Storybook Documentation</strong>: Storybook displays development-ready components built-in react &amp; angular and the documentation on usage and variants.</p><p><br></p><p><strong>Component Library</strong>: Components architected to support multi-brand experiences supported in most popular frameworks like react and angular, and static components to accelerate your journey of design system implementation.</p><p><br></p><p>You can find the following items in the Design Kit V.1.1:&nbsp;</p><p><br></p><p><strong>Design Language</strong></p><p><br></p><ul><li>Themeable components for your brand colours/fonts</li><li><strong>Layout &amp; Grid System</strong>: Breakpoints (small, medium, large &amp; extra large devices)</li><li><strong>Typography</strong>: Font sizes, styles, font-weight, letter spacings and line-height etc</li><li><strong>Iconography</strong>: a set of font icons&nbsp;</li><li><strong>Colours</strong>: Primary, Secondary, error, warning, success etc</li><li><strong>Spacing Units</strong></li></ul><p><br></p><p><strong>Components</strong></p><p><br></p><p>- <strong>Buttons</strong> ( Primary, Secondary, Clear)</p><p>- <strong>Input</strong></p><p>- <strong>Check Box</strong></p><p>- <strong>Radio Button</strong></p><p>- <strong>Select</strong></p><p>-<strong> Tooltip</strong></p><p>-<strong> Popover</strong></p><p>- <strong>Modal</strong></p><p>- <strong>Toast Notifications</strong></p><p><br></p><p>For more information and a detailed design system visit:<a href=\"https://friday-design-system.netlify.app/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> https://friday-design-system.netlify.app/</a></p><p><br></p>","url":"https://www.figma.com/community/file/913828647221574819"}
