{"id":"1050620296160473585","name":"Budaya Susel","lastUpdateDate":"2021-12-09T05:38:25.952Z","publisherHandle":"BudayaSulsel","publisherImage":"https://www.gravatar.com/avatar/c1f1f43e93fa5df560f2639b2d4944ae?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"1050609170340924451","publisherName":"Alifia Zaskia Anwar","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1366205062/97ddeaf7-4629-4169-a314-d20a3b9ab82b-cover.png","description":"<h2>Di Sulawesi Selatan terdapat banyak etnis dan suku tetapi yang paling mayoritas adalah Suku Makassar, suku Bugis, dan suku Toraja. Sehingga bahasa yang dominan adalah bahasa ketiga suku tersebut, yaitu Makassar, Bugis dan Toraja.</h2><h2>&nbsp;</h2><h2>Kebudayaan yang paling terkenal hingga ke luar negeri adalah adat dan budaya Toraja. Rumah adat di Sulsel yang berasal dari ketiga daerah (Makassar, Bugis dan Toraja) memiliki bentuk yang hampir sama, di atas tiang-tiang dengan kolong di bawahnya.</h2><h2>&nbsp;</h2><h2>Rumah adat Sulawesi Selatan Suku Toraja disebut tongkonan, berdiri di atas tumpukan kayu dengan ukiran warna meraj, hitam dan kuning. Salah satu kebiasaan yang cukup dikneal di Sulsel adalah Mappalili (Bugis) atau Appalili (Makassar). Mappalili atau Appalili berasal dari kata palili yang berarti untuk menjaga tanaman padi dari sesuatu yang akan mengganggu atau merusaknya.</h2><h2>&nbsp;</h2><h2>Ritual Mappalili atau Appalili telah dilakukan turun temurun oleh masyarakat Sulawesi Selatan terutama dari Kabupaten Pangkep. Senjata kas Sulawesi Selatan adalah badik atau badek, yaitu pisau dengan bentuk khas yang dikembangkan masyarakat Bugis dan Makassar. Makanan khas Sulawesi Selatan ada banyak tetapi yang terkenal adalah Coto Makassar dan Pisang Ijo Selain itu juga ada jenis makanan khas lain seperti Pisang Epe, Bassang, Roti Maros, Jalangkote, Kue Biji Nangka dan lainnya. Di Sulawesi Selatan terdapat beberapa jenis pakaian adat. Salah satu yang terkenal adalah Baju Bodo dari suku Bugis.</h2><h2>&nbsp;</h2><h2>Baju Bodo adalah baju khas untuk wanita, berbentuk segi empat dengan lengan yang pendek. Baju Bodo adalah baju tertua di Indonesia.</h2><h2>&nbsp;</h2><h2>&nbsp;</h2><h2>Warna pada Baju Bodo memiliki arti tersendiri, yaitu menunjukkan umur dan status sosial orang yang memakainya.</h2>","url":"https://www.figma.com/community/file/1050620296160473585"}
