{"id":"1052589680654579795","name":"CommerceBooster | Open Source B2B UI Template","lastUpdateDate":"2022-01-02T16:42:55.265Z","publisherHandle":"divante","publisherImage":"https://s3-alpha.figma.com/profile/5fa3aac8-d619-4157-9206-f2627797e9b4","publisherId":"1052589680494559906","publisherName":"Divante","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1424012562/097eb36f-9015-421f-bc2a-3f6691551574-cover.png","description":"<p>CommerceBooster is the first open-source, UI template for B2B eCommerce. It’s optimized for commercetools and Vue Storefront. It literally saves months of work for anyone starting B2B eCommerce projects.</p><p><br></p><p>Why is CommerceBooster worth trying out?</p><p><br></p><p>⭐ It's based on granular, reusable component designs so you can use the exact parts you want, starting from simple buttons up to full-page designs.</p><p><br></p><p>⭐ A Figma file contains all of the functionalities that make every designer’s life easier, like a style guide, auto layout, components, etc. Just make a copy and play with it!</p><p><br></p><p>⭐ The template was built with the best user experience (UX) principles and compiled from our 13 years of eCommerce experience at Divante. It doesn’t just look nice, but it also meets sales goals.</p><p><br></p><p>⭐ It's optimized for commercetools by being aligned to API, having advanced product filtering that works out of the box, and other dedicated B2B features.</p><p><br></p><p>⭐ It’s headless, progressive web app ready, and compliant with MACH standards. It’s a natural fit for Vue Storefront.</p><p><br></p><p>⭐ It contains 10 full pages of designs that consist of more than 100 UI components.</p><p><br></p><p>And there's much more. Visit our website for more info, and if you have any questions, feel free to catch our team here. We'll be happy to help!</p><p><br></p><p><a href=\"https://www.divante.com/commercebooster\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://www.divante.com/commercebooster</a></p>","url":"https://www.figma.com/community/file/1052589680654579795"}
