{"id":"1045705946986194745","name":"Creatt UI Wireframe Kit - Modern & Clean Design WireFrame","lastUpdateDate":"2021-11-25T18:35:04.616Z","publisherHandle":"creatt","publisherImage":"https://s3-alpha.figma.com/profile/f5b319c7-2e5f-40aa-9a2c-f3582f99e223","publisherId":"946881176802323582","publisherName":"Creatt Studios","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1327675021/eca43b14-82a4-43c7-986c-dd5b65ef25fd-cover.png","description":"<h2><strong>500+ Frames</strong> in a single Figma Design Kit, Creatt Wire makes designing Landing pages easier with over 17 Different categories and 500+ frames possibilities with what you can make are endless.</h2><p><br></p><p><strong>Stackable Frames:</strong> Copy and Stack frames one after another you can literally create a landing page in under a minute once you select what frames you want.</p><p><br></p><p><strong>Modern Design:</strong> A Design Kit that will not disappoint you or your clients. Our Framework is built to support websites on 1120 Grid, we have carefully selected some of the best Blocks and converted them into frames that are as Clean as they are Modern.</p><p><br></p><p><strong>UI Components</strong>: Creatt Wire comes with components based on Figma’s New Auto Layout Feature for easy resizing and gives you more control over your prototypes.</p><p><br></p><p><strong>Creatt Wire</strong> is made easy to use for anyone and everyone you don’t have to be a designer to create amazing, Clean and Modern web pages our video here shows you how easy it is to create Landing pages and prototypes using simple copy and paste. From Hero, FAQ, pricing all the way to footer you are going to have access to over 500+ Frames in over 17+ Categories that are carefully designed with precise detailing and perfection. Creating prototypes has never been easier</p><p><br></p><p><strong>Creatt Wire </strong>comes with perfectly renamed groups &amp; frames, so you won’t have to find them as you go digging thru layers our Aim was to create a very User-friendly Design Kit which we did All layers are perfectly balanced and well-positioned for ease of use.</p><p><br></p><p><strong>Exclusivity:</strong> Creatt Wire is built on and Exclusively for Figma we believe in the Future of Design we Believe in Figma.</p>","url":"https://www.figma.com/community/file/1045705946986194745"}
