{"id":"908805999617934211","name":"Index—1 'FLAT'","lastUpdateDate":"2021-03-13T03:19:07.240Z","publisherHandle":"index","publisherImage":"https://s3-alpha.figma.com/profile/b06d96d5-48e5-4309-a28e-03cae6011abf","publisherId":"846125566167649736","publisherName":"Index™","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/727167222/aeb300a1-9783-4bba-90b6-d32d2b17689d-cover.png","description":"<p>INDEX #1,‘FLAT’</p><p><br></p><p>510 pages</p><p>United States</p><p>First published in 2021</p><p><br></p><p>Editors: Andrew Chee, Virgilio Santos, Marc Shillum</p><p>Designers: Andrew Chee, Virgilio Santos, Marc Shillum</p><p>Writers: Andrew Chee, Marc Shillum</p><p>Publisher: Rote Press</p><p><br></p><p>A collaboration across three states and two time zones, INDEX issue #1 ‘FLAT’ explores and expresses what Andrew Chee, Virgilio Santos and Marc Shillum observe as the flattening, flatness and related qualities of living in the world today.&nbsp;</p><p><br></p><p>‘FLAT’ was written, designed, and published simultaneously as a periodical and a shared library. In the print edition, they embrace the flatness of print-on-demand; like photocopying before and hand printing before that, celebrating the idea of an infinite facsimile. As such, each version of this edition embraces chance imperfections, will be subtly different, slightly decayed by the deviation in machinery, handwork, paper-stock, trimming, binding, and shipping.</p><p><br></p><p>Issue 1, an exercise in flatness, seeks to make its contents both spectacle and mundanity, inviting acceptance, reuse and remix, flattens question and answer and opinion, is self-aware and self-mocking, respects the reader, kills its idols, an anti-manifesto, an open book.&nbsp;</p><p><br></p><p>The idea of a carrier signal being the various forms in which the mediums of print, paint, and digital are most expected as norms; the message is then free to live on in multiple forms for multiple audiences and interpretations; all resulting artifacts can then be shared for reuse in the library while the carrier itself is expected to change with time.⁠</p><p><br></p><p><a href=\"http://index.works/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">index.works</a></p><p><br></p>","url":"https://www.figma.com/community/file/908805999617934211"}
