{"id":"750673765607708804","name":"Artboard Studio Mockups","lastUpdateDate":"2021-08-09T06:20:08.739Z","publisherHandle":"artboardstudio","publisherImage":"https://s3-alpha.figma.com/profile/a8af8f63-53db-476f-940c-9d4339c68b56","publisherId":"86679","publisherName":"Artboard Studio","description":"<p>Create mockups in Figma easily by getting access to thousands of world-class quality Artboard Studio mockup items right inside your Figma files. Easily render Figma frames into real-life product mockups with a click of a button. More items are added to our ever-growing library every day.</p><p><br></p><p>Demo video: <a href=\"https://www.youtube.com/watch?v=nlfhPeAvK4Q\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://www.youtube.com/watch?v=nlfhPeAvK4Q</a></p><p><br></p><p>How to use:</p><ol><li>Follow the on-screen guide and create a secret API key on Artboard Studio.</li><li>Paste your secret API key into the plugin window, save and start adding mockup items right into your current Figma file.</li><li>All imported items are fully layered and customizable.</li><li>Items that have renderable labels come with relevant frames. Copy and paste your designs into those frames, make sure the frame is selected and click Render Selected Frame.</li><li>You can resize frames and mockup items, it will still work as long as you keep the aspect ratio.</li><li>To unlock access to our premium items, subscribe to one of our premium plans. It will automatically unlock all items next time you use the Artboard Studio plugin in Figma.</li><li>Use the menus on the top of the items to search and filter items based on name, viewpoint, and category.</li><li>Happy Designing 😉</li></ol><p><br></p><p>Road map:</p><ol><li>Enabling \"Quick Render\" for Figma browser (due to an unknown bug it currently only works on the the desktop version of Figma)</li><li>Ability to assign your current frames to Artboard Studio mockup items.</li><li>Automatically render frame changes into mockup items (we are waiting for Figma team to release long-running plugins and events for plugins)</li><li>Adding more items every day will never leave our road map, check back every day to see new items fresh out of the oven 😋</li></ol>","url":"https://www.figma.com/community/plugin/750673765607708804","iconUrl":"https://www.figma.com/community/plugin/750673765607708804/icon","thumbnailUrl":"https://www.figma.com/community/plugin/750673765607708804/thumbnail"}
