{"id":"767379019764649932","name":"Clean Document","lastUpdateDate":"2021-07-04T03:03:53.191Z","publisherHandle":"yuanqing","publisherImage":"https://s3-alpha.figma.com/profile/c7ce93ab-bb43-4882-99e5-5d7e986264af","publisherId":"1682602","publisherName":"Yuan Qing Lim","description":"<p>Automagically organize and clean up your Figma document.</p><p><br></p><h1><a href=\"https://ko-fi.com/yuanqing\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Fund my work on Figma plugins →</a></h1><p><br></p><h2>Delete Hidden Layers</h2><p>Deletes all hidden layers within the selection or on the current page.</p><h3><br></h3><h2>Ungroup Single-Layer Groups</h2><p>Ungroups single-layer groups within the selection or on the current page that have no background, blend mode, effect or export setting.</p><h3><br></h3><h2>Make Pixel-Perfect</h2><p>Rounds the X and Y position and dimensions of layers within the selection or on the current page to the nearest pixel.</p><h3><br></h3><h2>Smart Rename Layers</h2><p>Intelligently renames layers within the selection or on the current page.</p><ul><li>Layers of type Text will be named based on their text content.</li><li>Layers of type Instance will be given the same name as their Main Component.</li><li>Layers of all other layer types will be named based on their layer type. (For example, a layer of type Rectangle will be named “Rectangle”, a layer of type Group will be named “Group”, and so on.)</li><li>Layers with export settings will not be renamed.</li></ul><p>Optionally specify a Regular Expression to skip the renaming of particular layers.</p><h3><br></h3><h2>Smart Sort Layers</h2><p>Sort layers within the selection or on the current page by their X and Y position while maintaining their relative stacking order on the page.</p><h3><br></h3><h2>Clean Layers</h2><p>Run all the above commands on layers within the selection or on the current page. Optionally skip processing of Locked layers.</p><h3><br></h3><h2>Sort Pages</h2><p>Sorts pages of the current document in alphabetical order.</p><h3><br></h3><h2>Reset Plugin</h2><p>Resets all settings to their defaults.</p>","url":"https://www.figma.com/community/plugin/767379019764649932","iconUrl":"https://www.figma.com/community/plugin/767379019764649932/icon","thumbnailUrl":"https://www.figma.com/community/plugin/767379019764649932/thumbnail"}
