{"id":"920629946433721508","name":"Memsource","lastUpdateDate":"2021-11-09T07:17:29.940Z","publisherHandle":"2609cc7a_c033_4","publisherImage":null,"publisherId":"967076955132634421","publisherName":"Memsource Plugin","description":"<p><strong>What is Memsource?</strong></p><p>Memsource is the leading AI-powered translation management system (TMS), empowering global companies to streamline and centralize multilingual content creation. Our cutting-edge TMS will help optimize and automate your localization process. Localization is easier, faster, and more cost-effective with Memsource.</p><p>&nbsp;</p><p><strong>Why Figma + Memsource?</strong></p><p>Bring design and localization closer together with our Figma plugin.&nbsp;</p><p>&nbsp;</p><p><strong>Seamless localization</strong></p><p><br></p><p>There’s no need to leave your Figma account to create translation projects in Memsource. Send your designs for translation in just a few clicks, then seamlessly pull translations from Memsource back to Figma when complete.</p><p><br></p><p><strong>Immediate design support with pseudotranslation</strong></p><p>Use the pseudo-translate feature to validate translations in the design phase. Pseudotranslation simulates what your localized text will look like, allowing designers to get an early indication of how translations fit the design–reducing feedback loops.&nbsp;</p><p>&nbsp;</p><p><strong>Save time and money</strong></p><p>Translation memories within Memsource will automatically store all past translations and allow you to reuse them wherever possible, making for faster, cheaper, and more consistent localization. AI-powered machine translation will also help cut costs and speed up the translation process, without compromising quality.</p><p>&nbsp;</p><p><strong>Set up</strong></p><p>The plugin requires Memsource Ultimate or Enterprise edition. Get in touch with<a href=\"https://www.memsource.com/demo/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> Sales</a> for licensing questions.&nbsp;</p><p><br></p><p>Installing the plugin is quick and easy. Visit the Memsource<a href=\"https://help.memsource.com/hc/en-us/articles/360018403719\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> Figma Plugin</a> page for more information.</p>","url":"https://www.figma.com/community/plugin/920629946433721508","iconUrl":"https://www.figma.com/community/plugin/920629946433721508/icon","thumbnailUrl":"https://www.figma.com/community/plugin/920629946433721508/thumbnail"}
