{"id":"995041596274656460","name":"Tunas Sawa Erma Korindo Group","lastUpdateDate":"2021-07-08T19:00:03.680Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968337258/9fd48ba0-9cf9-4fce-a40b-a139c217831c-cover.png","description":"<p><strong>Tunas Sawa Erma Group </strong>merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang usaha perkebunan dan pengolahan minyak kelapa sawit dengan dengan kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang seluruhnya bergerak dalam bidang budidaya kelapa sawit dan memproses minyak sawit mentah (Crude Palm Oil/CPO) dan juga berlokasi di Papua. Sejak tahun 1995, Tunas Sawa Erma Group mengawali usaha kelapa sawit di Papua atas permohonan Pemerintah Daerah. Kondisi infrastruktur saat itu tetap minim, tetapi Tunas Sawa Erma Group dapat berkembang baik dan termasuk jadi pihak pertama yang berkontribusi dalam pembangunan jalan Trans-Papua.</p><p><br></p><p>Sesuai dengan dengan visi dan misi untuk jadi perusahaan global, Tunas Sawa Erma Group memiliki prinsip terhadap kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang telah terjadi dan tertuang secara paham di situs formal perusahaan. Areal konsesi kami tidak berlokasi di lahan gambut. Selain itu, TSE Group termasuk menciptakan sistem dan lingkungan kerja yang menolong pengembangan sumber kekuatan manusia lewat program seleksi dan pelatihan dan juga pembangunan berkelanjutan. Saat ini perusahaan termasuk telah memiliki tim Sustainability.</p><p><br></p><p>Kami termasuk mengapresiasi kontribusi para karyawan yang tetap berkembang dengan dengan perusahaan. Atas dedikasinya, Tunas Sawa Erma Group telah mempromosikan 70% berasal dari karyawan jadi karyawan tetap. Kemajuan wanita termasuk jadi anggota berasal dari perhatian kami. Sebanyak 20% berasal dari total karyawan adalah perempuan dan kami tetap menolong untuk mencapai potensi paling baik mereka.​</p><p><br></p><p>Tak hanya itu, Tunas Sawa Erma Group Sebagai perusahaan termasuk tetap pelihara interaksi yang serasi dan saling membangun dengan dengan Pemerintah Daerah maupun masyarakat setempat, dan juga tetap aktif dalam kegiatan pengembangan ekonomi dan kesejahteraan masyarakat Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang telah beroperasi yaitu punya PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.&nbsp;</p>","url":"https://www.figma.com/community/file/995041596274656460"}
