{"id":"966214168061013144","name":"Team Retrospective board","lastUpdateDate":"2021-04-21T06:46:10.972Z","publisherHandle":"buzzvil","publisherImage":"https://s3-alpha.figma.com/profile/f4d2eaf1-6607-48cd-bc4f-6bfae39d4332","publisherId":"1694","publisherName":"buzzvil","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/799070840/2e603d98-5038-49d3-bc5c-89493ef99354-cover.png","description":"<h1>Retrospective made fun!</h1><p>We run monthly and quarterly basis retrospective on each team. Over the past 2 years we ran dozens of offline/online retros.</p><p>The whole exercise is compiled into a <strong>30min</strong>. workshop during which every team player gets to share feedback with the rest of the team.</p><p><br></p><h2>Step 1: Generate feedback! (5-7min)</h2><p>Give everyone 5 to 7 minutes to write as many feedback as possible (outside the whiteboard).</p><ul><li>Use green post-its to describe what went well</li><li>Use red post-its to describe what could have been better</li></ul><h2>Step 2: Share insights, one by one (15min)</h2><ol><li>Once done, ask someone to start dragging a feedback on the whiteboard, shortly explaining what this is about.</li><li>Then let anyone add-up any card that relates to the first one. It can go on as long as there are related cards, people shortly explaining their share every time.</li><li>When there aren’t any more related cards, ask another person to add-up another card and repeat the same process for as long as there are cards left.</li></ol><h2>Step 3: Group insights by topic or category (5min)</h2><p>When all the cards are on the white board, it is time to group them by giving them some category names. It is ok to move things during this step!</p><p>-&gt; Once all the groups are defined, you can rate them (green card is a +1, red card is a -1).</p><p><br></p><h2>Step 4: Vote! 3-5min</h2><p>Once done, give each participant the right to vote for 3 to 5 categories based on what they think is most important.</p><p>You can use the related Jam Stamp.</p><p><br></p><p>The first time running this workshop will certainly go over 30min. but with time and practice you and your team will have no trouble running these within an 1/2 hour.</p>","url":"https://www.figma.com/community/file/966214168061013144"}
