{"id":"1098405969270214551","name":"Asana","lastUpdateDate":"2022-06-14T18:46:06.931Z","publisherHandle":"rfu","publisherImage":"https://s3-alpha.figma.com/profile/fdabf579-73a4-4aee-9ed5-abe3c0379bc6","publisherId":"1070761491170653333","publisherName":"Roy Fu","description":"<p>Nothing great is made alone, so why should we manage our projects that way? Asana and Figma work together to help teams move work forward—no matter which tool they’re in.</p><p><br></p><p>In FigJam, you can use the Asana widget to pull Asana projects and all of their associated tasks into the canvas to discuss and update as a team. Adjust due dates, assignees, tags, sections, projects, and any custom fields right in FigJam, while maintaining your source of truth in Asana. And, if new to-dos come up in a meeting, you can capture them on stickies and then instantly convert them to tasks in Asana.</p><p><br></p><p>Get started with the Asana widget for FigJam:</p><ol><li>Click “Install” at the top right of this page</li><li>Open a FigJam file</li><li>On the tool bar, click the button at the far right and search for “Asana”&nbsp;</li><li>Select the Asana widget to insert it into your document</li><li>Sign into your Asana account via the prompt</li><li>To bring an Asana project into FigJam, select “Import” on the widget and paste in the URL of the project you’d like to import</li><li>To edit a task or see more details, select the task and then select “Show meta data” in the tool bar</li><li>To turn stickies into Asana tasks, select one or more stickies, then select “Convert selected stickies to tasks” on the widget</li></ol><p><br></p><p>---</p><p>Learn more about how to use this widget with your team and try it out for yourself in this playground file: <a href=\"https://www.figma.com/community/file/1103759573623690161/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">https://www.figma.com/community/file/1103759573623690161/</a></p>","url":"https://www.figma.com/community/widget/1098405969270214551","iconUrl":"https://www.figma.com/community/widget/1098405969270214551/icon","thumbnailUrl":"https://www.figma.com/community/widget/1098405969270214551/thumbnail"}
