{"id":"953370369579706676","name":"Nile Dashboard & Design system (Demo v2)","lastUpdateDate":"2021-03-15T19:13:29.003Z","publisherHandle":"dlex","publisherImage":"https://s3-alpha.figma.com/profile/e6338602-b50d-4bb0-b0e4-6fe1d5c80162","publisherId":"859385359913288065","publisherName":"Dlex","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/730752911/7c7fd6dd-ac02-4805-a5fe-4c70d55a29f9-cover.png","description":"<h2><a href=\"https://dlex.io/nile-dashboard/figma\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Nile Dashboard &amp; Design system</strong></a></h2><p>Comprehensive design system featuring modular components to help build consistent, high-quality and performant web apps.</p><p><br></p><h2><strong>Exceptional level of Flexibility</strong></h2><p>Figma empowered Nile Dashboard to deliver a truly customizable design system, with all components supporting <strong>Auto Layout</strong> and <strong>Combined Components</strong> so that you can easily make your Dashboard truly yours with countless <strong>variants</strong> available.</p><p><br></p><h2><strong>Key Features</strong></h2><ul><li>Nile Dashboard is systematized to the core, from the grid, spacing, typography, coloring all the way to components and layouts.</li><li>Nile Dashboard is an atomic design system, with modular components that are highly unique and yet, deeply integrated within the system.</li><li>Nile Dashboard uses a simple yet powerful coloring system, that is available in both, light and dark modes for easy theming.</li><li>With a carefully picked coloring system, that is logically categorized, you can easily change the palette to reflect your brand style across the design.</li><li>The design system is built upon a typography system, that allows you to easily customize content and headlines as well as font types across the design.</li><li>Spacing and sizes were all built using the 4pt baseline grid standard to ensure consistent scaling and spacing across the design system.</li></ul><p><br></p><h2><strong>Designed carefully for a better UX</strong></h2><p>Nile Dashboard isn't just a modern and beautiful user-interface, we have also crafted each component to deliver better user-experience, we did that by researching industry-leading enterprise standards and we built components and layouts that grants the demands of these enterprises, so you don't have to think about it.</p><p><br></p><h2><strong>Style Guidelines Ready</strong></h2><p>the Design System and its components are all built and connected to a style guideline, that once you update, the entire design is changed for your own brand.</p>","url":"https://www.figma.com/community/file/953370369579706676"}
