{"id":"755300155155835622","name":"AutoLayout","lastUpdateDate":"2019-12-18T19:25:06.201Z","publisherHandle":"carlo","publisherImage":"https://s3-alpha.figma.com/profile/aaabe887-93bc-49f7-a11f-c828cb306b32","publisherId":"1688149","publisherName":"Carlo Jörges","description":"AutoLayout dynamically lays out layers in frames and updates the layout when the dimensions of child layers change. It behaves similar to Framer Stacks and the Anima Toolkit for Sketch. \n\nCreating a simple list\n1. Wrap the list elements in a frame\n2. Open the Auto Layout plugin, select the frame and enable the toggle ‘Layout frame’\n3. Change the direction to vertical and adjust spacing\n\nHow to create an auto-reflowing To Do list\n1. Create a text layer and a rectangle as checkbox next to it for the first todo item.\n2. Wrap both elements in a frame ( ⌘ + ⌥ + G )\n3. Open AutoLayout and enable it for the frame. Set direction to horizontal and adjust padding/alignment to your liking. You can change the order by moving layers up and down in the layers sidebar. \n4. With the frame selected, set Height to ‘Resize To Fit’ in AutoLayout which will automatically resize the frame when the text field gets longer\n5. Duplicate the frame a few times below to create a list of todos\n6. Wrap all todo items in a frame and enable AutoLayout, set the direction to vertical. You can adjust spacing between the items.\n7. Try adding a linebreak in one of the todo items to make it larger. The items below will automatically move down to make room.\n\nThe layout of the frame will update every second if either a child layer or the frame itself is selected. To update the layour, select a child layer or the frame while the plugin is open. \n\nAutoLayout is based on the Yoga implementation of Flexbox. Inspired by prior work from Scott Horsfall @scoh and Zachary Schiller @zacharyschiller","url":"https://www.figma.com/community/plugin/755300155155835622","iconUrl":"https://www.figma.com/community/plugin/755300155155835622/icon","thumbnailUrl":"https://www.figma.com/community/plugin/755300155155835622/thumbnail"}
