{"id":"854164523358810429","name":"Replace Layers","lastUpdateDate":"2020-09-28T13:10:59.728Z","publisherHandle":"schwa23","publisherImage":"https://s3-alpha.figma.com/profile/8d211b54-109b-4933-970e-f14c8e8bb1ad","publisherId":"2942331","publisherName":"Joshua Dickens","description":"<p>A Figma plugin to easily swap one layer with another.</p><h2>How to Use</h2><ol><li>Select a layer in your Figma document.</li><li>Click&nbsp;Set Source Layer</li><li>Select another layer or layers that you want to replace</li><li>Click&nbsp;Replace Layer(s)</li><li>Keep Transforms: Check this box if the layers you're replacing are rotated or scaled, and you want to apply those transforms to the replacements.&nbsp;Note&nbsp;Scaling can only be determined if the layer you're replacing is an instance of a component.</li></ol><h2><br></h2><h2>New in 1.1: \"Replace Image Fills\"</h2><p>If your source layer has one or more image fills, you can replace just the images on the destination layers. This is useful if you want to quickly set an image but don't want to lose the other fills or style treatments (which would get overridden if you naively copy-pasted a layer's properties)</p><h3>Now you can also paste or drag images into the image well to use as a source.</h3><p><br></p><h2>Other notes:</h2><p>Originally I wanted to be able to use the clipboard as the source for replacing a layer, but it's not possible in Figma. If you're using the Figma Desktop app, you can assign \"Set Source Layer\" to a keyboard shortcut as well.</p><p>If your source layer is a component, it will replace the target layer with an instance of that component.</p><p>The thumbnail that's generated when you set the source layer also acts as a quick export — just drag it to your desktop to get a 2x resolution PNG of the source layer.</p>","url":"https://www.figma.com/community/plugin/854164523358810429","iconUrl":"https://www.figma.com/community/plugin/854164523358810429/icon","thumbnailUrl":"https://www.figma.com/community/plugin/854164523358810429/thumbnail"}
