{"id":"890827946421911641","name":"Components v0.6.8 beta","lastUpdateDate":"2021-10-22T05:09:53.230Z","publisherHandle":"constlab","publisherImage":"https://s3-alpha.figma.com/profile/97e03454-314e-4a27-955d-ef302cee137c","publisherId":"881135356453126308","publisherName":"Const Lab","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1228900238/b489bf32-34a9-4022-a36f-c39ad70ac2b9-cover.png","description":"<h1>Design system for adaptive websites</h1><p><br></p><p>FULL VERSION, TOTALY FREE</p><p><br></p><p><strong>Disclaimer:</strong> the system is fresh, a lot is being adjusted and debugged right now. A lot of components are under development and will become available soon. Still, we are using the system to design project already now, the system helps us design projects in a faster and a more consistent way. The outcome we get is absolutely unique.</p><p><br></p><h2>Don’t miss the updates!</h2><h1>❤️ ⟶ Duplicate</h1><p>Like the project and duplicate it!</p><p><br></p><p>Before starting a new project make sure you have duplicated a new version of the file from here – this is crucial to have the latest possible version.</p><p><br></p><p><br></p><h2>How?</h2><p>Duplicate the file, make style changes (roundings, colors, gradients, typography, paddings and shadows), create your own design through new blocks in scenes and piles of scenes on top of each other. For details read the file.</p><p><br></p><p><br></p><p><strong>You know how to make it better?</strong></p><p>We are still developing and debugging the system and we are open to your ideas on how to make it even better and easier to use for all.</p><p><br></p><p>----</p><p><br></p><p>АБСОЛЮТНО БЕСПЛАТНАЯ ПОЛНАЯ ВЕРСИЯ</p><p><br></p><p><strong>дисклеймер: </strong>система пока сырая, многое в процессе отладки, многие компоненты в процессе создания и добавятся в ближайшее время, но мы уже используем ее в своих проектах и она уже сейчас помогает нам создавать проекты быстрее и аккуратнее, при том, что результаты имеют собственную идентичность и характер.</p><p><br></p><h2>Чтобы не пропустить обновления</h2><h1>❤️ ⟶ Duplicate</h1><p>Лайкни проект и потом сдублируй его себе</p><p><br></p><p>Перед каждым новым проектом, лучше дублируй новую версию файла отсюда, чтобы пользоваться максимально свежей версией.</p><p><br></p><h2>Как пользоваться</h2><p>дублируй файл, вноси стилестические изменения (скругления плашек, цвета, градиенты, типографика, отступы, тени) и создавай свои уникальные дизайны, создавая новые блоки в «сценах» и насаживая сцены друг на друга как этажи. Подробнее читай в инструкциях в самом файле.</p><p><br></p><h2>Есть предложения?</h2><p>мы в процессе создания и отладки, поэтому с&nbsp;радостью примем дельные советы по улучшению, чтобы системой было удобно пользоваться не только нам самим.</p>","url":"https://www.figma.com/community/file/890827946421911641"}
