{"id":"1084050156441328590","name":"HEART Framework","lastUpdateDate":"2022-03-29T14:36:14.803Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1704021343/e50a5c98-9b64-43af-897e-118d87df2272-cover.png","description":"<p>Reflect on metrics and signals.</p><p><br></p><h2>Summary</h2><p>The HEART Framework, designed by Google's research team, helps to measure the user experience of a product or service. For this purpose, the five KPI's happiness, engagement, adoption, retention, and task success were established and compared with goals, signals, and metrics.</p><p><br></p><h2>Step-by-step</h2><ol><li>The HEART Framework can be worked on alone or in a team. In a team, however, it might be easier to reflect on the process from different perspectives. The HEART Framework worksheet is required for preparation.</li><li>The metrics and signals of a product or service may change from time to time. For this reason, the HEART Framework should be run regularly to detect changes.</li></ol><ul><li><strong>Happiness:</strong>&nbsp;How do users feel about the product or service? Signals might be star ratings, feedback, or surveys, while metrics include ratings and reviews of applications or the Net Promoter Score.</li><li><strong>Engagement:</strong>&nbsp;How much time do users spend with the product or service? What is the average session length/frequency? What is the number of conversions?</li><li><strong>Adoption:</strong>&nbsp;How many people complete onboarding and subsequently become regular users? Adoption signals are e.g. how many people are signing up for an account or using a new feature. Common adoption metrics include the registration, download, feature adoption rate.</li></ul><ol><li><strong>Retention::</strong>&nbsp;How many users are returning to the product? How many of them are renewing their subscription, staying active, or making purchases? What is the subscription renewal rate?</li></ol><ul><li><strong>Task success:</strong>&nbsp;Is it easy for users to achieve their goals quickly? Are they able to complete tasks efficiently and finding/viewing content quickly? How long does it take users to complete a task?</li></ul><p>3. After the data has been collected, it can be discussed how to deal with it. Is there an area that is performing particularly well or poorly? How could poorly performing areas be improved in such a way that they perform better?</p>","url":"https://www.figma.com/community/file/1084050156441328590"}
