{"id":"954030554372094309","name":"3D Gadgets Collection (Freebie)","lastUpdateDate":"2021-03-17T18:26:29.686Z","publisherHandle":"juancquirino","publisherImage":"https://s3-alpha.figma.com/profile/04c533c7-1f2f-45b0-aa4d-034185cbba1d","publisherId":"3436234","publisherName":"Juan Carlos Quirino","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/735773699/372ad4ed-dbe9-4e53-a7dc-242e256cf39f-cover.png","description":"<h2><strong>👇Download👇</strong></h2><p><br></p><p><a href=\"https://gum.co/3d-gadgets-collection\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">3D Gadgets Collection</a></p><p><br></p><p>47 full color illustrations that allow you to improve any project. Technological objects that are part of our day by day. Use them to draw attention and give personality to your presentation, website or app design.</p><p><br></p><p><strong>What is included? 📦</strong></p><p><br></p><p>— 47 premium 3D illustrations + PNG files + Scenes of different platforms - which you can use in any project, such as app design, web projects, Figma drafts.</p><p>It contains:</p><p><br></p><ul><li>5 scenes PNG files (transparent)</li><li>20 tech gadgets in angle variations (47 images total)</li><li>Full stylized &amp; photorealistic finish</li><li>Figma project file</li></ul><p><br></p><h2><strong>Licensing agreement📝</strong></h2><p><br></p><ul><li>You have the right to use and modify the content in the 3D Illustration Kit according to your requirements and use them royalty free in personal and commercial projects, considering the exceptions specified later in this license.</li><li>Does not resell, assign, transfer or sublicense the content in the 3D Illustration Kit or any derived work from the content in the 3D Illustration Kit.</li><li>For any resalable web applications or software programs, you should not include the 3D Illustration Kit as an additional attachment. This will be considered as a redistribution of the content.</li><li>Does not make any use of the content in the 3D Illustration Kit for anything that might be considered defamatory, obscene, immoral or illegal.</li><li>Does not make any use of the content in the 3D Illustration Kit to slander, defame or to vilify a person, race, sex, culture, religion, country, region, town, village or any other place.</li></ul>","url":"https://www.figma.com/community/file/954030554372094309"}
