{"id":"806266638862897503","name":"Find and Replace Colors","lastUpdateDate":"2021-07-04T13:46:33.817Z","publisherHandle":"wei","publisherImage":"https://s3-alpha.figma.com/profile/a1fae4ca-9872-4cab-b52c-985c962868cd","publisherId":"2062376","publisherName":"Wei Zhong","description":"<p>Importing an unorganized design from Sketch APP? Coworker sends you an unfinished template without Figma color styles? Need to unified colors for a template?</p><p><br></p><p>FRC(Find and Replace Colors) is made for designers or teams who often need to create or modify templates. It is a quick &amp; easy solution for finding all colors and replacing them as you need.</p><p><br></p><p>SUPPORTED</p><p><br></p><p>- Multiple or individually selection — default select all supported shape types</p><p>- Shape Types: component, instance, slice, frame, group, star, line, ellipse, polygon, rectangle, vector and text</p><p>- Fill Types: background, stroke and gradient</p><p>- Color: 6-digit hex triplet color</p><p>- Find nodes that with match color</p><p><br></p><p>HOW TO USE</p><p><br></p><p>1. Install `FRC` and run it inside of a project</p><p>2. Click the input field next to the corresponding color and enter a new 6-digit hex triplet color</p><p>3. OPTIONAL: check or uncheck the replacing types — fill, stroke or gradient</p><p>4. Start to replace all matches by hitting the `Replace Colors` button</p><p><br></p><p>NOTES</p><p><br></p><p>- Native color picker behavior and style would depend on the using of desktop app or in-browser</p><p>- All the finding &amp; replacing action would only apply to the page that you run `FRC`</p><p>- Develop without opacity option — without too many modifications, especially for templates</p><p>- Find &amp; Focus could select all the nodes on the current page with matching color, then you can do whatever you want, like using native Figma \"Selection colors\" to replace with library color styles</p><p>- Not supporting live selection editing — need to close and rerun `FRC`</p><p>- Not supporting multiple colors in a same text layer</p><p><br></p><p>Built with love by the ©SearchKings team.</p>","url":"https://www.figma.com/community/plugin/806266638862897503","iconUrl":"https://www.figma.com/community/plugin/806266638862897503/icon","thumbnailUrl":"https://www.figma.com/community/plugin/806266638862897503/thumbnail"}
