{"id":"1106145414848884315","name":"6 Thinking Hats","lastUpdateDate":"2022-05-11T09:08:55.041Z","publisherHandle":"emddigital","publisherImage":"https://s3-alpha.figma.com/profile/1d0691e6-c80f-441f-b2ac-1d3e3ef46b67","publisherId":"1014659252538526170","publisherName":"Merck KGaA, Darmstadt, Germany","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1856454745/12eddbd9-8055-4157-ae81-8298e50c975a-cover.png","description":"<p>Spot quality ideas after having generated a good amount of output.</p><p><br></p><h2><strong>Summary</strong></h2><p>This exercise lets participants step into various mindsets and thinking styles. By doing so, they are able to change their perspective in many possible ways, which also helps them to step out of their own thinking habits. While all participants should constantly be encouraged to follow their role, it commonly is differed between the following six “hats”:</p><ol><li><strong>White Hat:</strong>&nbsp;Interested in information which is known or needed – only facts.</li><li><strong>Yellow Hat:</strong>&nbsp;Is optimistic and confident, thus explores positives aspects.</li><li><strong>Black Hat:</strong>&nbsp;Will judge every detail and try to figure out what may not work.</li><li><strong>Red Hat:</strong>&nbsp;Emotionally going for feelings and intuition. Will search for fears, likes, dislikes, love, and hate.</li><li><strong>Green Hat:</strong>&nbsp;The creative one. What are the possibilities, alternatives, and other ideas.</li><li><strong>Blue Hat:</strong>&nbsp;The facilitator who supervises if everyone stays in their role.</li></ol><p><br></p><h2><strong>Step-by-step</strong></h2><ol><li>Prepare a (simple) question that needs to be discussed. Alternatively, this exercise can be performed consecutively to a brainstorming session so that you can re-evaluate the findings from that exercise.</li><li>Prepare the six identity insignias (e.g. hats or shields etc.).</li><li>Announce the given time frame (e.g. 20 min.) and distribute the hats to the participants.</li><li>During the session, support the blue hat (or even be the blue hat yourself) and keep an eye on everyone staying in their roles.</li><li>Instead of one long run, you can also have multiple shorter rounds and let the participants change their roles between the runs.</li></ol>","url":"https://www.figma.com/community/file/1106145414848884315"}
