{"id":"1055486946344563829","name":"Smartcat Translator","lastUpdateDate":"2022-03-14T07:56:13.540Z","publisherHandle":"Smartcat","publisherImage":"https://slack-files2.s3-us-west-2.amazonaws.com/avatars/2018-08-02/409709067314_cbca21cf8a75c9dd8918_132.jpg","publisherId":"1055484787562919646","publisherName":"Smartcat Platform Inc","description":"<p>Instantly translate your Figma pages and individual frames into any language with Smartcat!<strong> </strong>Our plugin will make your designs truly multilingual, allowing you to tweak and test layouts in one place, without the messiness of endless copies for every language.</p><p><br></p><p>Your translations will be embedded into Figma text objects and kept intact when manipulating visuals. We’ve done our best to preserve text formatting within text objects as well. That underlined word inside a paragraph? It will stay underlined across all languages.</p><p><br></p><p>The Smartcat plugin is the easiest way to translate your designs, automatically or professionally. Here's how it works:</p><p><br></p><h2><strong>Automated translation mode</strong></h2><p><br></p><p>Open the Smartcat plugin in any Figma file. First, select the source language for the page and then choose the language you want to translate the page or the selected frames into. Need another language? Just select it from the list. Languages will be displayed as a row of buttons, so you can switch between them with just one click.</p><p><br></p><h2><strong>Professional translation mode</strong></h2><p><br></p><p>If you want your designs to be professionally reviewed, select 'Connect to Smartcat' in any given file, and this will create a project in Smartcat. Edit the text in Smartcat and the plugin will automatically push changes back into your Figma designs. You can continue working on your designs as usual—new content will be pushed to Smartcat for translation automatically!</p><p><br></p><h2><strong>More about Smartcat</strong></h2><p><br></p><p>Smartcat is a professional translation management system that allows you to create robust translation, editing, and proofreading workflows. Smartcat has a built-in marketplace of 400,000+ language professionals and companies ready to take your projects to the next level.</p><p><br></p><p><a href=\"https://help.smartcat.com/hc/en-us/articles/4412920821010\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Learn more about Smartcat for Figma &gt;</a></p>","url":"https://www.figma.com/community/plugin/1055486946344563829","iconUrl":"https://www.figma.com/community/plugin/1055486946344563829/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1055486946344563829/thumbnail"}
