{"id":"1067171178880468621","name":"When you should use variants VS creating separate components","lastUpdateDate":"2022-01-23T20:14:55.008Z","publisherHandle":"alicepackard","publisherImage":"https://s3-alpha.figma.com/profile/0cc81f84-07e0-4c43-a408-d87889a9ddf2","publisherId":"106052","publisherName":"Alice Packard","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1483514688/614a03be-7491-4e6d-85d4-01072cf9c31a-cover.png","description":"<p>Before variants, the only way we could organize Figma components was using forward slashes or frames to group and nest them together. This was fine, but it wasn't great. It forced us into very rigid folder systems.</p><p>Folks often asked, \"what's the best way to order of the groups?\"&nbsp;<a href=\"https://help.figma.com/hc/article_attachments/360089569814/Component_order_using_slash_naming_convention.png\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Figma's documentation</a>&nbsp;has an example with the following hierarchy: , but does it make a difference to order it in that particular way? What if it was flipped? To me, the slash naming was absolutely necessary and helpful for organizing components, but hard to work with. Of all the combinations I tried, I was never happy with the group orders I came up with. Some were too convoluted, others were too loose. Finding that happy medium seemed impossible.</p><p><br></p><p>Then Figma introduced their variants feature in&nbsp;<a href=\"https://www.figma.com/blog/bridging-design-and-code-with-variants/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">late October of 2020</a>. Not only was it a game changer for the experience of modifying instances in mockups and prototypes, it also gave us a new, powerful way to organize components: variants let us&nbsp;<em>flatten</em>&nbsp;the structures that slash naming forced us into. Variants allow all a component's, well, variations, to be accessed in&nbsp;<em>any</em>&nbsp;order. You don't have to drill through a half dozen groups just to turn on dark mode!</p><p><br></p><p>But variants haven't made slash naming obsolete. Nor were they meant to! You can still use both to organize your components. But now that we have these two ways to organize and group components... when do you organize components using variants, and when do you use frames or slash naming? Are certain components better suited for slash naming than variants? When do you reach for one method over the other? Are there circumstances where slash naming still has an edge over variants?</p><p><br></p><p><a href=\"https://www.alicepackarddesign.com/journal-entries/when-you-should-use-variants-vs-creating-separate-components\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"><strong>Read the rest of this journal entry</strong></a></p>","url":"https://www.figma.com/community/file/1067171178880468621"}
