{"id":"995047526922212564","name":"Pt Tunas Sawa Erma Papua","lastUpdateDate":"2021-07-08T19:23:37.647Z","publisherHandle":"tunassawaerma","publisherImage":"https://s3-alpha.figma.com/profile/3e26aca0-007b-46c0-a221-f876cd077f0d","publisherId":"995037103792933878","publisherName":"Tunas Sawa Erma Group","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/968382247/f16772ba-469c-4f18-bab4-80f25e327e77-cover.png","description":"<p><strong>Tunas Sawa Erma Group</strong> merupakan perusahaan berbadan hukum di Indonesia yang bergerak di bidang usaha perkebunan dan pengolahan minyak kelapa sawit dengan dengan kantor pusat di Papua. Tunas Sawa Erma Group terdiri berasal dari PT. Tunas Sawa Erma, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa yang semuanya bergerak dalam bidang budidaya kelapa sawit dan memproduksi minyak sawit mentah (Crude Palm Oil/CPO) dan juga berlokasi di Papua. Sejak th. 1995, Tunas Sawa Erma Group mengawali usaha kelapa sawit di Papua atas keinginan Pemerintah Daerah. Kondisi infrastruktur selagi itu tetap minim, tapi Tunas Sawa Erma Group bisa berkembang baik dan juga menjadi pihak pertama yang berkontribusi dalam pembangunan jalan Trans-Papua.</p><p><br></p><p>Sesuai dengan dengan visi dan misi untuk menjadi perusahaan global, Tunas Sawa Erma Group memiliki komitmen pada kebijakan “Nol Deforestasi, Nol Pembangunan di Lahan Gambut, dan Nol Eksploitasi (NDPE)” yang telah terjadi dan tertuang secara mengetahui di situs resmi perusahaan. Areal konsesi kita tidak berlokasi di lahan gambut. Selain itu, TSE Group juga menciptakan proses dan lingkungan kerja yang mendukung pengembangan sumber kekuatan manusia lewat program seleksi dan pelatihan dan juga pembangunan berkelanjutan. Saat ini perusahaan juga telah memiliki tim Sustainability.</p><p><br></p><p>Kami juga mengapresiasi kontribusi para karyawan yang tetap berkembang dengan dengan perusahaan. Atas dedikasinya, Tunas Sawa Erma Group telah mempromosikan 70% berasal dari karyawan menjadi karyawan tetap. Kemajuan wanita juga menjadi bagian berasal dari perhatian kami. Sebanyak 20% berasal dari keseluruhan karyawan adalah perempuan dan kita tetap mendukung untuk mencapai potensi paling baik mereka.​</p><p><br></p><p>Tak hanya itu, Tunas Sawa Erma Group Sebagai perusahaan juga tetap memelihara interaksi yang cocok dan saling membangun dengan dengan Pemerintah Daerah maupun masyarakat setempat, dan juga tetap aktif dalam kesibukan pengembangan ekonomi dan kesejahteraan masyarakat Papua.</p><p><br></p><p>Terdapat 4 pabrik pengolahan kelapa sawit yang telah beroperasi yaitu milik PT. Tunas Sawa Erma Blok A, PT. Tunas Sawa Erma Blok B, PT. Berkat Cipta Abadi, dan PT. Dongin Prabhawa.&nbsp;</p>","url":"https://www.figma.com/community/file/995047526922212564"}
