{"id":"870775950215228481","name":"Platform Workers Design Toolkit","lastUpdateDate":"2020-07-30T21:12:44.850Z","publisherHandle":"NCResq","publisherImage":"https://s3-alpha.figma.com/profile/0a951dc6-094a-4a70-8d4c-de2a7c188acd","publisherId":"863615","publisherName":"Chandra Ramanujan","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/406909290/08008fe1-0425-4dbd-8526-fa3da95d846f-cover","description":"<p>This was created as part of my M.Des final Capstone project at Srishti Institute of Art, Design and Technology, Bengaluru, India.</p><p><br></p><p>The Gig economy accounts for an increasing proportion of the labour force in India. The way in which gig workers interact with computers has been fundamentally changed due to their work on these platforms. Many products and services have arisen to serve their needs as they represent a new category of computer user. However, these fall short due to various reasons.</p><p><br></p><p>As the number of such workers will only rise in the future it is important to develop digital products and services for them that actually help them meet their needs.</p><p><br></p><p>In this Capstone project, I have developed a&nbsp;toolkit, derived from all my experiences, primary and secondary research. It’s goal is to help people think about what products for gig workers can look like, and come up with and evaluate their ideas.&nbsp;</p><p><br></p><p>It includes a series of prompts, activities and questions for participants to direct their thinking.</p><p><br></p><p>This toolkit exists as a digital file on Figma Community in order to allow such sessions to be facilitated remotely.</p><p><br></p><p>Important Note - all icons are licensed under Creative Commons license from:</p><p><br></p><p>Google Material Design library</p><p><br></p><p>Creators whose Icons are licensed from Noun Project:</p><p>Roleplay,Eucalyp, Adrien Coquet, Eucalpytus, Vectors Point, <a href=\"http://Fevzi.co\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Fevzi.co</a>, Ian Rahmadi Kurniawan, Yeoul Kwon, Scott DesmondI Putu Kharismayadi, Richard Schumann, Nithinan Tatah. MRK, Gonza</p><p><br></p><p>Rflor, Blair Adams, sandiindra, akash k, Gregor Cresnar, Alice Design Hai Studio</p>","url":"https://www.figma.com/community/file/870775950215228481"}
