{"id":"1114258486421958930","name":"MLIN - Crypto Fintech UI Kit - Light and Dark Mode","lastUpdateDate":"2022-06-02T18:26:17.875Z","publisherHandle":"sanel","publisherImage":"https://s3-alpha.figma.com/profile/408c9c86-1ce3-4482-acd1-ba2feb6bc7da","publisherId":"17872","publisherName":"Sanel Selimovic","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1943148587/dccbe678-6648-41d9-a240-4b4f46f275aa-cover.png","description":"<p><strong>MLIN Crypto Fintech UI Kit</strong> is a free and easy to use Figma library. This mobile UI library provides plenty of UI components to help you brainstorm your fintech app, and I will improve the components experience consistently.</p><p><br></p><p>The UI kit is an outcome of years of working in the fintech and crypto space and deep understanding of business needs and onboarding flows.&nbsp;</p><p><br></p><p>---</p><p>Finding this helpful? You can support me and help make it better!</p><p><a href=\"https://www.buymeacoffee.com/sanel\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Buy Me a Coffee</a><strong> </strong>☕️</p><p>---</p><p><br></p><p>MLIN is a Premium &amp; High Quality UI Kit for a crypto fintech application, based on years of experience working in fintech and crypto space. MLIN comes with components and variants which allow you to edit and customize all elements with design components which can speed up design process for your projects.</p><p><br></p><p>MLIN - Crypto Fintech UI Kit works for both iOS/Android and each element is 100% editable &amp; customizable. Designs are available in Figma. In addition, the design is also equipped with a version of Light &amp; Dark Theme.</p><p><br></p><p>MLIN is designed in a trendy and modern way, with all layers well organized.&nbsp;</p><p><br></p><p>In addition, the application design in Figma has been designed with fully auto layout, so it is very adaptive if you want to edit, delete, or add some parts. If you are not familiar with auto layout, you can turn it off by right-clicking the layer, and selecting remove auto layout.</p>","url":"https://www.figma.com/community/file/1114258486421958930"}
