{"id":"996635986310402607","name":"SFMC Journey Builder","lastUpdateDate":"2021-07-13T04:35:35.857Z","publisherHandle":"mktrangers","publisherImage":"https://www.gravatar.com/avatar/b84074f59f6f77601612b0ef06808050?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_r_v2.png","publisherId":"1506125","publisherName":"Rodrigo Santander","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/975750960/19d66fd7-bc78-4d96-984e-a6d6f83dc440-cover.png","description":"<p>[english]</p><p>Use this file to create mockups of your Journeys from Salesforce Marketing Cloud Journey Builder.</p><p><br></p><p>I've been working with JB for a while and it's been hard to produce email flows for my clients, and I couldn't find anything similar on the web, so decided to step in and do it myself. It includes almost all the activities present in SFMC JB as of today. </p><p><br></p><p>You can break the connectors to edit the nodes and make more complex connections between elements.</p><p><br></p><p>I don't own the credits, nor did I do the illustrations, all the copyrights from: © Copyright 2000-2017 salesforce.com, inc.</p><p><br></p><p>If you like it, consider saying hi in twitter at <a href=\"https://twitter.com/Ro_Santander\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">@Ro_Santander</a></p><p><br></p><p>-----------</p><p>[español]</p><p><br></p><p>Usa este archivo para crear mockups de tus Journeys de Salesforce Marketing Cloud Journey Builder.</p><p><br></p><p>He estado trabajando un buen rato con JB y ha sido dificil crear los flujos de email para mis clientes. Tampoco tuve suerte buscando en línea por una solución, así que decidí hacerla yo misma. Incluye casi todas las actividades de SFMC JB al día de hoy.</p><p><br></p><p>Puedes romper los assets de los conectores para editar los nodos y hacer conexiones más complejas entre elementos.</p><p><br></p><p>No poseo los créditos, ni hice las ilustraciones, todos los copyrights son de: © Copyright 2000-2017 salesforce.com, inc.</p><p><br></p><p>Si te gusta y te es útil, considera dejarme un mensajito de twitter en <a href=\"https://twitter.com/Ro_Santander\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">@Ro_Santander</a></p>","url":"https://www.figma.com/community/file/996635986310402607"}
