{"id":"734628505008435795","name":"Bullets","lastUpdateDate":"2020-05-03T01:05:23.696Z","publisherHandle":"mirkosantangelo","publisherImage":"https://s3-alpha.figma.com/profile/2bcfa2d6-53a7-4ffd-b687-7b1570e203b3","publisherId":"206939","publisherName":"Mirko Santangelo","description":"<p>Create custom bulleted lists using components and save reusable bullet styles on your file.</p><p><br></p><p>NOTE: <strong>The plugin doesn't support the native Figma bullet styles.</strong> The intended behavior is to create a single instance layer for each list item.</p><p><br></p><p>—————</p><p><br></p><h2><strong>☞ HOW TO CREATE A BULLET STYLE</strong></h2><p><br></p><p>1. Create a Figma component with your preferred design for the bullet. Make sure to set Scale as constrain on the all component's children; The bullets instances on the list will inherit the size of this component, you may want to adjust its dimension according to your scenario.</p><p><br></p><p>2. Select the bullet component and click the plus icon on the plugin panel to save it as bullet style;</p><p><br></p><p>—————</p><p><br></p><h2><strong>☞ HOW TO APPLY A BULLET STYLE</strong></h2><p><br></p><p>1. Select at least one or more layers;</p><p><br></p><p>2. Click one of the bullet styles available to add one bullet instance for each selected layer on the canvas. The plugin will organize your layers into a list using Figma Auto-Layout.</p><p><br></p><p>—————</p><p><br></p><h2><strong>☞ HOW TO APPLY CHANGES TO THE BULLETS</strong></h2><p><br></p><p>1. Select the bullets instance layers via the new quick-select feature or manually.</p><p><br></p><p>2(A) - You can swap bullets by clicking on a different bullet style via on the plugin.</p><p><br></p><p>2(B) - You can change size of the bullets or the auto-layout spacing and alignment via the built-in Figma interface.</p><p><br></p><p>❧</p>","url":"https://www.figma.com/community/plugin/734628505008435795","iconUrl":"https://www.figma.com/community/plugin/734628505008435795/icon","thumbnailUrl":"https://www.figma.com/community/plugin/734628505008435795/thumbnail"}
