{"id":"811313138255168556","name":"blokdots","lastUpdateDate":"2022-05-01T21:03:33.736Z","publisherHandle":"blokdots","publisherImage":"https://s3-alpha.figma.com/profile/f56a5302-be5f-449d-a15e-230e927fd2f9","publisherId":"130","publisherName":"blokdots","description":"<p>blokdots is a simple to use software to build interactive hardware prototypes without a line of code.</p><p><br></p><p>With this plugin you can connect Figma to the blokdots app (--&gt; download at <a href=\"http://blokdots.com\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">blokdots.com</a>), making it possible to use hardware components like sensors and buttons to control and manipulate elements right in Figma. This means it is now possible to bridge the gap between hardware and UI prototypes!</p><p><br></p><p>— What you can do</p><p>You can use hardware components to set the text, color, size, rotation or position of Figma layers and map the values of your sensors to the color, size, rotation or position of a layer.</p><p><br></p><p>— How to use the Plugin</p><p>While the blokdots app is running, run the plugin and select the layer you want to be able to manipulate with your hardware prototype. Then press the “Expose to blokdots” button.</p><p><br></p><p>[Make sure to enable the Figma integration in blokdots – Go to settings and toggle “Figma Integration” on. It’s located under “Experimental Features”.]</p><p><br></p><p>You can now select “Figma” as a component in any card in blokdots, select one of the layers you exposed and define how it should respond.</p><p><br></p><p>When you run your project in blokdots, make sure the blokdots plugin in Figma is running as well. blokdots and Figma will connect automatically and you can now manipulate Figma layers right from your hardware prototype!</p><p><br></p><p>— Requirements</p><p>To use this plugin you need to …</p><p>• have the latest version of the blokdots app installed and running --&gt; download at <a href=\"http://blokdots.com\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">blokdots.com</a></p><p>• have an Arduino microcontroller set up</p><p>• use the Figma Desktop version</p>","url":"https://www.figma.com/community/plugin/811313138255168556","iconUrl":"https://www.figma.com/community/plugin/811313138255168556/icon","thumbnailUrl":"https://www.figma.com/community/plugin/811313138255168556/thumbnail"}
