{"id":"1031998871372194709","name":"Rendition [Beta]: Figma->React Components in one click","lastUpdateDate":"2022-03-23T02:02:26.105Z","publisherHandle":"robertnowell","publisherImage":"https://www.gravatar.com/avatar/8f78379898ee944b51bbb3eacfff8e3e?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_r_v2.png","publisherId":"874774465455437362","publisherName":"Robert Nowell","description":"<p>Meet your newest teammate. Rendition looks at your Figma design and writes responsive React code for you - at the click of a button. Yes, it’s that easy. And it works!</p><p><br></p><p>Technical details:</p><ol><li>Built for developers</li><li>React only for now</li><li>Styled components for CSS</li><li>Best for designs made with Figma's autolayout</li></ol><p><br></p><p>Watch this video to see Rendition in action: https://youtu.be/3WucRJ7B6h0</p><p><br></p><p>Join our discord if you have questions: https://discord.com/invite/ZpaYuRTHkt</p><p><br></p><p>Here are 3 things that make Rendition wonderful to work with:</p><ul><li>It’s as simple and fast. Click a button and get React code.</li><li>It’s as flexible as can be. Get code from a small component design or even a whole page design.</li><li>It’s good at giving you high-quality, modern React code. You want code that you would actually feel comfortable shipping yourself, so our bar is high.</li></ul><p><br></p><p>How does this work? Here’s how (it’s easy):</p><p><br></p><ol><li>When your Figma design is ready, launch the Rendition plugin.</li><li>Pick the element you want as a React component.&nbsp;</li><li>Press Get Code.</li><li>Witness Rendition do its thing. You’ll be taken to a code sandbox with your new React code.</li><li>Review the code and mess around with it as you please.</li><li>When you’re happy, copy and paste the code wherever you want. It’s yours.</li></ol><p><br></p><p>What does this cost to use?</p><p><br></p><p>We think you’ll like rendition so much that it’s completely free to use for the first couple of times. After that, you can unlock unlimited access for just a few bucks per month. This way, we can continue to make the Rendition better and better - which makes life easier and easier for you.</p><p><br></p><p>Also, we want you to get the most out of Rendition. This was created by designers and developers, for designers and developers. If you have any questions or feedback, please reach out to us on discord: https://discord.com/invite/ZpaYuRTHkt</p><p><br></p><p>We’re here for you!</p><p><br></p><p>- Team Rendition</p>","url":"https://www.figma.com/community/plugin/1031998871372194709","iconUrl":"https://www.figma.com/community/plugin/1031998871372194709/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1031998871372194709/thumbnail"}
