{"id":"896968134106172180","name":"Slide Show","lastUpdateDate":"2021-11-07T03:24:39.557Z","publisherHandle":"ntfromchicago","publisherImage":"https://s3-alpha.figma.com/profile/6f3d5649-5fe3-45a3-be95-a168540d187e","publisherId":"1232151","publisherName":"Nelson Taruc","description":"<p>Slide Show is a simple yet powerful utility that lets you turn any page of unlinked frames into a slide show presentation that <strong>you control</strong> while others watch in real time.</p><p><br></p><p>It's easy:</p><p><br></p><ol><li>Rename your frames in alphabetical order (numbers appear before letters).</li><li>Turn off visibility for frames you don't want to show.</li><li>Share your prototype link or embed to viewers.</li><li>Start the Slide Show plugin and be amazed!</li></ol><p><br></p><p>Navigate from frame to frame, or restart your slide show. (To start from a specific frame, select it before running the plugin.)</p><p><br></p><p>Keynote Live and PowerPoint Present Live are neat, but Figma's now a viable alternative, thanks to this plugin.</p><p><br></p><ul><li>Ditch screen shares and present crisp graphics!</li><li>Embed your slide show anywhere!</li><li>Multiple frame sizes? Easy peasy!</li><li>Forget complex transitions. Less is more!</li><li>Live editing of slides? Yes!</li></ul><p><br></p><p>For best results, use a Figma prototype link (or embed) with these parameters: <em>scaling=contain</em> and <em>hide-ui=1</em>. This ensures viewers see content at the largest size possible with minimum distraction.</p><p><br></p><p><strong>Important:</strong> When using Slide Show, you <em>must</em> remove all Flow starting points on your page. However, you CAN keep existing prototype interactions in place! This is brand new to Figma and amazing!</p><p><br></p><p><strong>Tip:</strong> For presenter notes or other content that's not viewable by readers, simply place them on the background canvas. Just make sure it's <em>not</em> in a frame.</p><p><br></p><p>While anyone can use this plugin, it was built especially for <a href=\"https://lexgo.work\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">LexGo</a> to easily control guided presentations designed in Figma.</p><p><br></p><p><strong>NEW FEATURES!</strong></p><p>Jump to Slide: Navigate to any slide quickly!</p><p><br></p><p>Random Slide: Great for quizzes and flash cards!</p><p><br></p><p>Hide Slide: Great for running through a presentation and hiding unwanted slides quickly.</p>","url":"https://www.figma.com/community/plugin/896968134106172180","iconUrl":"https://www.figma.com/community/plugin/896968134106172180/icon","thumbnailUrl":"https://www.figma.com/community/plugin/896968134106172180/thumbnail"}
