{"id":"750783568176946334","name":"Super Select","lastUpdateDate":"2019-10-02T23:32:39.054Z","publisherHandle":"alexpineda","publisherImage":"https://www.gravatar.com/avatar/01eaf6749633ac04aa16dc9c2cc6a72b?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_a_v2.png","publisherId":"1614779","publisherName":"Alex Pineda","description":"Latest Version Changes:\n- Select All Siblings and Invert Siblings support multiple layer selections (different groups)\n\nSUPER SELECT: Multi-commands for layer selection!\n\n*Select Parent*\nWill deselect the selected layer and select its parent layer.\n\n*Select Children*\nWill deselect the selected layer and select all of its children.\n\n*Select Intersecting*\nWill select any layers intersecting with the current selected layer.\n\n*Select Contained*\nWill select any layers contained within the box of the current selected layer. Best used for rectangle backgrounds when desiring to selected visually contained layers as well.\n\nSibling Commands. These commands do not transcend the parent layer.\n\n*Select All Siblings*\nSelects all siblings layers. Note: This does not select the parent layer.\n\n*Select Horizontal Siblings*\nSelects any siblings to the visual right and left of the currently selected layer. Note: this does not transcend the parent layer.\n\n*Select Vertical Siblings*\nSelects any siblings to the visual top and bottom of the currently selected layer. Note: this does not transcend the parent layer.\n\n*Select Inverse Siblings*\nInverts the layer selection. Note: this does not transcend the parent layer.\n\n*Select Intersecting Siblings*\nWill select any layers intersecting with the current selected layer. Note: this does not transcend the parent layer.\n\n*Select Contained Siblings*\nWill select any layers contained within the box of the current selected layer. Best used for rectangle backgrounds when desiring to selected visually contained layers as well. Note: this does not transcend the parent layer.\n\n*REQUESTS / BUG REPORTS*\nEmail support or issue on github https://github.com/alexpineda/figma-super-select\n\n*ROADMAP*\nNot a lot planned. Investigating \"Sibling - Select Similar\" and see if there can be a usable approach to select similar layers.\nAlso curious about an options panel to toggle sibling constraint, as well as append to existing selection mode.","url":"https://www.figma.com/community/plugin/750783568176946334","iconUrl":"https://www.figma.com/community/plugin/750783568176946334/icon","thumbnailUrl":"https://www.figma.com/community/plugin/750783568176946334/thumbnail"}
