{"id":"843461159747178978","name":"Figma Tokens","lastUpdateDate":"2021-10-21T08:51:38.851Z","publisherHandle":"jsx","publisherImage":"https://s3-alpha.figma.com/profile/ad4129e5-e791-4a58-9898-d3352342665e","publisherId":"389","publisherName":"Jan Six","description":"<p>Gives you the ability to use Design Tokens that can be used for a whole range of design options, from border radii or spacer units to semantic color and typography styles that are able to reference other tokens. It allows you to change tokens and see these changes applied to the whole document, its styles or just a selection.</p><p><br></p><p>Generate Tokens with our Token builder or with your own JSON file. Create or update Type or Color Styles based on tokens. Reference tokens in each other to create type scales, container paddings or semantic colors.</p><p><br></p><p><strong>Supported Tokens</strong></p><ul><li>Colors (Fill, Border Color — hex, rgba, hsla)</li><li>Spacing (Horizontal, Vertical, Gap)</li><li>Sizing (Width/Height)</li><li>Border Radius (individually or each corner)</li><li>Border Width</li><li>Opacity</li><li>Typography (Font family, font weight, font size, line height, letter spacing, paragraph spacing)</li></ul><p><br></p><p>All tokens support references to one another, so for example if you want to alias <code>primary</code> to <code>colors.blue</code> then you'd write <code>$colors.blue</code></p><p><br></p><p>Also, you can create math equations in tokens, allowing you to write a type scale like this: <code>$fontSizeBase * 1.618</code> and so on.</p><p><br></p><p>Find out more about Tokens, including some videos about how to use Tokens: <a href=\"https://jansix.at/resources/figma-tokens?ref=figma-tokens\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">jansix.at/resources/figma-tokens</a></p><p><br></p><h2>Usage guide</h2><p>Left-click on a token to apply it to one or more layers.</p><p>Right-click a token to apply it to a specific property (such as only to Horizontal Spacing) - also you can delete or edit tokens by right-clicking them.</p><p><br></p><h2>Import your styles</h2><p>Best way to get started is to just Import your existing styles as Tokens. Hit the \"Import Styles\" button on the top right.</p><p><br></p><h2>Coming soon:</h2><p>- Sync your tokens to an external JSON - allowing you to use one Tokens source throughout all your files - used by your whole team</p><p>- Create a visual representation of your tokens with the click of a button</p><p>- Export Tokens to various formats (SCSS, YML, JSON, etc)</p><p><br></p><p>This plugin is a collaboration between Jan Six and Abdul Wahid. It's open source! Feel free to contribute, create suggestions at <a href=\"https://github.com/six7/figma-tokens\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://github.com/six7/figma-tokens</a></p><p><br></p><p>More information at <a href=\"https://www.jansix.at/resources/figma-tokens?ref=figma-tokens\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">jansix.at</a></p>","url":"https://www.figma.com/community/plugin/843461159747178978","iconUrl":"https://www.figma.com/community/plugin/843461159747178978/icon","thumbnailUrl":"https://www.figma.com/community/plugin/843461159747178978/thumbnail"}
