{"id":"931981941865472305","name":"Checklist Creator","lastUpdateDate":"2021-01-17T13:50:05.064Z","publisherHandle":"EPICAgency","publisherImage":"https://s3-alpha.figma.com/profile/fac67472-3a6f-4679-aafb-ea29157cecdc","publisherId":"932638105834190633","publisherName":"EPIC Agency","description":"<p>Easily create elegant checklists to keep track of your design progress.</p><p><br></p><h2><strong>What it does</strong></h2><p>The plugin creates a frame with your tasks and checkpoints organised in a table. It also creates status labels (Todo, in progress, awaiting feedback, done, n-a) as variants of a status component.</p><p><br></p><h2>How to create a checklist</h2><p><strong>Tasks</strong></p><p>Insert the tasks or pages you need to design separated by commas (Ex: Homepage, About, Contact). You may also use \"/\" to add a separator line between different groups of tasks. (Ex: Navigation, Footer, / , Homepage, About).</p><p><br></p><p><strong>Checkpoints</strong></p><p>Insert the deliverables needed for your tasks separated by commas (Ex: Wireframes, Mobile design, Desktop design).</p><p><br></p><h2>How to use it</h2><p>While designing, easily update the status labels in Figma ui. Select a label in the table and modify its status in the component properties (right panel).</p><p><br></p><h2>Reorganise the checklist and labels</h2><p>Tasks list is a vertical auto layout frame. That makes it very easy to reorder, remove or add new tasks.</p><p><br></p><p>Separation lines can also be duplicated and moved vertically to organise tasks in groups.</p><p><br></p><p>(Hint : use top and bottom keys to reorder tasks rows and separation lines).</p><p><br></p><p>The labels are variants of a component. That makes it possible to add new ones or modify those automatically generated by the plug in.</p><p><br></p><h2>Developed by</h2><p><a href=\"https://twitter.com/yakudoo\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Karim Maaloul </a>creative director at <a href=\"https://epic.net\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">EPIC Agency</a></p>","url":"https://www.figma.com/community/plugin/931981941865472305","iconUrl":"https://www.figma.com/community/plugin/931981941865472305/icon","thumbnailUrl":"https://www.figma.com/community/plugin/931981941865472305/thumbnail"}
