{"id":"843888808931861032","name":"Style Guide Generator","lastUpdateDate":"2020-05-17T16:33:59.885Z","publisherHandle":"629a068b_e98a_4","publisherImage":null,"publisherId":"989","publisherName":"Nomad Interactive","description":"Generate your custom style guides from Figma styles easily.\n\nThis plugin automatically scan your Figma document's text styles, paint/color styles and generate a new page in your document containing your style guide template and the actual rendered style guide that is ready to export as PDF or your favorite format to share with your team or your client. You can re-run the plugin to update your generated style guide frame with dynamically including new styles you are adding or updating.\n\nSee example generated style guide frame and templates here: https://bit.ly/3dY1R2R\n\nCustomization\n\nYou can select basic styleguide templates to start with and customize your style guide template to fit your project's or team's design language. You can also include your own static elements in your template frame as long as preserving the auto layout groups containing your text styles and your color styles. Plugin will simply clone your template frame and populate the text styles and color styles using the template groups you provided. You can customize positioning, look and feel or add new elements like iconography for your stlye descriptor labels or values.\n\nHow It Works\n\n- Create a new page in your document and name it \"Style Guide\"\n- Copy one of the style guide templates and customize to add your own flavor from here: https://bit.ly/3dY1R2R\n- Run the plugin, your style guide frame will be generated and will be ready to use (export)\n- You can re-run the plugin to refresh your style guide any time you want\n\nFeedback & Support\n\nWe welcome feedback, new feature requests and will do our best to help of you have any issues with the plugin. Just shoot an email address to hello@nomadinteractive.co","url":"https://www.figma.com/community/plugin/843888808931861032","iconUrl":"https://www.figma.com/community/plugin/843888808931861032/icon","thumbnailUrl":"https://www.figma.com/community/plugin/843888808931861032/thumbnail"}
