{"id":"809630939774224537","name":"Spotify UI - Live Streaming","lastUpdateDate":"2021-08-15T03:05:35.667Z","publisherHandle":"MattWalker","publisherImage":"https://s3-alpha.figma.com/profile/640765cc-dcb1-45e0-adfb-0ad94a5ea93c","publisherId":"78278","publisherName":"Matt Walker","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1053045748/89c01ddd-e309-41c6-a908-a57aa8164a42-cover.png","description":"<p>Work in progress concept for live-streaming feature inside Spotify.</p><p><br></p><p><strong>Features including:</strong></p><p>– Streaming \"radio\"</p><p>– Sharing stream</p><p>– Queueing music</p><p>– Stream stats</p><p>– Audience Chat</p><p><br></p><h2><strong>Feb 13, 2021 Update</strong></h2><p>– Getting components updated with auto-layout and variants. It's been awhile since I updated this file apparently. D:</p><p>– Came up with a new streaming panel now feat. Madi Diaz.</p><p>– The audio visualizer takes a backseat being the currently playing track. it felt too forced to try to make it a <em>thing</em> in the forefront.</p><p>– A \"live\" badge that I'll explore animating in when you hit \"start stream\"</p><p><br></p><p><br></p><h2><strong>August 14, 2021 Update</strong></h2><p>• Updated most components to reflect Spotify's most up to date UI changes as of August 14th.</p><p>• Various changes to color, spacing, new states defined.</p><p>• Still need to clean up some things and explore more ideas now that the Greenroom app is released as well.</p><p><br></p><p><br></p><p><br></p><h2><strong>Next Up</strong></h2><p>– Explore chat and profile interaction in the chat. Reporting abuse, kicking someone from audience as host.</p><p>– How do you find someone else's stream? How does this become social where you see streams and hop into some and explore?</p><p>– Empty State for queue</p><p>– Onboarding on to streaming</p><p>– Accessing the stream in the first place, and from where</p><p>– What should a streamers 'end of stream' experience look like? Recap of how the stream performed? # of listeners? # of reactions? Can streams be monetized if it's original music?</p><p>– How do podcasts play a role in this? Could you connect to a mic?</p>","url":"https://www.figma.com/community/file/809630939774224537"}
