{"id":"1049477946127252395","name":"Color Kitchen","lastUpdateDate":"2022-01-26T13:14:11.574Z","publisherHandle":"richy","publisherImage":"https://s3-alpha.figma.com/profile/08f74326-3dfc-470c-963d-31c55c8a1a9b","publisherId":"64","publisherName":"Richard Bruskowski","description":"<p>Create recipes for working with colors and color styles systematically, directly on the canvas where you can see what's happening.</p><p><br></p><p><a href=\"https://www.figma.com/community/file/1050566100341643748/Color-Kitchen-Demo\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Demo file</a></p><p><br></p><h2>How to</h2><ol><li>Run <strong>Create components</strong> to create a page with components needed for the Color Kitchen plugin</li><li>Place instances of the <em>Color Kitchen Recipe</em> component on your canvas.</li><li>Select a color or a color style as source by applying it to the first ⚪️ <em>Swatch Layer</em> on the left side.</li><li>Change the ⚙️ <em>Modifier</em> components and the modifiers 🎚 <em>Value</em> as you please. You can also detach the recipe to be able to move things around more freely within the recipe. Add as many ⚙️ <em>Modifiers</em> and ⚙️<em>Color Swatches</em> as you want.</li><li>Select one or more recipes and <strong>Run recipes</strong> to see the modifiers changing all the color swatches on their right. Or run all recipes on the page by not selecting anything before running the command.</li><li>If you want to link two or more styles create or apply existing styles to one or more ⚪️ <em>Swatch Layers</em> on the right side.</li></ol><p><br></p><h2>Additional features</h2><ul><li>Add ⚙️<em>Print</em> instances to the recipe to see color values, contrast ratios, style names or descriptions printed on the canvas.</li><li>Change the variant properties of ⚙️<em>Color Swatch</em> layers to override specific color values in styles with multiple fills, effects and gradients. You need to specify which of the effects, fills or color stops in a gradient you want to override by providing the coordinates as a number. 0 is the first fill/effect. In the case of gradients you need to provide two numbers, the number of the fill and the number of the color stop, like that: 0:1</li></ul><p><br></p><h2>Use cases</h2><ul><li>Variation: Link multiple styles with varying opacity or luminance to one main style.</li><li>Inheritance: I.e. link colors in shadows or gradients to your main color styles.</li><li>Exploration: Try different treatments and color models to create palettes.</li><li>Documentation &amp; Collaboration: Make color choices traceable and reproducible.</li><li>Theming: Make all colors dependent on a few accent colors.</li></ul><p><br></p><h2>Available color transformations</h2><ul><li>Brighten/darken</li><li>Saturate/desaturate</li><li>Channels: Set or modify a value of a single channel (i.e. red or hue or lightness)</li><li>Opacity: Set or add to/subtract from opacity</li><li>Luminance: Set to make contrasts work</li><li>Mix two colors</li><li>Blend two colors using different blend modes</li><li>Contrast Minimum: Darken or brighten, until the given contrast ratio in relation to a given second color is met. (Ignores opacity)</li></ul><p><br></p><h2>Sources</h2><ul><li>Most color functions are using <a href=\"https://gka.github.io/chroma.js/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">chroma-js</a>, check the docs for more information.</li><li>Built with <a href=\"https://yuanqing.github.io/create-figma-plugin/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Create Figma Plugin</a> by Yuan Qing Lim</li><li><a href=\"https://www.figma.com/community/plugin/933372797518031971/Node-Decoder\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Node Decoder</a> by Gavin Mc Farland was a huge help</li></ul><p><br></p><h2>Roadmap</h2><ul><li>Modifiers to work with additional useful color models like <a href=\"https://www.hsluv.org/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">HSLuv</a> or <a href=\"https://github.com/material-foundation/material-color-utilities\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Material Designs' HCT</a></li><li>Generate new styles in addition to syncing existing ones</li><li>Cooking with noodles: Use prototyping links or maybe FigJam's connectors to connect color swatches</li><li><s>Additional guidance within the component descriptions.</s></li><li><s>More comfortable ways to use a color for multiple shadows</s></li><li><s>Add demo file</s></li><li><s>Modifiers that ensure a certain contrast threshold minimum against a selected background color.</s></li><li><s>Add label elements that print color values and style names to the canvas for readability</s></li></ul>","url":"https://www.figma.com/community/plugin/1049477946127252395","iconUrl":"https://www.figma.com/community/plugin/1049477946127252395/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1049477946127252395/thumbnail"}
