{"id":"1049477946127252395","name":"Color Kitchen","lastUpdateDate":"2021-12-06T00:52:05.847Z","publisherHandle":"richy","publisherImage":"https://s3-alpha.figma.com/profile/08f74326-3dfc-470c-963d-31c55c8a1a9b","publisherId":"64","publisherName":"Richard Bruskowski","description":"<p>With Color Kitchen you can create recipes for working with colors and color styles systematically, directly on the canvas where you can see what's happening.</p><p><br></p><h2>How to</h2><ol><li>Run <strong><em>Create components</em></strong> to create a page with components needed for the Color Kitchen plugin</li><li>Place instances of the Color Kitchen Recipe component on your canvas.</li><li>Select a color or a color style as source by applying it to the first color swatch on the left side.</li><li>Change the modifiers and the modifier values as you please. You can also detach the recipe to be able to move things around more freely within the recipe. Add as many modifiers and targets as you want.</li><li>Select the recipe (or multiple recipes) and run <strong><em>Run selected recipes</em></strong> to see the modifiers changing all the color swatches on their right.</li><li>If you want to link two styles select a target style for the swatch on the right side.</li></ol><p><br></p><h2>Advanced usage</h2><ul><li>Change the variant properties of target swatches to override specific color values in styles with multiple fills, effects and gradients. You need to specify which of the effects, fills or color stops in a gradient you want to override by providing the coordinates as a number. 0 is the first fill/effect. In the case of gradients you need to provide two numbers, the number of the fill and the number of the color stop, like that: 0:1</li></ul><p><br></p><h2>Use cases</h2><ul><li>Variation: Link multiple styles with varying opacity or luminance to one main style.</li><li>Inheritance: I.e. link colors in shadows or gradients to your main color styles.</li><li>Exploration: Try different treatments and color models to create palettes.</li><li>Documentation &amp; Collaboration: Make color choices traceable and reproducible.</li><li>Theming: Make all colors dependent on a few accent colors.</li></ul><p><br></p><h2>Available color transformations</h2><ul><li>Brighten/darken</li><li>Saturate/desaturate</li><li>Channels: Set or modify a value of a single channel (i.e. red or hue or lightness)</li><li>Opacity: Set or add to/subtract from opacity</li><li>Luminance: Set to make contrasts work</li><li>Mix two colors</li></ul><p><br></p><h2>Sources</h2><ul><li>Most color functions are using <a href=\"https://gka.github.io/chroma.js/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">chroma-js</a>, check the docs for more information.</li><li>Built with <a href=\"https://yuanqing.github.io/create-figma-plugin/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Create Figma Plugin</a> by Yuan Qing Lim</li><li><a href=\"https://www.figma.com/community/plugin/933372797518031971/Node-Decoder\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Node Decoder</a> by Gavin Mc Farland was a huge help</li></ul><p><br></p><h2>Roadmap</h2><ul><li>Add demo file</li><li>Additional guidance within the component descriptions.</li><li>Modifiers that ensure a certain contrast threshold minimum against a selected background color.</li><li>Modifiers to work with additional useful color models like <a href=\"https://www.hsluv.org/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">HSLuv</a> or <a href=\"https://github.com/material-foundation/material-color-utilities\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Material Designs' HCT</a></li><li>More comfortable ways to use a color for multiple shadows</li><li>Add label elements that print color values and style names to the canvas for readability</li><li>Generate new styles in addition to syncing existing ones</li><li>Cooking with noodles: Use prototyping links or maybe FigJam's connectors to connect color swatches</li></ul>","url":"https://www.figma.com/community/plugin/1049477946127252395","iconUrl":"https://www.figma.com/community/plugin/1049477946127252395/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1049477946127252395/thumbnail"}
