{"id":"991036921978543383","name":"match corner margins","lastUpdateDate":"2021-08-19T17:20:42.146Z","publisherHandle":"dnlrj","publisherImage":"https://s3-alpha.figma.com/profile/86fd9dad-49a3-4740-97da-32fa1bcc1a18","publisherId":"466014","publisherName":"Dan Araujo","description":"<p><strong>A one-click utility to resize an object to fill the frame according to top and left margins.</strong></p><p><br></p><h2><strong>🤔 How to use</strong></h2><ol><li>Place your object in a frame with your desired spacing from the top edge and the left edge.</li><li>Select your object (or multiple objects).</li><li>Run the plugin by finding it your plugins menu or open the Figma quick actions menu with <strong>Cmd + / </strong>or <strong>Cmd + P</strong> (or <strong>Ctrl + /</strong> or <strong>Ctrl + P </strong>on Windows), type <strong>mcm, </strong>and hit enter to quickly run the function.</li></ol><p><br></p><p><strong>Done! </strong>The object(s) will be resized so that the shape fills the frame with the bottom and right margins matching the previously established top and left margins.</p><p><br></p><h2><strong>📕 Notes and background</strong></h2><p><strong>Why this plugin?</strong></p><p>I often find myself placing an object in a frame according to how far I want it from the top left corner. Then I have to drag out the bottom right corner and eyeball where it approximately matches the same spacing I applied to the top left corner, wasting several seconds pressing alt to check spacing, and dragging/nudging the edges to fit. I find that this plugin cuts out a couple precious seconds of hassle.</p><p><br></p><p><strong>Plugin Notes:</strong></p><ul><li>All object types (such as shapes, components, text boxes, frames, and groups) are supported.</li><li>Multiple objects, within the same frame or across multiple different frames, can be selected and resized at once.</li><li>Selected objects must exist within a parent frame.</li></ul><p><br></p><h2><strong>☕️ Support the plugin</strong></h2><p>If you love the plugin and feel inclined to provide some small financial support to encourage the development of new features and bug fixes, that would be greatly appreciated. No pressure, of course!</p><p><a href=\"https://ko-fi.com/dnlrj\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Buy me a coffee</strong></a></p><p><br></p><p>_</p>","url":"https://www.figma.com/community/plugin/991036921978543383","iconUrl":"https://www.figma.com/community/plugin/991036921978543383/icon","thumbnailUrl":"https://www.figma.com/community/plugin/991036921978543383/thumbnail"}
