{"id":"1004068013946154597","name":"Project Portfolio Canvas","lastUpdateDate":"2021-08-02T17:29:49.253Z","publisherHandle":"luterceiro","publisherImage":"https://s3-alpha.figma.com/profile/5dec7175-0de0-4041-9ec3-e8941b679893","publisherId":"403617","publisherName":"Luciana Terceiro","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1022137123/2cb1c57d-f114-4d28-8e0c-874dd45ce179-cover.png","description":"<p>https://projectportfoliocanvas.com/</p><p><br></p><p>Manter um portfolio atualizado não é uma tarefa muito fácil. É fácil esquecer de fazê-lo e quando é o momento de incluir novos projetos, é sempre doloroso coletar todas as informações e imagens. O Canvas para Portfolio é um guia para ajudar você a manter o registro de seus projetos e organizar as informações necessárias para a construção de um portfolio interessante.</p><p><br></p><p>Para seu próprio registro e organização, não se preocupe em ser sucinto. Use o espaço necessário, escreva o quanto quiser e inclua todas as imagens que considerar interessante. O guia foi pensado para você ter as informações à mão. No momento da construção do portfolio público, você pode editar e retirar as informações que não quiser divulgar. É mais fácil apagar informações do que acrescentar :)&nbsp;</p><p><br></p><p><strong>Preencha as informações relevantes ao seu projeto. Nem todos os campos podem ser relevantes e se aplicam a todos os projetos.</strong></p><p><br></p><p><strong>Cuidado com informações confidenciais. </strong>Nesse caso, procure mascarar o que for possível e omita o que não puder ser registrado em outras plataformas externas à empresa ou cliente.</p><p><br></p><p>--------------------------------</p><p><strong>About it</strong></p><p><br></p><p>Keeping a portfolio up to date is one of the most boring tasks. It’s easily forgotten and when it’s time to include new projects, it’s always painful to collect all the information. The Portfolio Canvas is a guide to help you to keep your records and organize the needed information to build an interesting portfolio.</p><p><br></p><p>For your own record and organization, don’t worry about being succinct. Use as many words and pictures you want. The guide is designed for you to have your information at hand.</p><p><br></p><p>Not all fields going to be useful for all products, so fill only the ones that make sense to your project. And be careful with confidential information – don’t share this information on an external platform.</p>","url":"https://www.figma.com/community/file/1004068013946154597"}
