{"id":"1081590940951628314","name":"O que são Opções Binárias e como começar no Brasil","lastUpdateDate":"2022-03-04T14:56:15.448Z","publisherHandle":"investidor","publisherImage":"https://s3-alpha.figma.com/profile/b2e9b50d-8c67-404c-92a1-9214d369affd","publisherId":"1081585743357130183","publisherName":"Ricardo Campbell - Investidor Qualificado","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1617023430/29fd7735-b012-4fb6-8cba-9d20d465e498-cover.png","description":"<p>Investidores estão sempre buscando alternativas para rentabilizar seu capital.</p><p><br></p><p>Existe uma modalidade de investimentos pouco conhecida que faz uma combinação interessante entre bolsa de valores e apostas.</p><p><br></p><p>Iremos explicar de forma bastante didática tudo o que um iniciante precisa saber para começar no mercado de opções binárias no Brasil.</p><p><br></p><p>Vamos começar!</p><p><br></p><h2>O que são opções binárias?</h2><p><br></p><p>Da mesma forma que você apostaria em um time de futebol sobre o resultado de ganhar, perder ou empatar o jogo, opções binárias permitem que você aposte no resultado de um ativo: se vai subir ou cair.</p><p>Para cada operação, você sempre ganha ou perde a aposta. O nome \"binária\" vem daí, pois sempre há apenas dois resultados possíveis.</p><p><br></p><p>Por exemplo, digamos que seja 14h da tarde e você vai apostar que o preço do Bitcoin às 15h estará mais alto do que o preço atual. Em outras palavras, você está apostando que o preço vai subir dentro de 60 minutos.</p><p>Ao completar 60 minutos da colocação da aposta, se o preço do Bitcoin estiver acima do valor que estava há 60 minutos atrás, mesmo que seja apenas um centavo acima, você ganha a aposta. Ou seja, se antes o preço estava $ 37.450,12 e agora está $ 37.450,13 ou mais, você ganhou.</p><p><br></p><p>Ao acertar a opção binária, você obtém um lucro entre 60% a 100% do valor investido.</p><p><br></p><p>Mas e se você perder a aposta?</p><p><br></p><p>Depende da modalidade escolhida, mas em muitos casos você perde todo o valor investido. Por isso, é importante que o sucesso no longo prazo seja marcado por mais operações vencedoras do que perdedoras.</p><p>Entenda que opções binárias são instrumentos de curto prazo, com período fixo para cada operação, porém seu resultado financeiro será o acumulado de ganhos e perdas&nbsp;<strong>após fazer muitas operações</strong>.</p><p><br></p><h2>Como começar a operar no Brasil?</h2><p><br></p><p>O primeiro passo é criar uma conta em uma corretora de opções binárias. A melhor opção para brasileiros é a&nbsp;<a href=\"http://comoinvestirnabolsa.net/binary-site-oficial\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\">Plataforma Binary</a>, que possui 20 anos no mercado e mais de 100 ativos negociados.</p><p><br></p><h2>Como investir?</h2><p><br></p><p>Após criar sua conta, clique em \"<em>Depósito</em>\" no canto superior direito e escolha uma opção (transferência bancária, cartão de crédito, criptomoedas) para enviar seu dinheiro e começar a operar.</p><p><br></p><h2>Qual mercado operar?</h2><p><br></p><p>Ao entrar na aba \"<em>DTrader\"</em>, você irá visualizar um painel de \"<em>Mercados</em>\", onde você pode escolher entre:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Índices de Ações</strong>&nbsp;(aqui você pode operar sobre o índice de Ações Americanas, Europérias, Japonesas, etc.)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Matéria Prima</strong>&nbsp;(Ouro, Prata, Platina, Paládio)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Criptomoedas</strong>&nbsp;(Bitcoin e Ethereum)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Mercado de Câmbio</strong>&nbsp;(Dólar/Euro, Libra/Iene, etc.)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Índices Sintéticos</strong>&nbsp;(Índices de Volatilidade, entre outros)</p><p><br></p><p>Nem todos os mercados possuem os mesmos recursos. Por exemplo, o mercado de Ouro possui opções de&nbsp;<em>Sobe/Desce</em>,&nbsp;<em>Superior/Inferior</em>,&nbsp;<em>Toca/Não toca</em>. Já o mercado de Bitcoin possui a opção de&nbsp;<em>Multiplicadores</em>. Logo em seguida explicaremos cada uma dessas opções e suas diferenças.</p><p><br></p><p>Primeiro, vamos entender um pouco melhor a situação regulatória das opções binárias no Brasil.</p><p><br></p><h2>Opções Binárias é legalizado?</h2><p><br></p><p>Não existe nenhuma regulamentação em vigor para opções binárias no momento (2022). Ou seja, a CVM (Comissão de Valores Mobiliários), que é a entidade responsável por fiscalizar e regular o mercado financeiro no Brasil, não regulamenta opções binárias.</p><p>Isso significa que opções binárias não são permitidas nem proibidas, encontrando-se em uma zona cinzenta.</p><p><br></p><h2>Desde quando existem?</h2><p><br></p><p>Em 2008 opções foram lançadas na Chicago Board CBOE e na AMEX.</p><p><br></p><p>Desde então, inúmeros brokers (corretoras) como 24Option, IQ Option, Quotex, BinayCent, OlympTrade, Binary, entre outros surgiram tentando captar clientes.</p><p><br></p><p>Muitas corretoras são fraudulentas e roubam dinheiro dos clientes, por isso é preciso muito cuidado para apenas operar em plataformas seguras.</p><p><br></p><h2>Opções Binárias é seguro?</h2><p><br></p><p>É preciso ter em mente que opções binárias são extremamente arriscadas, por se tratar de um instrumento especulativo.</p><p><br></p><p>Não existe nenhuma garantia de que você irá ganhar dinheiro, você pode perder. Muitos entram nesse mercado sem estratégia alguma acreditando que irão ficar ricos da noite para o dia. Não faça isso.</p><p><br></p><p>Tenha uma estratégia bem definida e opere aos poucos, nunca colocando tudo de uma vez.</p><p><br></p><h2>Opções binárias são uma farsa?</h2><p><br></p><p>Há muitas corretoras e pessoas desonestas nesse mercado, prometendo ganhos fixos e iludindo com mentiras. Eles são uma farsa.</p><p>O instrumento opções binárias não necessariamente é uma fraude por causa das pessoas e operadores desonestos, é preciso saber diferenciar as coisas.</p><p><br></p><h2>Estratégias para operar opções binárias</h2><p><br></p><p>Opere com base na tendência do preço de um ativo. Por exemplo, se o preço de um índice está em tendência forte de alta, aposte na alta. Isso aumenta as chances de sucesso.</p><p>Mas como saber a tendência? É importante um conhecimento de análise técnica/gráfica. Estude pivôs de alta e de baixa, linhas de tendência, candles, médias móveis, índice de força relativa, padrões gráficos (figuras), ondas de Elliot e Teoria de Dow.</p><p><br></p><h2>Quais os tipos de opções binárias?</h2><p><br></p><p><strong>Ativos ou nada:</strong></p><p><br></p><p>Enquanto o ativo vai subindo ou caindo, você vai acumulando mais ganhos ou perdas.</p><p><br></p><p><strong>Tudo ou nada:</strong></p><p><br></p><p>Você ganha um valor fixo se acertar a direção do ativo (subiu ou caiu) e perde um valor fixo se errar.</p><p><br></p><p><strong>One Touch/ No Touch:</strong></p><p><br></p><p>Se o ativo chegar a determinado valor, ou se não chegar, a operação é finalizada.</p><p><br></p><p><strong>60 segundos:</strong></p><p><br></p><p>A operação acaba se o valor estipulado for atingido.</p><p>&nbsp;</p><p><strong>Range:</strong></p><p><br></p><p>O preço do ativo precisa ficar dentro dos limites (inferior e superior) estabelecidos durante o tempo definido.</p><p><br></p><h2>Quais as formas de operar?</h2><p><br></p><p>No Brasil, você pode operar opções binárias de três formas:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Manual</strong>: nesse método você faz tudo por conta própria, escolhe e opera as opções com base em seus próprios conhecimentos e decisões.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Sinais</strong>: é a modalidade em que você recebe informações indicando bons momentos de entrada/saída e decide se vai executar ou não.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Robot</strong>: é quando quem opera é um robô customizado. Nessa modalidade, você apenas escolhe o robô e ele faz tudo sozinho.</p><p><br></p><h2>Opções binárias vale a pena?</h2><p><br></p><p>Depende do seu perfil de investidor. Se você é conservador, ou seja, possui aversão a risco, não deve operar opções binárias.</p><p><br></p><p>Mesmo para investidores arrojados, o ideal é não comprometer uma quantia que possa fazer falta.</p><p><br></p><h2>Pontos positivos das opções binárias:</h2><p><br></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Flexibilização</strong>: a variada gama de opções permite que você tenha lucros expressivos a partir de eventos bem específicos.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Simplicidade</strong>: como as opções binárias não negociam o próprio ativo em si, mas apenas acompanham a movimentação do ativo, a operação fica bastante simplificada e não há custódia envolvida.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Acessibilidade</strong>: é possível começar com baixos valores e sem taxas de corretagem.</p><p><br></p><h2>Pontos negativos das opções binárias:</h2><p><br></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Alto risco envolvido</strong>: possibilidade de perder todo o capital investido.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Períodos curtos para análise e decisão</strong>: não é possível fazer apostas para períodos mais longos como meses ou anos.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Falta de clareza regulatória</strong>: é possível que no futuro a CVM venha a proibir a operação de opções binárias.</p><p><br></p><h2>Pesquise também outros investimentos de renda variável:</h2><p><br></p><p>Recomendamos que você pesquise e analise outras opções de investimento disponíveis no Brasil, como:</p><ul><li><strong>Ações</strong>: é possível comprar ações de empresas pensando em receber dividendos ou fazer day trading/ swing trading.</li><li><strong>Opções de ações</strong>: as opções dentro do mercado de ações possem os nomes CALL (opção de compra) e PUT (opção de venda). Essas opções consistem no direito de comprar ou vender uma ação por determinado preço.</li></ul><p><br></p><p>Gostou do artigo? Nos vemos em outras oportunidades aqui no Figma!</p>","url":"https://www.figma.com/community/file/1081590940951628314"}
