{"id":"954021564250730610","name":"Dynamic Data","lastUpdateDate":"2021-07-04T16:26:59.340Z","publisherHandle":"eberawi","publisherImage":"https://s3-alpha.figma.com/profile/da0aa1cb-e851-4811-b307-c9aa51cc1bdb","publisherId":"1788545","publisherName":"eberawi","description":"<p><strong>Dynamic Data</strong>&nbsp;is a simple plug-in that gives you the option of saving time through automation. This plug-in can save you hours of tedious work, enhancing organisation, and thus, productivity.&nbsp;</p><p><br></p><p>Built with the ability to create multiple variations of your artwork, it can integrate a single data source file, such as a CSV or XLSX file with a Figma document. If you are looking for a source that can assist you in saving time and avoiding data entry errors, <strong>Dynamic Data</strong> is the solution.</p><p><br></p><p>Examples of tasks it can assist with include the output of business cards and issuing numerous amounts of certificates for hundreds of individuals. Any job that is repetitive or monotonous can be time-consuming, but with <strong>Dynamic Data</strong> these endless hours spent on manually entering text data from a spreadsheet can be re-used using the same design.</p><p><br></p><p><br></p><h2><strong>How to Use Dynamic Data</strong></h2><p><br></p><ol><li>Select a frame layer</li><li>Ensure to rename the dynamic text layers (variable1 ... variable9)</li><li>Select the spreadsheet with the data</li><li>Select the export format</li><li>Click on Fetch and the new cloned frames will be ready to be exported once finished</li><li>Click on Export and all the files will be exported at once in the format you selected</li></ol><p><br></p><p><br></p><p><strong>Please note the following:</strong></p><ul><li>Naming the variables is not case sensitive.</li><li>The plug-in skips empty columns in the data source file. So, if the first column is empty, the second column will be used for Variable1.</li></ul>","url":"https://www.figma.com/community/plugin/954021564250730610","iconUrl":"https://www.figma.com/community/plugin/954021564250730610/icon","thumbnailUrl":"https://www.figma.com/community/plugin/954021564250730610/thumbnail"}
