{"id":"829089184334973766","name":"Property Randomizer","lastUpdateDate":"2021-09-19T18:10:58.551Z","publisherHandle":"aaronmw","publisherImage":"https://s3-alpha.figma.com/profile/f20dd332-8a16-439e-87af-fa32f3228376","publisherId":"491","publisherName":"Aaron Wright","description":"<p>Randomize one or more properties of your selected elements. Very handy for randomizing graphs, lists, confetti pieces, and more. It's pretty powerful and I'm sure you'll find fun stuff to use it for!</p><p><br></p><h1><strong>Properties you can randomize:</strong></h1><p><br></p><ul><li>Text</li><li>Width</li><li>Height</li><li>X</li><li>Y</li><li>Opacity</li><li>Rotation</li><li>Fill Color</li><li>Fill Opacity</li><li>Stroke Color</li><li>Stroke Opacity</li><li>Stroke Weight</li><li>Layer Blur</li><li>Arc Starting Angle</li><li>Arc Ending Angle</li></ul><p><br></p><p>Missing one? Just ask me and I can try to add support for it.</p><p><br></p><h1>How to use:</h1><p><br></p><p>Make a selection of elements (components, frames, shapes, etc.) Select whichever properties you'd like to randomize, tweak the config to your liking, and click the button at the bottom.</p><p><br></p><p><strong>Tip:</strong> Mash the Return key to keep re-generating new randomizations within the constraints you set. Not happy with your confetti or bar graph? Just. Keep. Randomizing!</p><p><br></p><p>You've got three methods of randomization to choose from, per property:</p><p><br></p><ul><li><strong>Range</strong> for randomizing bars in a graph, for example, allowing you to constrain height between a min and max value.</li></ul><p><br></p><ul><li><strong>List</strong> for making confetti, for example, by letting you randomize the fillColor of your selected elements, but keeping them within your chosen palette.</li></ul><p><br></p><ul><li><strong>Calc</strong> does multiplication or addition rather than just picking numbers out of the air. Consider slowly growing bubbles by multiplying their width and height by 1.1–1.5x. Just keep randomizing and they'll keep growing slightly until you're happy with the results.</li></ul><p><br></p><p>For each type, you have the option to apply the randomized values in a sorted order. Consider making a bar graph, but you want to show profits getting bigger and bigger. Generate as many as you like until you're happy, in mere seconds!</p><p><br></p><p><strong>Note:</strong> If you try to randomize a property that's unsupported by the elements in your selection (eg: \"strokeColor\" on elements without a stroke), that property will simply be skipped; supported properties will still be randomized.</p><p><br></p><p>Feedback would be very much appreciated. Enjoy!</p>","url":"https://www.figma.com/community/plugin/829089184334973766","iconUrl":"https://www.figma.com/community/plugin/829089184334973766/icon","thumbnailUrl":"https://www.figma.com/community/plugin/829089184334973766/thumbnail"}
