{"id":"958198956095698455","name":"Tini design system","lastUpdateDate":"2021-11-30T03:24:03.069Z","publisherHandle":"tubui","publisherImage":"https://s3-alpha.figma.com/profile/db96e14d-6de8-4693-b2b4-1edac9702737","publisherId":"2058158","publisherName":"Tu Bui","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1337328508/62b90905-dcb1-48d5-a6f4-760c4de190f4-cover.png","description":"<p>The Tiki's Tini Apps design team builds a design system for the Tini App platform based on the Tiki design system. The Tini will help product designers to uniform the user interfaces to focus on a better user experience, deliver ideas and products faster.</p><p><br></p><p>If you have questions or suggestions you can reach out to us on the<a href=\"https://community.tiki.vn/c/tini-design/16\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> Tini Design community</a></p><p><br></p><p><strong>v2.0</strong></p><p><em>November 30th, 2021</em></p><p><br></p><p>The&nbsp;design&nbsp;tokens are the&nbsp;shared language between designers &amp; developers; they not only make it easier to collaborate, maintain and scale the&nbsp;design&nbsp;system but also help ensure consistency across platforms and products. We experiment with the Tini design system's design tokens from the beginning, and today we are happy to release the Tini v2.0 with the official design tokens library. We will write some articles about this, and please be patient ;)</p><p><br></p><p>We also have some improvements for the components library</p><p>- New button type: the Over background button</p><p>- Change the color value/size/naming convention of some components to make them more accessible as the Neutral button, the disabled state of all components...etc</p><p><br></p><p>That's it for November. See you next month!!! Stay healthy.</p><p><br></p><p>-----------------</p><p><a href=\"https://developer.tiki.vn/en/docs/design/figma/download\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">View history</a></p>","url":"https://www.figma.com/community/file/958198956095698455"}
