{"id":"1099374775038540008","name":"Tiny Dinos - Builder (cc0)","lastUpdateDate":"2022-04-26T12:00:42.901Z","publisherHandle":"fabriiikator","publisherImage":"https://s3-alpha.figma.com/profile/d747c965-dc34-4d38-abd5-2bf28be862c0","publisherId":"1045054347961732741","publisherName":"Fabriiikator","thumbnailUrl":"https://s3-alpha.figma.com/hub/file/1804650233/4ff7fcdb-638e-47a5-8dc9-887b3a3dd5d3-cover.png","description":"<p><strong>10k Tiny Dinos vibing on the omnichain.</strong></p><p><br></p><p>Here is a collection of assets created as components with variants so that you can make your own dinos easily.</p><p><br></p><p>DUPLICATE file above and do whatever you want with it.</p><p><br></p><p><strong>The NFT collection has a CC0 license, however Figma applies the also common CC BY 4.0 license which is also great but ensures the creators get credit.</strong></p><p><br></p><p>----------------------------------------</p><p><br></p><p><strong>-&gt; CC0 \"No Rights Reserved\"</strong></p><p><em>CC0 enables scientists, educators, artists and other creators and owners of copyright- or database-protected content to waive those interests in their works and thereby place them as completely as possible in the public domain, so that others may freely build upon, enhance and reuse the works for any purposes without restriction under copyright or database law.</em></p><p><br></p><p><strong>-&gt; CC BY 4.0</strong></p><ul><li><strong>Share</strong>&nbsp;— copy and redistribute the material in any medium or format</li><li><strong>Adapt</strong>&nbsp;— remix, transform, and build upon the material for any purpose, even commercially.</li><li><strong>Attribution</strong>&nbsp;—&nbsp;You must give the artist appropriate credit, provide a link to the license, and&nbsp;indicate if changes were made.</li></ul><p><br></p><p>#rawr #CC0</p><p><br></p><p><strong>Donate</strong></p><p>If you found this file useful then please feel free to sling me some eth so I can buy back in :D</p><p>--&gt; <code>0xB7BBF49a39A22419401b72B6ed6e207E4b0EF924</code></p>","url":"https://www.figma.com/community/file/1099374775038540008"}
