{"id":"832335368157959508","name":"Prototype Quick Link","lastUpdateDate":"2021-07-28T15:38:14.195Z","publisherHandle":"maxmartynov","publisherImage":"https://s3-alpha.figma.com/profile/44c721cb-5be1-45e4-9425-eaf9e6c44f9b","publisherId":"77","publisherName":"Max Martynov","description":"<p>This is a plugin that provides an easy way to copy a <em>Prototype link</em> to specific frames to the clipboard without having to switch to the Presentation mode.</p><p><br></p><p><strong>How To Use:</strong></p><p>Select layers and run the <em>Copy prototype link</em> command, and the link will be copied to the clipboard. You can also select and copy links to multiple selected Frames. In this case, each link will start with the name of its Frame.</p><p><br></p><p><strong>First Setup:</strong></p><p>The plugin must know the <strong>File Key</strong> to be able to create a prototype link. But this Key is private and it's only accessible to plugins published internally to a company that is on an Organization plan. So to make the plugin work you need to insert this <em>File Key</em> manually on first start of the plugin.</p><p><br></p><p><strong>Set the File Key:</strong></p><p>1. Click the <strong>Share</strong> button on the top panel and click the <strong>Copy link</strong>. Or you also can copy the whole File URL from the browser's address bar. The File URL looks like: <code>https://figma.com/file/e9z7p5lisUPmRe9z7p5lisUPm/FileName</code></p><p>2. Go to: Plugins -&gt; Prototype Quick Link -&gt; Settings</p><p>3. Paste the copied URL to the input field and the plugin will extract the File Key automatically. You also can paste only the File Key to the input field.</p><p>4. Done! Click <strong>Save</strong> and use the plugin</p><p><br></p><p><strong>Info:</strong></p><p>Your file share link is not sent to any external server.</p><p><br></p>","url":"https://www.figma.com/community/plugin/832335368157959508","iconUrl":"https://www.figma.com/community/plugin/832335368157959508/icon","thumbnailUrl":"https://www.figma.com/community/plugin/832335368157959508/thumbnail"}
