{"id":"1131290121606601469","name":"FluentC Translate","lastUpdateDate":"2022-07-20T14:35:44.529Z","publisherHandle":"Fluentc","publisherImage":"https://www.gravatar.com/avatar/c7729b852d5af9b9c8fd911d4b70425a?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_f_v2.png","publisherId":"1119638247387467884","publisherName":"FluentC","description":"<p>FluentC is a translation acceleration tool. The FluentC Figma plug-in allows you to see your design in 75 languages with only three steps. Select your text, source language, and the language into which you want your text translated, and hit translate. A new layer with the new text is inserted into your design. That’s it.</p><p><br></p><p>All of the translations are stored in your FluentC account and can be used by your development team to be inserted into your applications in the future.</p><p><br></p><p>A FluentC subscription is required to use the plugin. Read more at<a href=\"https://www.fluentc.io/\" rel=\"noreferrer noopener nofollow ugc\" target=\"_blank\"> https://www.fluentc.io</a></p><p><br></p><p>FluentC es una herramienta de aceleración de traducción. El complemento FluentC Figma le permite ver su diseño en 75 idiomas con solo tres pasos. Seleccione su texto, el idioma de origen y el idioma al que desea traducir su texto y presione traducir. Se inserta una nueva capa con el nuevo texto en su diseño. Eso es todo.</p><p><br></p><p>Todas las traducciones se almacenan en su cuenta de FluentC y su equipo de desarrollo puede usarlas para insertarlas en sus aplicaciones en el futuro.</p><p><br></p><p>Se requiere una suscripción a FluentC para usar el complemento. Lea más en https://www.fluentc.io</p><p><br></p><p><br></p><p>FluentC एक अनुवाद त्वरण उपकरण है। FluentC Figma प्लग-इन आपको केवल तीन चरणों के साथ 75 भाषाओं में अपना डिज़ाइन देखने की अनुमति देता है। अपना टेक्स्ट, स्रोत भाषा और वह भाषा चुनें जिसमें आप अपने टेक्स्ट का अनुवाद करना चाहते हैं, और अनुवाद को हिट करें। आपके डिज़ाइन में नए टेक्स्ट के साथ एक नई परत डाली गई है। इतना ही।</p><p><br></p><p>सभी अनुवाद आपके FluentC खाते में संग्रहीत हैं और भविष्य में आपके अनुप्रयोगों में सम्मिलित करने के लिए आपकी विकास टीम द्वारा इसका उपयोग किया जा सकता है।</p><p><br></p><p>प्लगइन का उपयोग करने के लिए FluentC सदस्यता की आवश्यकता होती है। https://www.fluentc.io पर और पढ़ें</p>","url":"https://www.figma.com/community/plugin/1131290121606601469","iconUrl":"https://www.figma.com/community/plugin/1131290121606601469/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1131290121606601469/thumbnail"}
