{"id":"1099277867718022006","name":"Text Porter","lastUpdateDate":"2022-04-25T10:16:41.548Z","publisherHandle":"kirkbentley","publisherImage":"https://www.gravatar.com/avatar/fde981ff60912116a98b1c0d988cc765?size=240&default=https%3A%2F%2Fs3-alpha.figma.com%2Fstatic%2Fuser_k_v2.png","publisherId":"1069910633753426023","publisherName":"Kirk Bentley","description":"<h2>Quickly Export and Import CSV Copy Decks</h2><p><br></p><p>Looking for an easy way to manage copy decks in your product design process? Text Porter might be what you are after.</p><p><br></p><p>Text Porter will generate a CSV file containing the text block labels, text and the root frame name. The plugin will also export PNG's of all the root frames for reference when providing to copywriters outside of Figma.</p><p><br></p><p>Supports updating both <strong>text</strong> and <strong>name</strong> of text blocks.</p><p><br></p><h2>How To Use</h2><p><br></p><ol><li>Select your <strong>frames</strong> containing the UX copy you would like to export</li><li>Run the Text Porter plugin and click the \"<strong>Export</strong>\" button to generate a zip file containing a CSV file and reference images</li><li>Send the zip to your copywriter and have them make the copy updates in the \"<strong>Text</strong>\" column and return the updated CSV file <strong><em>(Do not edit the ID column, this is used for the import process)</em></strong></li><li>Run the Text Porter plugin and click the \"<strong>Import</strong>\" button and selected the updated CSV file</li><li>Watch all the text blocks update with your new copy changes</li><li>Profit</li></ol><p><br></p><p><strong>Note:</strong> Does not currently play well with mixed styles. Will replace with initial style used in mixed style block.</p>","url":"https://www.figma.com/community/plugin/1099277867718022006","iconUrl":"https://www.figma.com/community/plugin/1099277867718022006/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1099277867718022006/thumbnail"}
