{"id":"788799088384104964","name":"Useberry","lastUpdateDate":"2021-10-06T11:58:02.925Z","publisherHandle":"919281","publisherImage":"https://s3-alpha.figma.com/profile/f1639d48-7745-4d61-98c2-b081458782ab","publisherId":"919281","publisherName":"Bill Kirimkiridis","description":"<p>Useberry enables UI/UX designers, agile product managers &amp; ingenious marketers to get user feedback &amp; rich, actionable insights on their product before the stage of development.</p><p><br></p><p>It helps Product Teams to swiftly build better digital experiences by integrating testing right on the discovery/design/prototype phase while saving time and resources.</p><p>&nbsp;</p><p>Now imagine this testing process natively integrated into one of the most popular design platforms: Figma. Without your workflow being interrupted, you can now start testing your designs and share them with testers, or even your teammates, managers or collaborators.</p><p>&nbsp;</p><p>Useberry plugin can work as a prototype testing plugin and help Figma users test innovative UX ideas and collect users’ feedback and rich insights right on the spot.</p><p><br></p><p>Additionally, allows exporting design elements that can be used for information architecture, preference and impression testing like Preference Test, First Click, 5 Second Test, and Card Sorting.</p><p>&nbsp;</p><p>Making good use of the existing online platform’s technology, Useberry’s native integration in Figma is the plugin’s key differentiator, accompanied by a variant of test types and a series of other handy features, each one addressing a unique need and a UX design problem seeking a solution in the process of building digital experiences.</p><p>&nbsp;</p><p>And so the testing gets started - without a hassle!</p><p>&nbsp;</p><p>Useberry plugin is now available for Figma and promises to change the product development process in the best, safest, and fastest way.&nbsp;</p><p>&nbsp;</p><p>Learn more about useberry on useberry.com</p>","url":"https://www.figma.com/community/plugin/788799088384104964","iconUrl":"https://www.figma.com/community/plugin/788799088384104964/icon","thumbnailUrl":"https://www.figma.com/community/plugin/788799088384104964/thumbnail"}
