{"id":"1009688420146523321","name":"random number generator","lastUpdateDate":"2021-09-01T15:33:53.931Z","publisherHandle":"dnlrj","publisherImage":"https://s3-alpha.figma.com/profile/86fd9dad-49a3-4740-97da-32fa1bcc1a18","publisherId":"466014","publisherName":"Dan Araujo","description":"<p><strong>Select text layers and replace them with randomly generated numbers, lightning fast. Replace existing numbers within a text layer, reuse a custom range, disable duplicates, and format long numbers with commas.</strong></p><p><br></p><h2><strong>🎥 Watch demo video</strong></h2><p>Check out this <a href=\"https://www.youtube.com/watch?v=_GNl5pRnoG8\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">quick video</a> to see what this plugin can do!</p><p><br></p><h2><strong>⚡️ Generating numbers with quick action commands</strong></h2><p>The quickest way to use this plugin is to use Figma's quick actions menu. To open this menu on Mac, use <strong>Cmd + / </strong>or <strong>Cmd + P</strong>. On Windows, use <strong>Ctrl + /</strong> or <strong>Ctrl + P</strong>. With this menu open, you can type a command and hit enter to quickly generate random numbers.</p><p><br></p><p><strong>[-] Type a valid prefix before the command</strong></p><p><strong>‣ g </strong>| For example: <strong>g</strong>100 / <strong>g</strong>thousand / <strong>g </strong>saved</p><p><strong>‣ rng </strong>| For example: <strong>rng </strong>10000 / <strong>rng</strong> million / <strong>rng</strong> saved</p><p><strong>‣ random </strong>| For example: <strong>random</strong>10 / <strong>random</strong> hundred / <strong>random</strong>saved</p><p><strong>‣ num </strong>| For example: <strong>num </strong>1000000 / <strong>num</strong>hundredthousand / <strong>num</strong>saved</p><p><br></p><p><strong>‣ [-]10, [-]100, ... , [-]1000000</strong></p><p>This will generate random numbers for all selected text layers between 1 and whatever amount of zeros you typed. For example, pressing <strong>Cmd + /, </strong>typing <strong>g100000, </strong>and hitting <strong>Enter</strong> will generate numbers between 1 - 100,000.</p><p><br></p><p><strong>‣ [-] ten, [-] hundred, ... , [-] million</strong></p><p>This has the same functionality as the above, but you can type the name of the number instead. For example, pressing <strong>Cmd + /, </strong>typing <strong>random ten, </strong>and hitting <strong>Enter</strong> will generate numbers between 1 - 10.</p><p><br></p><p><strong>‣ [-] saved</strong></p><p>This will generate numbers from your saved range. By default, this will be 1 through 50, but you can change it in the plugin UI. For example, pressing <strong>Cmd + /, </strong>typing <strong>rng saved, </strong>and hitting <strong>Enter</strong> will generate numbers between <em>Custom X</em> -<em> Custom Y</em>.</p><p><br></p><h2><strong>⚙️ Using the plugin UI</strong></h2><p>Open up the plugin UI by navigating to it in your Plugins dropdown, or open up the quick actions menu (Cmd + /) and type <strong>rng settings</strong>. In the plugin settings window, you can do the following:</p><p><br></p><p><strong>‣ Modify your saved range</strong></p><p>Set up your minimum and maximum to generate your random numbers from. You can go really high (into the billions), so go wild. The plugin will remember this range, and you can also quickly generate new numbers from your saved range without the plugin open. See <strong>[-] saved</strong> above.</p><p><br></p><p><strong>‣ Rapidly generate numbers</strong></p><p>Keep clicking \"Randomize\" or hitting the Enter key and you'll regenerate numbers for all your selected text layers. Keep going until you see a set of numbers that is perfect.</p><p><br></p><p><strong>‣ Toggle the \"Only replace existing numbers\" setting </strong>(Off by default)</p><p>Decide whether to replace the entire contents of a selected text layer with a generated number, or scan through the layer and replace any numbers found with newly generated number. Text layers without numbers in them will not be affected.</p><p><br></p><p><strong>‣ Toggle the \"Prevent Duplicate\" setting </strong>(Off by default)</p><p>Decide whether to prevent duplicate numbers when generating numbers. This is a good way to generate unique sets of numbers or randomize list order. If the amount of numbers you are generating exceeds the amount you define in your range, the plugin will need to generate some duplicates.</p><p><br></p><p><strong>‣ Toggle the \"Format with commas\" setting </strong>(On by default)</p><p>Decide whether to show commas for numbers above 999. For example, you'd want to toggle this on if you're generating regular numbers, but you might want to toggle it off if you're generating numbers for a data centric UI or a random list of years (2021 vs 2,021).</p><p><br></p><h2><strong>☕️ Support the plugin</strong></h2><p>If you love the plugin and feel inclined to provide some small financial support to encourage the development of new features and bug fixes, that would be greatly appreciated. No pressure, of course!</p><p><a href=\"https://ko-fi.com/dnlrj\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"><strong>Buy me a coffee</strong></a></p><p><br></p><p>_</p>","url":"https://www.figma.com/community/plugin/1009688420146523321","iconUrl":"https://www.figma.com/community/plugin/1009688420146523321/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1009688420146523321/thumbnail"}
