{"id":"734140091470043718","name":"Dynamic Component Resizer","lastUpdateDate":"2019-08-13T17:04:30.561Z","publisherHandle":"1458460","publisherImage":"https://s3-alpha.figma.com/profile/49c3acef-0afe-477a-a59b-d0ff51c9e5ed","publisherId":"1458460","publisherName":"Daniel Maddock","description":"With this plugin, you'll be able to setup components and resize their instances while maintaining the spacings that you've set in the master. This is done to maintain spacing for when the height of an element has changed in the instance, i.e. if you have text change from 1 line to 2. \n\nRequirements:\n\nMaster components are required to have a frame, the plugin looks for this. Within the frame you must have 2 elements; these are the ones that you'll fill up with content and will change from instance to instance. This usually is a \"header\" and \"body copy\" (see artwork picture above). \n\nThe frame must have the following settings:\n- Either contrained \"top and bottom\" or \"scale\" (vertical) \n\nThe top element must have the following settings:\n- Constrained to the top\n- Grow vertically (for text)\n- Align top (for text)\n\nThe bottom element must have the following settings:\n-  Contrained to the bottom\n- Grow vertically (for text)\n- Align bottom (for text)\n\nIf you've done this setup, open up the plugin modal, select the element or elements you want to resize and click \"run\". \n\nThe plugin will run it's magic. It will maintain the space between the two elements within the frame (in the example in the artwork, 20px). If you want to change the spacing, adjust the master, then select the elements and return the plugin. \n\nI will create an automatic resizer when figma allows for long lasting plugins. \n\nAny other feedback, feel free to email me at daniel_maddock@intuit.com","url":"https://www.figma.com/community/plugin/734140091470043718","iconUrl":"https://www.figma.com/community/plugin/734140091470043718/icon","thumbnailUrl":"https://www.figma.com/community/plugin/734140091470043718/thumbnail"}
