{"id":"1012112455906916204","name":"DSync","lastUpdateDate":"2021-10-08T13:02:42.584Z","publisherHandle":"lizasvit","publisherImage":"https://s3-alpha.figma.com/profile/539a645c-c6d4-435a-bc89-089f78c68be3","publisherId":"1965234","publisherName":"Liza Svitanko","description":"<p>This plugin helps the designers and developers to automate the process of syncing Figma design system changes straight to the codebase design system.</p><p><br></p><p>It is quite useful for the designers to make changes in the design system without notifying developers about each change. Adding 10 new icons in Figma can now be easily transformed to the code as files with one click instead of exporting them manually by the developer. Changing the accent color will not only take effect everywhere it's used in Figma components, but also in the code components just as fast.</p><p><br></p><p>At the moment, the plugin works with such design tokens as</p><ul><li>icons — it searches for \"COMPONENT\" types on a Figma page and returns them in .svg format only</li><li>colors — it searches for \"PAINT\" types on a Figma page and returns them in .json format</li><li>typography — it searches for \"TEST\" types on a Figma page and returns them in .json format</li></ul><p><br></p><p>For instance, if we run the plugin on the page with icons and send the changes, the PR will be creates with all the new .svg files, which are not in the base branch yet.</p><p><br></p><p>Plugin form has several fields which are necessary to be provided:</p><ul><li>repo name — the name of your Github repository with the code design system</li><li>your Github token — <a href=\"https://docs.github.com/en/github/authenticating-to-github/keeping-your-account-and-data-secure/creating-a-personal-access-token\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">here are the instructions</a> of how to create it)</li><li>owner name — your Github nickname if you own the repo or the name of the company</li><li>head branch — the name of the branch where you make the changes to your design system</li><li>base branch — the name of the base branch where you are to pull your changes</li></ul><p><br></p><p>By pushing the \"Sync\" button it pushes all found token styles to the head branch of the provided repo and creates a pull request to the main branch.</p><p><br></p><p>📩 Do not hesitate to suggest any additional functionality if you think the plugin might be helpful to you!</p>","url":"https://www.figma.com/community/plugin/1012112455906916204","iconUrl":"https://www.figma.com/community/plugin/1012112455906916204/icon","thumbnailUrl":"https://www.figma.com/community/plugin/1012112455906916204/thumbnail"}
