{"id":"1038086438446539988","name":"Grapic for FigJam","lastUpdateDate":"2021-12-08T14:02:53.577Z","publisherHandle":"GrapicApp","publisherImage":"https://s3-alpha.figma.com/profile/fea6c546-ee25-4fca-b925-59162088e4a4","publisherId":"1043506452236457256","publisherName":"Grapic","description":"<p>Screen share your physical whiteboard or notebook in remote and hybrid meetings!</p><p><br></p><p>Grapic is the iPhone app that lets you use real pen, paper, and whiteboards with your remote colleagues, clients and friends.</p><p><br></p><p>If your prefer sketching on a scrap of paper to get your point across, but find yourself in remote meetings, Grapic was made for you!</p><p><br></p><p>Grapic uses augmented reality and image processing to keep things steady and straight so you can focus on what you're writing. It's like screen sharing your paper!</p><p><br></p><p><strong>GRAPIC FOR FIGJAM</strong></p><p>With the Grapic for FigJam widget you can seamlessly add your realtime sketches to your FigJam sessions.</p><ul><li>Share your sketching in realtime without leaving FigJam</li><li>Lets everybody in the FigJam session to join seamlessly</li><li>Adds your snapshots automatically to FigJam so you can continue to work on your ideas after you are done sketching</li></ul><p><br></p><p><strong>HOW TO GET STARTED</strong></p><ol><li>Download the Grapic app for iOS and sign up for a free account</li><li>Open the Grapic for FigJam widget and press \"Start Grapic\"</li><li>Scan the QR code and start sketching</li></ol><p><br></p><p><strong>COLLABORATE ONLINE WITH PEN AND PAPER</strong></p><p>Nothing beats the real thing. Tactile, direct and real time.</p><p>Now also remote.</p><p>Use real pen and paper, sticky notes, and whiteboards, live with your remote colleagues and clients:</p><ul><li>Agile meetings: daily standup, sprint planning, retrospective</li><li>Problem solving: brainstorm, mind map, diagram, graphs</li><li>Explain new concepts: draw by hand as you explain</li><li>Design: mockups, wireframes, architecture</li><li>Sketch remotely with clients: great for architects, technical sales, UX, and many more</li></ul><p><br></p><p>All you need is your phone and something to scribble or draw on. Explain everything like you were in the same room together.</p><p><br></p><p>Read more at <a href=\"https://www.grapic.co/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">https://www.grapic.co/</a></p>","url":"https://www.figma.com/community/widget/1038086438446539988","iconUrl":"https://www.figma.com/community/widget/1038086438446539988/icon","thumbnailUrl":"https://www.figma.com/community/widget/1038086438446539988/thumbnail"}
